local ____lualib = include("lualib_bundle")
local __TS__Class = ____lualib.__TS__Class
local __TS__ArrayFilter = ____lualib.__TS__ArrayFilter
local __TS__ArrayMap = ____lualib.__TS__ArrayMap
local __TS__StringReplaceAll = ____lualib.__TS__StringReplaceAll
local __TS__ArrayIndexOf = ____lualib.__TS__ArrayIndexOf
local __TS__ArrayFind = ____lualib.__TS__ArrayFind
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["11"] = 1,["12"] = 1,["13"] = 2,["14"] = 2,["15"] = 3,["16"] = 3,["17"] = 4,["18"] = 4,["19"] = 4,["20"] = 4,["21"] = 4,["22"] = 4,["23"] = 4,["24"] = 4,["25"] = 4,["26"] = 4,["27"] = 4,["28"] = 4,["29"] = 4,["30"] = 4,["31"] = 4,["32"] = 4,["33"] = 4,["34"] = 4,["35"] = 4,["36"] = 4,["37"] = 4,["38"] = 4,["39"] = 4,["40"] = 4,["41"] = 4,["42"] = 4,["43"] = 4,["44"] = 4,["45"] = 4,["46"] = 4,["47"] = 4,["48"] = 4,["49"] = 4,["50"] = 4,["51"] = 4,["52"] = 4,["53"] = 4,["54"] = 4,["55"] = 4,["56"] = 4,["57"] = 4,["58"] = 4,["59"] = 4,["60"] = 4,["61"] = 4,["62"] = 4,["63"] = 4,["64"] = 4,["65"] = 4,["66"] = 4,["67"] = 4,["68"] = 4,["69"] = 4,["70"] = 4,["71"] = 4,["72"] = 4,["73"] = 4,["74"] = 4,["75"] = 4,["76"] = 4,["77"] = 4,["78"] = 4,["79"] = 4,["80"] = 4,["81"] = 4,["82"] = 4,["83"] = 4,["84"] = 4,["85"] = 4,["86"] = 4,["87"] = 4,["88"] = 4,["89"] = 4,["90"] = 4,["91"] = 5,["92"] = 6,["93"] = 6,["94"] = 7,["95"] = 7,["96"] = 8,["97"] = 8,["98"] = 8,["99"] = 8,["100"] = 8,["101"] = 8,["102"] = 8,["103"] = 8,["104"] = 8,["105"] = 8,["106"] = 8,["107"] = 8,["108"] = 8,["109"] = 8,["110"] = 8,["111"] = 8,["112"] = 8,["113"] = 8,["114"] = 8,["115"] = 9,["116"] = 9,["117"] = 10,["118"] = 10,["119"] = 10,["120"] = 10,["121"] = 12,["122"] = 12,["123"] = 12,["124"] = 13,["125"] = 13,["126"] = 13,["127"] = 13,["128"] = 14,["129"] = 14,["130"] = 14,["131"] = 14,["132"] = 14,["133"] = 14,["134"] = 15,["135"] = 15,["136"] = 16,["137"] = 16,["138"] = 17,["139"] = 17,["140"] = 17,["141"] = 18,["142"] = 18,["143"] = 19,["144"] = 19,["145"] = 20,["146"] = 20,["147"] = 21,["148"] = 21,["149"] = 22,["150"] = 22,["151"] = 23,["152"] = 23,["153"] = 25,["154"] = 26,["155"] = 26,["156"] = 27,["157"] = 27,["158"] = 28,["159"] = 28,["160"] = 29,["161"] = 29,["162"] = 30,["163"] = 30,["164"] = 34,["165"] = 34,["166"] = 35,["167"] = 35,["168"] = 36,["169"] = 36,["170"] = 37,["171"] = 37,["172"] = 39,["173"] = 39,["174"] = 40,["175"] = 40,["176"] = 41,["177"] = 41,["178"] = 42,["179"] = 42,["180"] = 43,["181"] = 43,["182"] = 44,["183"] = 44,["184"] = 45,["185"] = 45,["186"] = 48,["187"] = 48,["188"] = 49,["189"] = 49,["190"] = 50,["191"] = 50,["192"] = 51,["193"] = 51,["194"] = 52,["195"] = 52,["196"] = 54,["197"] = 54,["198"] = 56,["199"] = 56,["200"] = 57,["201"] = 57,["202"] = 59,["203"] = 59,["204"] = 61,["205"] = 61,["206"] = 62,["207"] = 62,["208"] = 64,["209"] = 64,["210"] = 65,["211"] = 65,["212"] = 67,["213"] = 67,["214"] = 68,["215"] = 68,["216"] = 69,["217"] = 69,["218"] = 70,["219"] = 70,["220"] = 71,["221"] = 71,["222"] = 73,["223"] = 73,["224"] = 75,["225"] = 75,["226"] = 76,["227"] = 76,["228"] = 77,["229"] = 77,["230"] = 78,["231"] = 78,["232"] = 79,["233"] = 79,["234"] = 80,["235"] = 80,["236"] = 104,["237"] = 105,["238"] = 106,["239"] = 107,["240"] = 108,["241"] = 109,["242"] = 110,["243"] = 111,["244"] = 112,["245"] = 115,["246"] = 116,["247"] = 116,["248"] = 117,["249"] = 117,["250"] = 118,["251"] = 118,["252"] = 119,["253"] = 119,["254"] = 120,["255"] = 120,["256"] = 122,["257"] = 122,["258"] = 123,["259"] = 123,["260"] = 124,["261"] = 124,["262"] = 127,["263"] = 128,["264"] = 128,["265"] = 129,["266"] = 129,["267"] = 130,["268"] = 130,["269"] = 133,["270"] = 137,["271"] = 140,["272"] = 140,["273"] = 140,["275"] = 140,["276"] = 144,["277"] = 145,["278"] = 146,["279"] = 147,["280"] = 148,["281"] = 149,["282"] = 150,["283"] = 151,["284"] = 144,["285"] = 154,["286"] = 155,["287"] = 155,["288"] = 155,["289"] = 156,["290"] = 157,["291"] = 158,["293"] = 155,["294"] = 155,["295"] = 154,["296"] = 163,["297"] = 165,["298"] = 165,["299"] = 165,["300"] = 165,["301"] = 165,["302"] = 165,["303"] = 165,["304"] = 165,["305"] = 165,["306"] = 167,["307"] = 168,["308"] = 169,["309"] = 167,["310"] = 172,["311"] = 173,["312"] = 174,["313"] = 172,["314"] = 178,["315"] = 179,["316"] = 180,["317"] = 181,["319"] = 183,["320"] = 178,["321"] = 185,["322"] = 186,["323"] = 187,["325"] = 189,["326"] = 191,["327"] = 193,["328"] = 194,["329"] = 195,["330"] = 196,["331"] = 197,["332"] = 198,["333"] = 200,["334"] = 201,["335"] = 202,["336"] = 203,["337"] = 204,["338"] = 205,["339"] = 206,["340"] = 207,["341"] = 209,["342"] = 191,["343"] = 212,["344"] = 214,["345"] = 215,["346"] = 216,["347"] = 217,["349"] = 219,["350"] = 212,["351"] = 222,["352"] = 223,["353"] = 223,["354"] = 223,["355"] = 223,["356"] = 223,["357"] = 223,["358"] = 223,["359"] = 222,["360"] = 226,["361"] = 227,["362"] = 226,["363"] = 229,["364"] = 230,["365"] = 229,["366"] = 240,["367"] = 241,["368"] = 242,["369"] = 243,["371"] = 245,["372"] = 240,["373"] = 248,["374"] = 250,["375"] = 251,["376"] = 253,["377"] = 254,["378"] = 255,["379"] = 256,["380"] = 257,["381"] = 258,["383"] = 261,["384"] = 248,["385"] = 264,["386"] = 265,["387"] = 266,["388"] = 267,["390"] = 270,["391"] = 271,["393"] = 281,["394"] = 282,["395"] = 292,["396"] = 293,["397"] = 302,["398"] = 303,["399"] = 308,["400"] = 309,["401"] = 313,["402"] = 314,["403"] = 316,["404"] = 317,["406"] = 321,["407"] = 322,["409"] = 324,["410"] = 325,["412"] = 328,["413"] = 329,["415"] = 331,["416"] = 332,["418"] = 337,["419"] = 338,["421"] = 341,["422"] = 342,["424"] = 348,["425"] = 349,["428"] = 356,["429"] = 357,["431"] = 360,["432"] = 264,["433"] = 363,["434"] = 364,["435"] = 365,["436"] = 366,["437"] = 367,["438"] = 368,["439"] = 369,["441"] = 363,["442"] = 373,["443"] = 374,["444"] = 375,["445"] = 374,["446"] = 378,["447"] = 379,["448"] = 380,["449"] = 381,["450"] = 382,["451"] = 383,["452"] = 384,["454"] = 386,["456"] = 378,["457"] = 390,["458"] = 391,["459"] = 391,["460"] = 391,["461"] = 391,["462"] = 391,["463"] = 391,["464"] = 391,["465"] = 391,["466"] = 391,["467"] = 395,["468"] = 395,["469"] = 395,["470"] = 395,["471"] = 395,["472"] = 395,["473"] = 395,["474"] = 395,["475"] = 395,["476"] = 399,["477"] = 399,["478"] = 399,["479"] = 399,["480"] = 399,["481"] = 399,["482"] = 399,["483"] = 399,["484"] = 399,["485"] = 404,["486"] = 390,["487"] = 407,["488"] = 408,["491"] = 423,["493"] = 424,["494"] = 424,["495"] = 425,["496"] = 424,["499"] = 407,["500"] = 429,["501"] = 430,["502"] = 431,["504"] = 433,["505"] = 429,["506"] = 436,["507"] = 437,["508"] = 438,["510"] = 440,["511"] = 436,["512"] = 443,["513"] = 444,["514"] = 443,["515"] = 447,["516"] = 448,["517"] = 449,["518"] = 450,["520"] = 452,["521"] = 447,["522"] = 455,["523"] = 163,["524"] = 459,["525"] = 461,["526"] = 462,["527"] = 463,["528"] = 464,["529"] = 465,["532"] = 461,["533"] = 470,["534"] = 471,["535"] = 472,["536"] = 473,["537"] = 474,["540"] = 470,["541"] = 479,["542"] = 480,["543"] = 481,["544"] = 482,["547"] = 479,["548"] = 487,["549"] = 488,["550"] = 488,["551"] = 488,["552"] = 488,["553"] = 488,["554"] = 487,["555"] = 490,["556"] = 491,["557"] = 491,["558"] = 491,["559"] = 491,["560"] = 491,["561"] = 490,["562"] = 493,["563"] = 494,["564"] = 494,["565"] = 494,["566"] = 494,["567"] = 494,["568"] = 493,["569"] = 497,["570"] = 498,["571"] = 497,["572"] = 459,["573"] = 502,["574"] = 504,["575"] = 505,["576"] = 508,["577"] = 509,["578"] = 508,["579"] = 511,["580"] = 512,["581"] = 511,["582"] = 514,["583"] = 515,["584"] = 516,["585"] = 517,["586"] = 518,["588"] = 520,["590"] = 514,["591"] = 523,["592"] = 525,["593"] = 526,["594"] = 527,["595"] = 528,["597"] = 530,["599"] = 523,["600"] = 535,["601"] = 536,["602"] = 535,["603"] = 539,["604"] = 540,["605"] = 539,["606"] = 543,["607"] = 544,["608"] = 543,["609"] = 547,["610"] = 548,["611"] = 548,["612"] = 547,["613"] = 552,["614"] = 552,["615"] = 552,["616"] = 554,["617"] = 555,["618"] = 556,["619"] = 557,["620"] = 558,["621"] = 559,["622"] = 560,["623"] = 561,["624"] = 563,["625"] = 572,["626"] = 573,["627"] = 574,["628"] = 574,["629"] = 574,["630"] = 574,["631"] = 573,["632"] = 589,["633"] = 589,["634"] = 589,["635"] = 589,["636"] = 552,["637"] = 552,["638"] = 592,["639"] = 592,["640"] = 592,["641"] = 594,["642"] = 595,["643"] = 596,["644"] = 597,["645"] = 598,["646"] = 599,["647"] = 600,["648"] = 601,["649"] = 604,["650"] = 613,["651"] = 614,["652"] = 615,["653"] = 615,["654"] = 615,["655"] = 615,["656"] = 614,["657"] = 630,["658"] = 630,["659"] = 630,["660"] = 630,["661"] = 592,["662"] = 592,["663"] = 633,["664"] = 633,["665"] = 633,["666"] = 635,["667"] = 636,["668"] = 637,["669"] = 638,["670"] = 639,["671"] = 641,["672"] = 647,["673"] = 648,["674"] = 649,["675"] = 649,["676"] = 649,["677"] = 649,["678"] = 648,["679"] = 661,["680"] = 661,["681"] = 661,["682"] = 661,["683"] = 633,["684"] = 633,["685"] = 664,["686"] = 664,["687"] = 664,["688"] = 666,["689"] = 667,["690"] = 668,["691"] = 669,["692"] = 670,["693"] = 671,["694"] = 673,["695"] = 680,["696"] = 681,["697"] = 682,["698"] = 682,["699"] = 682,["700"] = 682,["701"] = 681,["702"] = 695,["703"] = 695,["704"] = 695,["705"] = 695,["706"] = 664,["707"] = 664,["708"] = 698,["709"] = 698,["710"] = 698,["711"] = 699,["712"] = 701,["713"] = 702,["714"] = 703,["715"] = 702,["716"] = 706,["717"] = 706,["718"] = 706,["719"] = 706,["720"] = 698,["721"] = 698,["722"] = 711,["723"] = 711,["724"] = 711,["725"] = 712,["726"] = 713,["727"] = 713,["728"] = 713,["729"] = 713,["730"] = 711,["731"] = 711,["732"] = 717,["733"] = 717,["734"] = 717,["735"] = 718,["736"] = 719,["737"] = 719,["738"] = 719,["739"] = 719,["740"] = 717,["741"] = 717,["742"] = 723,["743"] = 723,["744"] = 723,["745"] = 724,["746"] = 725,["747"] = 725,["748"] = 725,["749"] = 725,["750"] = 726,["751"] = 723,["752"] = 723,["753"] = 730,["754"] = 730,["755"] = 730,["756"] = 731,["757"] = 732,["758"] = 732,["759"] = 732,["760"] = 732,["761"] = 733,["762"] = 730,["763"] = 730,["764"] = 738,["765"] = 738,["766"] = 738,["767"] = 739,["768"] = 738,["769"] = 738,["770"] = 742,["771"] = 742,["772"] = 742,["773"] = 743,["774"] = 742,["775"] = 742,["776"] = 747,["777"] = 747,["778"] = 747,["779"] = 748,["780"] = 747,["781"] = 747,["782"] = 752,["783"] = 752,["784"] = 752,["785"] = 753,["786"] = 753,["787"] = 753,["788"] = 753,["789"] = 757,["790"] = 752,["791"] = 752,["792"] = 761,["793"] = 761,["794"] = 761,["795"] = 762,["796"] = 761,["797"] = 761,["798"] = 765,["799"] = 765,["800"] = 765,["801"] = 766,["802"] = 765,["803"] = 765,["804"] = 770,["805"] = 770,["806"] = 770,["807"] = 771,["808"] = 772,["809"] = 772,["810"] = 772,["811"] = 772,["812"] = 770,["813"] = 770,["814"] = 776,["815"] = 776,["816"] = 776,["817"] = 777,["818"] = 776,["819"] = 776,["820"] = 781,["821"] = 781,["822"] = 781,["823"] = 782,["824"] = 781,["825"] = 781,["826"] = 786,["827"] = 786,["828"] = 786,["829"] = 787,["830"] = 786,["831"] = 786,["832"] = 791,["833"] = 791,["834"] = 791,["835"] = 792,["836"] = 791,["837"] = 791,["838"] = 795,["839"] = 795,["840"] = 795,["841"] = 796,["842"] = 795,["843"] = 795,["844"] = 799,["845"] = 799,["846"] = 799,["847"] = 800,["848"] = 799,["849"] = 799,["850"] = 803,["851"] = 803,["852"] = 803,["853"] = 804,["854"] = 803,["855"] = 803,["856"] = 807,["857"] = 807,["858"] = 807,["859"] = 808,["860"] = 807,["861"] = 807,["862"] = 811,["863"] = 811,["864"] = 811,["865"] = 812,["866"] = 811,["867"] = 811,["868"] = 816,["869"] = 816,["870"] = 816,["871"] = 817,["872"] = 816,["873"] = 816,["874"] = 820,["875"] = 820,["876"] = 820,["877"] = 821,["878"] = 820,["879"] = 820,["880"] = 825,["881"] = 825,["882"] = 825,["883"] = 826,["884"] = 825,["885"] = 825,["886"] = 830,["887"] = 830,["888"] = 830,["889"] = 831,["890"] = 830,["891"] = 830,["892"] = 835,["893"] = 835,["894"] = 835,["895"] = 836,["896"] = 835,["897"] = 835,["898"] = 840,["899"] = 840,["900"] = 840,["901"] = 841,["902"] = 840,["903"] = 840,["904"] = 845,["905"] = 845,["906"] = 845,["907"] = 846,["908"] = 845,["909"] = 845,["910"] = 850,["911"] = 850,["912"] = 850,["913"] = 851,["914"] = 850,["915"] = 850,["916"] = 855,["917"] = 855,["918"] = 855,["919"] = 856,["920"] = 855,["921"] = 855,["922"] = 860,["923"] = 860,["924"] = 860,["925"] = 861,["926"] = 860,["927"] = 860,["928"] = 865,["929"] = 865,["930"] = 865,["931"] = 866,["932"] = 865,["933"] = 865,["934"] = 870,["935"] = 870,["936"] = 870,["937"] = 871,["938"] = 870,["939"] = 870,["940"] = 875,["941"] = 875,["942"] = 875,["943"] = 876,["944"] = 875,["945"] = 875,["946"] = 880,["947"] = 880,["948"] = 880,["949"] = 881,["950"] = 880,["951"] = 880,["952"] = 885,["953"] = 885,["954"] = 885,["955"] = 886,["956"] = 885,["957"] = 885,["958"] = 890,["959"] = 890,["960"] = 890,["961"] = 891,["962"] = 890,["963"] = 890,["964"] = 502,["965"] = 895,["966"] = 897,["967"] = 898,["968"] = 897,["969"] = 902,["970"] = 905,["971"] = 897,["972"] = 907,["973"] = 909,["974"] = 897,["975"] = 912,["976"] = 914,["977"] = 915,["978"] = 897,["979"] = 917,["980"] = 919,["981"] = 897,["982"] = 897,["983"] = 923,["984"] = 924,["985"] = 923,["986"] = 930,["987"] = 931,["990"] = 934,["991"] = 935,["992"] = 936,["993"] = 936,["994"] = 936,["995"] = 936,["996"] = 936,["997"] = 936,["998"] = 936,["1000"] = 923,["1001"] = 939,["1002"] = 923,["1003"] = 944,["1004"] = 946,["1005"] = 947,["1006"] = 949,["1007"] = 950,["1008"] = 951,["1009"] = 952,["1010"] = 954,["1011"] = 955,["1012"] = 956,["1013"] = 957,["1014"] = 959,["1015"] = 960,["1016"] = 961,["1017"] = 962,["1018"] = 963,["1019"] = 964,["1020"] = 965,["1021"] = 966,["1022"] = 967,["1023"] = 969,["1024"] = 970,["1025"] = 971,["1026"] = 972,["1027"] = 973,["1028"] = 974,["1029"] = 975,["1030"] = 976,["1031"] = 977,["1032"] = 979,["1033"] = 980,["1034"] = 981,["1035"] = 982,["1037"] = 985,["1038"] = 986,["1039"] = 923,["1040"] = 988,["1041"] = 989,["1042"] = 990,["1045"] = 993,["1046"] = 995,["1047"] = 997,["1048"] = 998,["1049"] = 999,["1050"] = 1000,["1051"] = 1001,["1052"] = 1003,["1053"] = 1004,["1055"] = 1006,["1057"] = 1008,["1058"] = 1009,["1059"] = 1010,["1062"] = 1013,["1063"] = 1014,["1066"] = 1017,["1067"] = 1018,["1068"] = 1019,["1070"] = 1021,["1071"] = 1021,["1072"] = 1021,["1073"] = 1021,["1074"] = 1021,["1075"] = 1021,["1076"] = 1021,["1077"] = 1022,["1078"] = 1023,["1081"] = 923,["1082"] = 1027,["1083"] = 1028,["1084"] = 1029,["1085"] = 1030,["1086"] = 1031,["1087"] = 1032,["1088"] = 1033,["1089"] = 1034,["1090"] = 1036,["1091"] = 1037,["1092"] = 1038,["1093"] = 1039,["1094"] = 1041,["1095"] = 1042,["1096"] = 1043,["1097"] = 1044,["1098"] = 1045,["1099"] = 1046,["1100"] = 1047,["1101"] = 1048,["1102"] = 1049,["1103"] = 1051,["1104"] = 1052,["1105"] = 1053,["1106"] = 1054,["1107"] = 1055,["1108"] = 1056,["1109"] = 1057,["1110"] = 1058,["1111"] = 1059,["1112"] = 1061,["1113"] = 1062,["1114"] = 1063,["1115"] = 1064,["1117"] = 1067,["1118"] = 1068,["1120"] = 1071,["1121"] = 1072,["1123"] = 1075,["1124"] = 1076,["1125"] = 1077,["1126"] = 1079,["1127"] = 1080,["1128"] = 1081,["1129"] = 1082,["1130"] = 1083,["1131"] = 1084,["1132"] = 1085,["1133"] = 1086,["1134"] = 1087,["1135"] = 1088,["1136"] = 1089,["1137"] = 1090,["1138"] = 1091,["1139"] = 1092,["1140"] = 1093,["1141"] = 1094,["1144"] = 1099,["1145"] = 1100,["1146"] = 1102,["1147"] = 1103,["1149"] = 1106,["1150"] = 1107,["1151"] = 1108,["1152"] = 1109,["1153"] = 1110,["1154"] = 1111,["1156"] = 1113,["1157"] = 1114,["1160"] = 1118,["1161"] = 1119,["1163"] = 1123,["1164"] = 1125,["1165"] = 1126,["1167"] = 1129,["1168"] = 1130,["1170"] = 1132,["1171"] = 1133,["1173"] = 1135,["1174"] = 1137,["1175"] = 1138,["1177"] = 923,["1178"] = 1145,["1179"] = 1146,["1180"] = 1147,["1181"] = 1148,["1183"] = 1150,["1184"] = 1152,["1186"] = 1156,["1188"] = 923,["1189"] = 1159,["1190"] = 1160,["1191"] = 1161,["1192"] = 1162,["1194"] = 1164,["1195"] = 1166,["1197"] = 1168,["1199"] = 923,["1200"] = 1171,["1201"] = 1172,["1202"] = 1173,["1203"] = 923,["1204"] = 1175,["1205"] = 1177,["1206"] = 1178,["1208"] = 923,["1209"] = 1181,["1210"] = 1183,["1211"] = 923,["1212"] = 1192,["1213"] = 923,["1214"] = 1201,["1215"] = 923,["1216"] = 1208,["1217"] = 1209,["1218"] = 1210,["1219"] = 1213,["1220"] = 1214,["1221"] = 1215,["1222"] = 1217,["1223"] = 1218,["1224"] = 1218,["1225"] = 1218,["1226"] = 1219,["1227"] = 1220,["1228"] = 1221,["1229"] = 1222,["1230"] = 1222,["1231"] = 1222,["1232"] = 1223,["1233"] = 1223,["1234"] = 1223,["1235"] = 1223,["1236"] = 1223,["1237"] = 1223,["1238"] = 1223,["1239"] = 1223,["1240"] = 1223,["1241"] = 1223,["1242"] = 1223,["1243"] = 1223,["1244"] = 1223,["1245"] = 1222,["1246"] = 1222,["1248"] = 1218,["1249"] = 1218,["1250"] = 1236,["1251"] = 1237,["1252"] = 1238,["1253"] = 1239,["1254"] = 1240,["1255"] = 1241,["1256"] = 1242,["1257"] = 1243,["1258"] = 1244,["1259"] = 1245,["1262"] = 1249,["1263"] = 1250,["1264"] = 1251,["1266"] = 1254,["1267"] = 1255,["1268"] = 1256,["1269"] = 1256,["1270"] = 1256,["1271"] = 1256,["1272"] = 1256,["1273"] = 1256,["1274"] = 1256,["1275"] = 1257,["1276"] = 1258,["1279"] = 923,["1280"] = 1263,["1281"] = 1264,["1282"] = 1265,["1283"] = 1266,["1284"] = 1267,["1286"] = 923,["1287"] = 1271,["1288"] = 1272,["1289"] = 1275,["1290"] = 1276,["1291"] = 1277,["1292"] = 1278,["1293"] = 1280,["1294"] = 1281,["1295"] = 1282,["1296"] = 1283,["1297"] = 1284,["1298"] = 1285,["1299"] = 1286,["1300"] = 1287,["1301"] = 1288,["1302"] = 1289,["1303"] = 1290,["1304"] = 1291,["1305"] = 1292,["1306"] = 1293,["1308"] = 1296,["1309"] = 1297,["1310"] = 1298,["1311"] = 1299,["1312"] = 1300,["1313"] = 1301,["1315"] = 923,["1316"] = 923,["1317"] = 1306,["1318"] = 1307,["1319"] = 1308,["1320"] = 1309,["1322"] = 1311,["1323"] = 1306,["1324"] = 895,["1325"] = 1315,["1326"] = 1316,["1327"] = 1316,["1328"] = 1316,["1329"] = 1317,["1330"] = 1316,["1331"] = 1316,["1332"] = 1316,["1333"] = 1316,["1334"] = 1319,["1335"] = 1319,["1336"] = 1319,["1337"] = 1320,["1338"] = 1319,["1339"] = 1319,["1340"] = 1319,["1341"] = 1319,["1342"] = 1323,["1343"] = 1324,["1344"] = 1325,["1345"] = 1326,["1346"] = 1323,["1347"] = 1315,["1348"] = 1331,["1349"] = 1332,["1351"] = 1333,["1352"] = 1334,["1354"] = 1335,["1356"] = 1336,["1358"] = 1337,["1360"] = 1338,["1362"] = 1339,["1364"] = 1340,["1366"] = 1341,["1368"] = 1342,["1370"] = 1343,["1372"] = 1344,["1374"] = 1345,["1376"] = 1346,["1378"] = 1347,["1381"] = 1349,["1384"] = 1332,["1385"] = 1331,["1386"] = 1355});
local ____exports = {}
local ____Controller = include("framework.data.Controller")
local make = ____Controller.make
local ____Fight = include("framework.fight.Fight")
local fight = ____Fight.fight
local ____EffectConfig = include("logic.configs.EffectConfig")
local effectConfigMap = ____EffectConfig.effectConfigMap
local ____Property = include("logic.models.Property")
local _____653B_51FB = ____Property["攻击"]
local _____66B4_51FB_7387 = ____Property["暴击率"]
local ____A_7C7B_4F24_5BB3_589E_52A0 = ____Property["A类伤害增加"]
local ____B_7C7B_4F24_5BB3_589E_52A0 = ____Property["B类伤害增加"]
local ____C_7C7B_4F24_5BB3_589E_52A0 = ____Property["C类伤害增加"]
local ____A_7C7B_6700_7EC8_4FEE_6B63 = ____Property["A类最终修正"]
local ____B_7C7B_6700_7EC8_4FEE_6B63 = ____Property["B类最终修正"]
local ____C_7C7B_6700_7EC8_4FEE_6B63 = ____Property["C类最终修正"]
local ____C_7C7B_4F24_5BB3_62B5_6297 = ____Property["C类伤害抵抗"]
local ____A_7C7B_4F24_5BB3_62B5_6297 = ____Property["A类伤害抵抗"]
local ____B_7C7B_4F24_5BB3_62B5_6297 = ____Property["B类伤害抵抗"]
local _____989D_5916_66B4_51FB_4F24_5BB3 = ____Property["额外暴击伤害"]
local _____521D_59CB_66B4_51FB_4F24_5BB3 = ____Property["初始暴击伤害"]
local _____7269_7406_653B_51FB_767E_5206_6BD4 = ____Property["物理攻击百分比"]
local _____5927_62DB_4F24_5BB3_589E_52A0 = ____Property["大招伤害增加"]
local _____653B_51FB_901F_5EA6 = ____Property["攻击速度"]
local _____653B_51FB_901F_5EA6_767E_5206_6BD4 = ____Property["攻击速度百分比"]
local _____95EA_907F_7387 = ____Property["闪避率"]
local _____8840 = ____Property["血"]
local _____603B_56DE_84DD_901F_7387 = ____Property["总回蓝速率"]
local _____79FB_52A8_901F_5EA6 = ____Property["移动速度"]
local _____84DD = ____Property["蓝"]
local _____84DD_91CF_4E0A_9650 = ____Property["蓝量上限"]
local _____57FA_7840_8840_91CF_4E0A_9650 = ____Property["基础血量上限"]
local _____8840_91CF_767E_5206_6BD4 = ____Property["血量百分比"]
local ValuesList = ____Property.ValuesList
local PropertiesList = ____Property.PropertiesList
local _____6BCF_79D2_56DE_84DD = ____Property["每秒回蓝"]
local _____7279_6280_1 = ____Property["特技_1"]
local _____7269_7406_4F24_5BB3_62B5_6297 = ____Property["物理伤害抵抗"]
local _____6CD5_672F_4F24_5BB3_62B5_6297 = ____Property["法术伤害抵抗"]
local _____6062_590D_7CFB_6570 = ____Property["恢复系数"]
local _____547D_4E2D = ____Property["命中"]
local _____5929_8D4B_1 = ____Property["天赋_1"]
local _____5929_8D4B_2 = ____Property["天赋_2"]
local _____5929_8D4B_3 = ____Property["天赋_3"]
local _____6CD5_672F_95EA_907F_7387 = ____Property["法术闪避率"]
local _____6CD5_672F_66B4_51FB_7387 = ____Property["法术暴击率"]
local _____4F53_578B = ____Property["体型"]
local _____6218_573AID = ____Property["战场ID"]
local _____6BD2_7CFB_6570 = ____Property["毒系数"]
local _____989D_5916_8840_91CF = ____Property["额外血量"]
local _____989D_5916_7269_7406_653B_51FB = ____Property["额外物理攻击"]
local _____7269_7406_9632_5FA1 = ____Property["物理防御"]
local _____6CD5_672F_9632_5FA1 = ____Property["法术防御"]
local _____6CD5_672F_653B_51FB = ____Property["法术攻击"]
local _____6CD5_672F_653B_51FB_767E_5206_6BD4 = ____Property["法术攻击百分比"]
local _____989D_5916_6CD5_672F_653B_51FB = ____Property["额外法术攻击"]
local _____7279_6280_2 = ____Property["特技_2"]
local _____901A_7528_62A4_76FE = ____Property["通用护盾"]
local _____7269_7406_62A4_76FE = ____Property["物理护盾"]
local _____6CD5_672F_62A4_76FE = ____Property["法术护盾"]
local _____5355_4F4D_7C7B_578BID = ____Property["单位类型ID"]
local _____5929_8D4B_4 = ____Property["天赋_4"]
local _____53EC_5524_7269_7C7B_578B = ____Property["召唤物类型"]
local _____6BCF5_79D2_751F_547D_6062_590D = ____Property["每5秒生命恢复"]
local _____6BCF5_79D2_83B7_5F97_62A4_76FE = ____Property["每5秒获得护盾"]
local _____7279_6280_3 = ____Property["特技_3"]
local _____7269_7406_9632_5FA1_767E_5206_6BD4 = ____Property["物理防御百分比"]
local _____6CD5_672F_9632_5FA1_767E_5206_6BD4 = ____Property["法术防御百分比"]
local _____795D_798F_6570_503C = ____Property["祝福数值"]
local _____7269_7406_5438_8840_767E_5206_6BD4 = ____Property["物理吸血百分比"]
local _____6CD5_672F_5438_8840_767E_5206_6BD4 = ____Property["法术吸血百分比"]
local _____666E_653B_5438_8840_767E_5206_6BD4 = ____Property["普攻吸血百分比"]
local _____5927_62DB_5438_8840_767E_5206_6BD4 = ____Property["大招吸血百分比"]
local _____5168_80FD_5438_8840_767E_5206_6BD4 = ____Property["全能吸血百分比"]
local _____7269_7406_7A7F_900F = ____Property["物理穿透"]
local _____6CD5_672F_7A7F_900F = ____Property["法术穿透"]
local _____5168_80FD_7A7F_900F = ____Property["全能穿透"]
local _____7269_7406_7A7F_900F_767E_5206_6BD4 = ____Property["物理穿透百分比"]
local _____6CD5_672F_7A7F_900F_767E_5206_6BD4 = ____Property["法术穿透百分比"]
local _____5168_80FD_7A7F_900F_767E_5206_6BD4 = ____Property["全能穿透百分比"]
local _____79FB_52A8_901F_5EA6_767E_5206_6BD4 = ____Property["移动速度百分比"]
include("framework.fight.eca.init")
local ____DefaultConfig = include("logic.configs.DefaultConfig")
local defaultConfig = ____DefaultConfig.defaultConfig
local ____Report = include("framework.fight.Report")
local Report = ____Report.Report
local ____Status = include("logic.models.Status")
local StateList = ____Status.StateList
local _____4E0D_4F1A_6B7B_4EA1 = ____Status["不会死亡"]
local _____4E0D_53EF_9009_4E2D = ____Status["不可选中"]
local _____514D_75AB_63A7_5236 = ____Status["免疫控制"]
local _____51BB_7ED3 = ____Status["冻结"]
local _____51C6_5907_72B6_6001 = ____Status["准备状态"]
local _____53EA_8DD1_8DEF = ____Status["只跑路"]
local _____53EF_8F6C_5411_5EFA_7B51 = ____Status["可转向建筑"]
local _____5EFA_7B51 = ____Status["建筑"]
local _____65B0_624B_4FDD_62A4 = ____Status["新手保护"]
local _____65E0_654C = ____Status["无敌"]
local _____65E0_6CD5_63A7_5236 = ____Status["无法控制"]
local _____6728_5934_4EBA = ____Status["木头人"]
local _____6C89_9ED8 = ____Status["沉默"]
local _____7729_6655 = ____Status["眩晕"]
local _____7F34_68B0 = ____Status["缴械"]
local _____8DEF_4EBA = ____Status["路人"]
local _____9B45_60D1 = ____Status["魅惑"]
local ____Y3State = include("framework.fight.Y3State")
local Y3UnitState = ____Y3State.Y3UnitState
local ____UnitTags = include("logic.models.UnitTags")
local UnitTag = ____UnitTags.UnitTag
local getEnemyTagsMap = ____UnitTags.getEnemyTagsMap
local getFriendlyTagsMap = ____UnitTags.getFriendlyTagsMap
local ____DataManager = include("framework.data.DataManager")
local datas = ____DataManager.datas
local writeableDatas = ____DataManager.writeableDatas
local ____GameData = include("logic.models.GameData")
local GameData = ____GameData.GameData
local GameRandomEventType = ____GameData.GameRandomEventType
local GameStatus = ____GameData.GameStatus
local ____utils = include("framework.fight.utils")
local getUnit = ____utils.getUnit
local isEffect = ____utils.isEffect
local isSimpleSkill = ____utils.isSimpleSkill
local isSkill = ____utils.isSkill
local isUnit = ____utils.isUnit
local ____UnitData = include("logic.models.UnitData")
local UnitType = ____UnitData.UnitType
local ____SkillConfig = include("logic.configs.SkillConfig")
local skillConfigMap_abilityName = ____SkillConfig.skillConfigMap_abilityName
local ____FightUtils = include("logic.utils.FightUtils")
local fightUtils = ____FightUtils.fightUtils
local getAncestor = ____FightUtils.getAncestor
local ____UnitMoveSpeedConfig = include("logic.configs.UnitMoveSpeedConfig")
local unitMoveSpeedConfigMap = ____UnitMoveSpeedConfig.unitMoveSpeedConfigMap
local ____PlayerStatisticsData = include("logic.models.PlayerStatisticsData")
local PlayerStatisticsData = ____PlayerStatisticsData.PlayerStatisticsData
local ____PlayerData = include("logic.models.PlayerData")
local PlayerData = ____PlayerData.PlayerData
local ____GameUtils = include("logic.utils.GameUtils")
local GameUtils = ____GameUtils.GameUtils
local ____TriggerManager = include("logic.triggers.TriggerManager")
local triggerManager = ____TriggerManager.triggerManager
local ____ITrigger = include("logic.triggers.ITrigger")
local TriggerType = ____ITrigger.TriggerType
____exports.Formula = Formula or ({})
____exports.Formula["物理伤害"] = 1
____exports.Formula[____exports.Formula["物理伤害"]] = "物理伤害"
____exports.Formula["法术伤害"] = 2
____exports.Formula[____exports.Formula["法术伤害"]] = "法术伤害"
____exports.Formula["固定伤害"] = 3
____exports.Formula[____exports.Formula["固定伤害"]] = "固定伤害"
____exports.Formula["真实伤害"] = 4
____exports.Formula[____exports.Formula["真实伤害"]] = "真实伤害"
____exports.Formula["绝对伤害"] = 5
____exports.Formula[____exports.Formula["绝对伤害"]] = "绝对伤害"
____exports.Formula["回血值"] = 101
____exports.Formula[____exports.Formula["回血值"]] = "回血值"
____exports.Formula["回血值_无恢复效果影响"] = -101
____exports.Formula[____exports.Formula["回血值_无恢复效果影响"]] = "回血值_无恢复效果影响"
____exports.Formula["闪避公式"] = 102
____exports.Formula[____exports.Formula["闪避公式"]] = "闪避公式"
____exports.Formula["法术闪避公式"] = 103
____exports.Formula[____exports.Formula["法术闪避公式"]] = "法术闪避公式"
____exports.Formula["展示面板_物理攻击"] = 1001
____exports.Formula[____exports.Formula["展示面板_物理攻击"]] = "展示面板_物理攻击"
____exports.Formula["展示面板_暴击"] = 1002
____exports.Formula[____exports.Formula["展示面板_暴击"]] = "展示面板_暴击"
____exports.Formula["展示面板_攻速"] = 1003
____exports.Formula[____exports.Formula["展示面板_攻速"]] = "展示面板_攻速"
____exports.Formula["展示面板_闪避"] = 1004
____exports.Formula[____exports.Formula["展示面板_闪避"]] = "展示面板_闪避"
____exports.Formula["展示面板_血量上限"] = 1005
____exports.Formula[____exports.Formula["展示面板_血量上限"]] = "展示面板_血量上限"
____exports.Formula["展示面板_回蓝速度"] = 1006
____exports.Formula[____exports.Formula["展示面板_回蓝速度"]] = "展示面板_回蓝速度"
____exports.Formula["展示面板_暴击伤害"] = 1007
____exports.Formula[____exports.Formula["展示面板_暴击伤害"]] = "展示面板_暴击伤害"
____exports.Formula["展示面板_毒系数"] = 1008
____exports.Formula[____exports.Formula["展示面板_毒系数"]] = "展示面板_毒系数"
____exports.Formula["展示面板_恢复系数"] = 1013
____exports.Formula[____exports.Formula["展示面板_恢复系数"]] = "展示面板_恢复系数"
____exports.Formula["展示面板_大招伤害增加"] = 1014
____exports.Formula[____exports.Formula["展示面板_大招伤害增加"]] = "展示面板_大招伤害增加"
____exports.Formula["展示面板_总物理防御系数"] = 1015
____exports.Formula[____exports.Formula["展示面板_总物理防御系数"]] = "展示面板_总物理防御系数"
____exports.Formula["展示面板_总法术防御系数"] = 1016
____exports.Formula[____exports.Formula["展示面板_总法术防御系数"]] = "展示面板_总法术防御系数"
____exports.Formula["展示面板_精准"] = 1017
____exports.Formula[____exports.Formula["展示面板_精准"]] = "展示面板_精准"
____exports.Formula["展示面板_物理防御系数"] = 1018
____exports.Formula[____exports.Formula["展示面板_物理防御系数"]] = "展示面板_物理防御系数"
____exports.Formula["展示面板_法术防御系数"] = 1019
____exports.Formula[____exports.Formula["展示面板_法术防御系数"]] = "展示面板_法术防御系数"
____exports.Formula["展示面板_法术攻击"] = 1020
____exports.Formula[____exports.Formula["展示面板_法术攻击"]] = "展示面板_法术攻击"
____exports.Formula["展示面板_物理防御"] = 1021
____exports.Formula[____exports.Formula["展示面板_物理防御"]] = "展示面板_物理防御"
____exports.Formula["展示面板_法术防御"] = 1022
____exports.Formula[____exports.Formula["展示面板_法术防御"]] = "展示面板_法术防御"
____exports.Formula["展示面板_每5秒恢复生命"] = 1023
____exports.Formula[____exports.Formula["展示面板_每5秒恢复生命"]] = "展示面板_每5秒恢复生命"
____exports.Formula["展示面板_每5秒获得护盾"] = 1024
____exports.Formula[____exports.Formula["展示面板_每5秒获得护盾"]] = "展示面板_每5秒获得护盾"
____exports.Formula["展示面板_物理吸血百分比"] = 1025
____exports.Formula[____exports.Formula["展示面板_物理吸血百分比"]] = "展示面板_物理吸血百分比"
____exports.Formula["展示面板_法术吸血百分比"] = 1026
____exports.Formula[____exports.Formula["展示面板_法术吸血百分比"]] = "展示面板_法术吸血百分比"
____exports.Formula["展示面板_普攻吸血百分比"] = 1027
____exports.Formula[____exports.Formula["展示面板_普攻吸血百分比"]] = "展示面板_普攻吸血百分比"
____exports.Formula["展示面板_大招吸血百分比"] = 1028
____exports.Formula[____exports.Formula["展示面板_大招吸血百分比"]] = "展示面板_大招吸血百分比"
____exports.Formula["展示面板_全能吸血百分比"] = 1029
____exports.Formula[____exports.Formula["展示面板_全能吸血百分比"]] = "展示面板_全能吸血百分比"
____exports.Formula["展示面板_移动速度"] = 1030
____exports.Formula[____exports.Formula["展示面板_移动速度"]] = "展示面板_移动速度"
____exports.Formula["展示面板_物理穿透"] = 1031
____exports.Formula[____exports.Formula["展示面板_物理穿透"]] = "展示面板_物理穿透"
____exports.Formula["展示面板_物理穿透百分比"] = 1032
____exports.Formula[____exports.Formula["展示面板_物理穿透百分比"]] = "展示面板_物理穿透百分比"
____exports.Formula["展示面板_法术穿透"] = 1033
____exports.Formula[____exports.Formula["展示面板_法术穿透"]] = "展示面板_法术穿透"
____exports.Formula["展示面板_法术穿透百分比"] = 1034
____exports.Formula[____exports.Formula["展示面板_法术穿透百分比"]] = "展示面板_法术穿透百分比"
____exports.Formula["展示面板_全能穿透"] = 1035
____exports.Formula[____exports.Formula["展示面板_全能穿透"]] = "展示面板_全能穿透"
____exports.Formula["展示面板_全能穿透百分比"] = 1036
____exports.Formula[____exports.Formula["展示面板_全能穿透百分比"]] = "展示面板_全能穿透百分比"
____exports["飘字"] = 飘字 or ({})
____exports["飘字"]["物理"] = "physics"
____exports["飘字"]["法术"] = "magic"
____exports["飘字"]["真实"] = "real"
____exports["飘字"]["治疗"] = "heal"
____exports["飘字"]["毒"] = "1319947408"
____exports["飘字"]["护盾"] = "1082621725"
____exports["飘字"]["物理暴击"] = "physics"
____exports["飘字"]["法术暴击"] = "magic"
____exports["跳字动画"] = 跳字动画 or ({})
____exports["跳字动画"]["物理伤害"] = 134267610
____exports["跳字动画"][____exports["跳字动画"]["物理伤害"]] = "物理伤害"
____exports["跳字动画"]["法术伤害"] = 134267403
____exports["跳字动画"][____exports["跳字动画"]["法术伤害"]] = "法术伤害"
____exports["跳字动画"]["固定伤害"] = 134271410
____exports["跳字动画"][____exports["跳字动画"]["固定伤害"]] = "固定伤害"
____exports["跳字动画"]["真实伤害"] = 134224979
____exports["跳字动画"][____exports["跳字动画"]["真实伤害"]] = "真实伤害"
____exports["跳字动画"]["护盾"] = 134226610
____exports["跳字动画"][____exports["跳字动画"]["护盾"]] = "护盾"
____exports["跳字动画"]["属性跳字"] = 134227370
____exports["跳字动画"][____exports["跳字动画"]["属性跳字"]] = "属性跳字"
____exports["跳字动画"]["治疗"] = 134261233
____exports["跳字动画"][____exports["跳字动画"]["治疗"]] = "治疗"
____exports["跳字动画"]["金币"] = 134232198
____exports["跳字动画"][____exports["跳字动画"]["金币"]] = "金币"
____exports.AbilityType = AbilityType or ({})
____exports.AbilityType["普攻"] = 0
____exports.AbilityType[____exports.AbilityType["普攻"]] = "普攻"
____exports.AbilityType["大招"] = 1
____exports.AbilityType[____exports.AbilityType["大招"]] = "大招"
____exports.AbilityType["被动"] = 2
____exports.AbilityType[____exports.AbilityType["被动"]] = "被动"
____exports.AbilityTagData = AbilityTagData or ({})
____exports.AbilityTagData["是否为AOE"] = "isAoeDamage"
____exports.FightController = __TS__Class()
local FightController = ____exports.FightController
FightController.name = "FightController"
function FightController.prototype.____constructor(self)
end
function FightController.prototype.init(self)
    self:initFightLogic()
    self:initFormula()
    self:initStatistics()
    self:initReport()
    self:initDynamicTags()
    self:initTextType()
    self:initCache()
end
function FightController.prototype.initCache(self)
    y3.ltimer.loop_frame(
        1,
        function()
            local gameData = datas.global:getSingle(GameData)
            if gameData ~= nil and gameData.gameStatus == GameStatus["准备回合"] then
                fight:createCacheTick()
            end
        end
    )
end
function FightController.prototype.initFightLogic(self)
    fight.watchStateEffects = __TS__ArrayMap(
        __TS__ArrayFilter(
            StateList,
            function(____, a) return a.particle ~= nil end
        ),
        function(____, a)
            return {stateId = a.key, particle = a.particle, stopAnim = a.stopAnim}
        end
    )
    fight:registerLoadSimpleSkill(function(____, skillName)
        local data = include("logic.simpleAbilities." .. __TS__StringReplaceAll(skillName, "/", "."))
        return data.SimpleSkill
    end)
    fight:registerLoadSkill(function(____, skillName)
        local data = include("logic.abilities." .. __TS__StringReplaceAll(skillName, "/", "."))
        return data.key
    end)
    fight.createDefaultProperties = function()
        local defaultProperties = {}
        for ____, p in ipairs(PropertiesList) do
            defaultProperties[p.key] = p.defaultValue
        end
        return defaultProperties
    end
    local propertyRuleMap = {}
    for ____, property in ipairs(PropertiesList) do
        propertyRuleMap[property.key] = {min = property.min, max = property.max}
    end
    fight.propertyRuleMap = propertyRuleMap
    fight.createDefaultValues = function()
        local defaultValue = {}
        defaultValue[_____8840] = 0
        defaultValue[_____84DD] = 0
        defaultValue[_____7279_6280_1] = 0
        defaultValue[_____7279_6280_2] = 0
        defaultValue[_____7279_6280_3] = 0
        defaultValue[_____5929_8D4B_1] = 0
        defaultValue[_____5929_8D4B_2] = 0
        defaultValue[_____5929_8D4B_3] = 0
        defaultValue[_____5929_8D4B_4] = 0
        defaultValue[_____53EC_5524_7269_7C7B_578B] = 0
        defaultValue[_____795D_798F_6570_503C] = 0
        defaultValue[_____6218_573AID] = 0
        defaultValue[_____5355_4F4D_7C7B_578BID] = 0
        return defaultValue
    end
    fight:registerEffectConfig(function(____, id)
        local config = effectConfigMap[id]
        if config == nil then
            console:error("无法找到效果配置 id=" .. tostring(id))
            return nil
        end
        return config
    end)
    fight.getScale = function(____, unit)
        return math.max(
            1,
            math.min(
                2,
                unit:p(_____4F53_578B)
            )
        )
    end
    fight.globalUnitFilter = function(____, source, target)
        return not target:checkState(_____4E0D_53EF_9009_4E2D)
    end
    fight.projectileUnitFilter = function(____, source, target)
        return source:v(_____6218_573AID) == target:v(_____6218_573AID) and not target:checkState(_____4E0D_53EF_9009_4E2D)
    end
    fight.globalFindUnitTag = function(____, source)
        local battleGroundId = source.activeData.values[_____6218_573AID]
        if battleGroundId ~= 0 and battleGroundId ~= nil then
            return "战场" .. tostring(battleGroundId)
        end
        return nil
    end
    fight.globalWithoutUnitTag = function(____, source, tags)
        local a = __TS__ArrayIndexOf(tags, "派系A") ~= -1
        local b = __TS__ArrayIndexOf(tags, "派系B") ~= -1
        if a and b then
            return nil
        elseif a then
            return "派系B"
        elseif b then
            return "派系A"
        end
        return nil
    end
    fight.getY3State = function(____, unit)
        local v = 0
        if unit:checkState(_____4E0D_4F1A_6B7B_4EA1) then
            v = Y3UnitState["不会死亡"]
        end
        if unit:checkState(_____51C6_5907_72B6_6001) then
            v = Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["无法被技能指示器锁定"] | Y3UnitState["无法被攻击"] | Y3UnitState["无敌"] | Y3UnitState["无视动态碰撞"] | Y3UnitState["无视静态碰撞"] | Y3UnitState["不会死亡"]
        end
        if unit:checkState(_____8DEF_4EBA) then
            v = Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["无法被技能指示器锁定"] | Y3UnitState["无法被选中"] | Y3UnitState["无法被攻击"] | Y3UnitState["无敌"] | Y3UnitState["无视动态碰撞"] | Y3UnitState["无视静态碰撞"] | Y3UnitState["不会死亡"]
        elseif unit:checkState(_____65B0_624B_4FDD_62A4) then
            v = Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["无法被技能指示器锁定"] | Y3UnitState["无法被选中"] | Y3UnitState["无法被攻击"] | Y3UnitState["无敌"] | Y3UnitState["无视动态碰撞"] | Y3UnitState["无视静态碰撞"] | Y3UnitState["不会死亡"]
        elseif unit:checkState(_____53EA_8DD1_8DEF) then
            v = Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["无法被技能指示器锁定"] | Y3UnitState["无法被攻击"]
        elseif unit:checkState(_____6728_5934_4EBA) then
            v = Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["不会死亡"]
        elseif unit:checkState(_____53EF_8F6C_5411_5EFA_7B51) then
            v = Y3UnitState["禁止移动"] | Y3UnitState["无法施加运动"]
        elseif unit:checkState(_____5EFA_7B51) then
            v = Y3UnitState["禁止转向"] | Y3UnitState["禁止移动"] | Y3UnitState["无法施加运动"]
        else
            if unit:checkState(_____7F34_68B0) then
                v = v | Y3UnitState["禁止普攻"]
            end
            if unit:checkState(_____6C89_9ED8) then
                v = v | Y3UnitState["禁止施法"]
            end
            if unit:checkState(_____65E0_654C) then
                v = v | Y3UnitState["无敌"]
            end
            if not unit:checkState(_____514D_75AB_63A7_5236) and unit:checkState(_____7729_6655) then
                v = v | (Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["禁止转向"])
            end
            if unit:checkState(_____4E0D_53EF_9009_4E2D) then
                v = v | (Y3UnitState["无法被选中"] | Y3UnitState["无法被攻击"])
            end
            if not unit:checkState(_____514D_75AB_63A7_5236) and unit:checkState(_____51BB_7ED3) then
                v = v | (Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["禁止转向"] | Y3UnitState["动画定帧"])
            end
            if not unit:checkState(_____514D_75AB_63A7_5236) and unit:checkState(_____9B45_60D1) then
                v = v | (Y3UnitState["禁止普攻"] | Y3UnitState["禁止施法"] | Y3UnitState["禁止移动"] | Y3UnitState["禁止转向"])
            end
        end
        if unit:checkState(_____65E0_6CD5_63A7_5236) then
            v = v | Y3UnitState["无法控制"]
        end
        return v
    end
    fight.getShieldGroup = function(____, formulaId)
        if formulaId == ____exports.Formula["物理伤害"] then
            return {12, 11}
        elseif formulaId == ____exports.Formula["法术伤害"] then
            return {13, 11}
        elseif formulaId == ____exports.Formula["固定伤害"] then
            return {11}
        end
    end
    local shieldPropertyIdList = {53, 54, 55}
    fight.getShieldPropertyIdList = function()
        return shieldPropertyIdList
    end
    fight.getShieldPropertyId = function(____, groupId)
        if groupId == 11 then
            return _____901A_7528_62A4_76FE
        elseif groupId == 12 then
            return _____7269_7406_62A4_76FE
        elseif groupId == 13 then
            return _____6CD5_672F_62A4_76FE
        else
            return _____901A_7528_62A4_76FE
        end
    end
    fight.initShieldView = function(____, unit)
        local normalShield = unit.y3Unit:add_buff({
            key = 134267834,
            time = -1,
            source = unit.y3Unit,
            ability = nil,
            pulse = nil,
            stacks = 1,
            data = nil
        })
        local physicsShield = unit.y3Unit:add_buff({
            key = 134235829,
            time = -1,
            source = unit.y3Unit,
            ability = nil,
            pulse = nil,
            stacks = 1,
            data = nil
        })
        local magicShield = unit.y3Unit:add_buff({
            key = 134239846,
            time = -1,
            source = unit.y3Unit,
            ability = nil,
            pulse = nil,
            stacks = 1,
            data = nil
        })
        unit.shield = {normalShield, physicsShield, magicShield}
    end
    fight.refreshShieldView = function(____, unit, values)
        if unit.y3Unit == nil then
            return
        end
        local shields = unit.shield
        do
            local i = 0
            while i < #shields do
                shields[i + 1]:set_shield(math.max(0.01, values[i + 1]))
                i = i + 1
            end
        end
    end
    fight.isPhysics = function(____, formulaId)
        if formulaId == ____exports.Formula["物理伤害"] then
            return true
        end
        return false
    end
    fight.isMagic = function(____, formulaId)
        if formulaId == ____exports.Formula["法术伤害"] then
            return true
        end
        return false
    end
    fight.isBigSkill = function(____, ability)
        return ability:is_autocast_enabled()
    end
    fight.checkInFighting = function(____, unit)
        local group = unit.effectsGroup[101]
        if group ~= nil and (next(group)) ~= nil then
            return true
        end
        return false
    end
    fight.fightUnits = fightUtils
end
function FightController.prototype.initReport(self)
    Report.dumpValues = function(____, unit, builder)
        for ____, v in ipairs(ValuesList) do
            local value = unit:v(v.key) or 0
            if value ~= 0 then
                builder[#builder + 1] = (v.name .. "：") .. tostring(value)
            end
        end
    end
    Report.dumpProperties = function(____, unit, builder)
        for ____, v in ipairs(PropertiesList) do
            local value = unit:p(v.key)
            if value ~= 0 then
                builder[#builder + 1] = (v.name .. "：") .. tostring(value)
            end
        end
    end
    Report.dumpStatus = function(____, unit, builder)
        for ____, v in ipairs(StateList) do
            if unit:checkState(v.key) then
                builder[#builder + 1] = v.name
            end
        end
    end
    Report.getPropertyName = function(____, id)
        local ____opt_0 = __TS__ArrayFind(
            PropertiesList,
            function(____, a) return a.key == id end
        )
        return ____opt_0 and ____opt_0.name or "未知属性名"
    end
    Report.getValueName = function(____, id)
        local ____opt_2 = __TS__ArrayFind(
            ValuesList,
            function(____, a) return a.key == id end
        )
        return ____opt_2 and ____opt_2.name or "未知数值名"
    end
    Report.getStateName = function(____, id)
        local ____opt_4 = __TS__ArrayFind(
            StateList,
            function(____, a) return a.key == id end
        )
        return ____opt_4 and ____opt_4.name or "未知状态名"
    end
    Report.getFormulaName = function(____, id)
        return ____exports.Formula[id] or "未知公式名"
    end
end
function FightController.prototype.initFormula(self)
    fight.hpValueId = _____8840
    fight.mpValueId = _____84DD
    fight.getHpMax = function(____, unit)
        return unit:formula(____exports.Formula["展示面板_血量上限"])
    end
    fight.getMpMax = function(____, unit)
        return unit:p(_____84DD_91CF_4E0A_9650)
    end
    fight.getCriticalRatio = function(____, unit, formulaId)
        if formulaId == ____exports.Formula["物理伤害"] then
            return unit:formula(____exports.Formula["展示面板_暴击"])
        elseif formulaId == ____exports.Formula["法术伤害"] then
            return unit:p(_____6CD5_672F_66B4_51FB_7387)
        else
            return 0
        end
    end
    fight.getMissRatio = function(____, source, target, formulaId)
        if formulaId == ____exports.Formula["物理伤害"] then
            return source:formula(____exports.Formula["闪避公式"], target)
        elseif formulaId == ____exports.Formula["法术伤害"] then
            return source:formula(____exports.Formula["法术闪避公式"], target)
        else
            return 0
        end
    end
    fight.getMoveSpeed = function(____, unit)
        return unit:formula(____exports.Formula["展示面板_移动速度"])
    end
    fight.getAttackSpeed = function(____, unit)
        return unit:formula(____exports.Formula["展示面板_攻速"])
    end
    fight.getMpRecover = function(____, unit)
        return unit.activeData.isFighting and unit:formula(____exports.Formula["展示面板_回蓝速度"]) or 0
    end
    fight.getMoveAnimSpeed = function(____, roleId)
        local ____opt_6 = unitMoveSpeedConfigMap[roleId]
        return ____opt_6 and ____opt_6.speed or defaultConfig["单位移动动画速度"]
    end
    fight:registerFormula(
        ____exports.Formula["物理伤害"],
        function(____, s, t, isCritical, abilityType, v)
            local a = v == nil and s:formula(____exports.Formula["展示面板_物理攻击"]) or v
            local b = abilityType == ____exports.AbilityType["大招"] and 1 + s:p(_____5927_62DB_4F24_5BB3_589E_52A0) or 1
            local c = isCritical == true and s:p(_____521D_59CB_66B4_51FB_4F24_5BB3) + s:p(_____989D_5916_66B4_51FB_4F24_5BB3) or 1
            local d = (1 + s:p(____A_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____B_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____C_7C7B_4F24_5BB3_589E_52A0))
            local e = t == nil and 1 or (1 - t:p(____A_7C7B_4F24_5BB3_62B5_6297)) * (1 - t:p(____B_7C7B_4F24_5BB3_62B5_6297)) * (1 - t:p(____C_7C7B_4F24_5BB3_62B5_6297))
            local f = t == nil and 1 or 100 / (100 + (t:p(_____7269_7406_9632_5FA1) * (1 + t:p(_____7269_7406_9632_5FA1_767E_5206_6BD4)) - s:p(_____7269_7406_7A7F_900F) - s:p(_____5168_80FD_7A7F_900F))) * (1 - t:p(_____7269_7406_4F24_5BB3_62B5_6297) + s:p(_____7269_7406_7A7F_900F_767E_5206_6BD4) + s:p(_____5168_80FD_7A7F_900F_767E_5206_6BD4))
            local g = s:p(____A_7C7B_6700_7EC8_4FEE_6B63) + s:p(____B_7C7B_6700_7EC8_4FEE_6B63)
            local h = t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63) or 0
            local result = a * b * c * d * e * f + g - h
            local fight = s.fight
            fight.report:using(function(____, r)
                r:log(
                    "#gray 物理伤害计算 #red " .. tostring(result),
                    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((("\n    v = " .. tostring(v)) .. "\n    (v == nil ? s.formula(Formula.展示面板_物理攻击) : ") .. tostring(v)) .. ") = ") .. tostring(a)) .. ";\n    (abilityType == AbilityType.大招 ? 1 + 大招伤害增加(") .. tostring(s:p(_____5927_62DB_4F24_5BB3_589E_52A0))) .. ") : 1) = ") .. tostring(b)) .. ";\n    (isCritical == true ? ((初始暴击伤害(") .. tostring(s:p(_____521D_59CB_66B4_51FB_4F24_5BB3))) .. ") + 额外暴击伤害(") .. tostring(s:p(_____989D_5916_66B4_51FB_4F24_5BB3))) .. "))) : 1) = ") .. tostring(c)) .. ";\n    (1 + s.p(A类伤害增加)) * (1 + B类伤害增加(") .. tostring(s:p(____B_7C7B_4F24_5BB3_589E_52A0))) .. ")) * (1 + C类伤害增加(") .. tostring(s:p(____C_7C7B_4F24_5BB3_589E_52A0))) .. ")) = ") .. tostring(d)) .. ";\n    (t == nil ? 1 : (1 - A类伤害抵抗(") .. tostring(t and t:p(____A_7C7B_4F24_5BB3_62B5_6297))) .. ")) * (1 - B类伤害抵抗(") .. tostring(t and t:p(____B_7C7B_4F24_5BB3_62B5_6297))) .. ")) * (1 - C类伤害抵抗(") .. tostring(t and t:p(____C_7C7B_4F24_5BB3_62B5_6297))) .. ")) ) = ") .. tostring(e)) .. ";\n    (t == nil ? 1 : (100 / (100 + (物理防御(") .. tostring(t and t:p(_____7269_7406_9632_5FA1))) .. " * (1 + ") .. tostring(t and t:p(_____7269_7406_9632_5FA1_767E_5206_6BD4))) .. ") - 物理穿透(") .. tostring(s:p(_____7269_7406_7A7F_900F))) .. ") - 全能穿透(") .. tostring(s:p(_____5168_80FD_7A7F_900F))) .. ")))) * (1 - 物理伤害抵抗(") .. tostring(t and t:p(_____7269_7406_4F24_5BB3_62B5_6297))) .. ")) + 物理穿透百分比(") .. tostring(s:p(_____7269_7406_7A7F_900F_767E_5206_6BD4))) .. ") + 全能穿透百分比(") .. tostring(s:p(_____5168_80FD_7A7F_900F_767E_5206_6BD4))) .. ")) = ") .. tostring(f)) .. ";\n    A类最终修正(") .. tostring(s:p(____A_7C7B_6700_7EC8_4FEE_6B63))) .. ") + B类最终修正(") .. tostring(s:p(____B_7C7B_6700_7EC8_4FEE_6B63))) .. ") = ") .. tostring(g)) .. ";\n    (A类最终修正(") .. tostring(t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63))) .. ") ?? 0) = ") .. tostring(h)) .. ";\n    \n    ") .. tostring(a)) .. "*") .. tostring(b)) .. "*") .. tostring(c)) .. "*") .. tostring(d)) .. "*") .. tostring(e)) .. "*") .. tostring(f)) .. "+") .. tostring(g)) .. "-") .. tostring(h)) .. " = ") .. tostring(result)) .. "\n        "
                )
            end)
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["法术伤害"],
        function(____, s, t, isCritical, abilityType, v)
            local a = v == nil and s:formula(____exports.Formula["展示面板_法术攻击"]) or v
            local b = isCritical == true and s:p(_____521D_59CB_66B4_51FB_4F24_5BB3) + s:p(_____989D_5916_66B4_51FB_4F24_5BB3) or 1
            local c = abilityType == ____exports.AbilityType["大招"] and 1 + s:p(_____5927_62DB_4F24_5BB3_589E_52A0) or 1
            local d = (1 + s:p(____A_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____B_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____C_7C7B_4F24_5BB3_589E_52A0))
            local e = t == nil and 1 or (1 - t:p(____A_7C7B_4F24_5BB3_62B5_6297)) * (1 - t:p(____B_7C7B_4F24_5BB3_62B5_6297)) * (1 - t:p(____C_7C7B_4F24_5BB3_62B5_6297))
            local f = t == nil and 1 or 100 / (100 + (t:p(_____6CD5_672F_9632_5FA1) * (1 + t:p(_____6CD5_672F_9632_5FA1_767E_5206_6BD4)) - s:p(_____6CD5_672F_7A7F_900F) - s:p(_____5168_80FD_7A7F_900F))) * (1 - t:p(_____6CD5_672F_4F24_5BB3_62B5_6297) + s:p(_____6CD5_672F_7A7F_900F_767E_5206_6BD4) + s:p(_____5168_80FD_7A7F_900F_767E_5206_6BD4))
            local g = s:p(____A_7C7B_6700_7EC8_4FEE_6B63) + s:p(____B_7C7B_6700_7EC8_4FEE_6B63)
            local h = t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63) or 0
            local result = a * b * c * d * e * f + g - h
            local fight = s.fight
            fight.report:using(function(____, r)
                r:log(
                    "#gray 法术伤害计算 #red " .. tostring(result),
                    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((("\n    v = " .. tostring(v)) .. "\n    (v == nil ? s.formula(Formula.展示面板_法术攻击) : v) = ") .. tostring(a)) .. "\n    (isCritical == true ? ((初始暴击伤害(") .. tostring(s:p(_____521D_59CB_66B4_51FB_4F24_5BB3))) .. ") + 额外暴击伤害(") .. tostring(s:p(_____989D_5916_66B4_51FB_4F24_5BB3))) .. "))) : 1) = ") .. tostring(b)) .. "\n    (abilityType == AbilityType.大招 ? 1 + 大招伤害增加(") .. tostring(s:p(_____5927_62DB_4F24_5BB3_589E_52A0))) .. ") : 1) = ") .. tostring(c)) .. "\n    (1 + A类伤害增加(") .. tostring(s:p(____A_7C7B_4F24_5BB3_589E_52A0))) .. ")) * (1 + B类伤害增加(") .. tostring(s:p(____B_7C7B_4F24_5BB3_589E_52A0))) .. ")) * (1 + C类伤害增加(") .. tostring(s:p(____C_7C7B_4F24_5BB3_589E_52A0))) .. ")) = ") .. tostring(d)) .. "\n    (t == nil ? 1 : (1 - A类伤害抵抗(") .. tostring(t and t:p(____A_7C7B_4F24_5BB3_62B5_6297))) .. ")) * (1 - B类伤害抵抗(") .. tostring(t and t:p(____B_7C7B_4F24_5BB3_62B5_6297))) .. ")) * (1 - C类伤害抵抗(") .. tostring(t and t:p(____C_7C7B_4F24_5BB3_62B5_6297))) .. ")) ) = ") .. tostring(e)) .. "\n    (t == nil ? 1 : (100 / (100 + (法术防御(") .. tostring(t and t:p(_____6CD5_672F_9632_5FA1))) .. " * (1+") .. tostring(t and t:p(_____6CD5_672F_9632_5FA1_767E_5206_6BD4))) .. ") - 法术穿透(") .. tostring(s:p(_____6CD5_672F_7A7F_900F))) .. ") - 全能穿透(") .. tostring(s:p(_____5168_80FD_7A7F_900F))) .. "))))) * (1 - 法术伤害抵抗(") .. tostring(t and t:p(_____6CD5_672F_4F24_5BB3_62B5_6297))) .. ") +法术穿透百分比(") .. tostring(s:p(_____6CD5_672F_7A7F_900F_767E_5206_6BD4))) .. ") + 全能穿透百分比(") .. tostring(s:p(_____5168_80FD_7A7F_900F_767E_5206_6BD4))) .. "))) = ") .. tostring(f)) .. "\n    A类最终修正(") .. tostring(s:p(____A_7C7B_6700_7EC8_4FEE_6B63))) .. ") + B类最终修正(") .. tostring(s:p(____B_7C7B_6700_7EC8_4FEE_6B63))) .. ") = ") .. tostring(g)) .. "\n    (C类最终修正(") .. tostring(t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63))) .. ") ?? 0) = ") .. tostring(h)) .. "\n        \n    ") .. tostring(a)) .. "*") .. tostring(b)) .. "*") .. tostring(c)) .. "*") .. tostring(d)) .. "*") .. tostring(e)) .. "*") .. tostring(f)) .. "+") .. tostring(g)) .. "-") .. tostring(h)) .. " = ") .. tostring(result)) .. "\n            "
                )
            end)
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["固定伤害"],
        function(____, s, t, isCritical, abilityType, v)
            local a = v == nil and 1 or v
            local b = isCritical == true and s:p(_____521D_59CB_66B4_51FB_4F24_5BB3) + s:p(_____989D_5916_66B4_51FB_4F24_5BB3) or 1
            local c = abilityType == ____exports.AbilityType["大招"] and 1 + s:p(_____5927_62DB_4F24_5BB3_589E_52A0) or 1
            local d = s:p(____A_7C7B_6700_7EC8_4FEE_6B63) + s:p(____B_7C7B_6700_7EC8_4FEE_6B63)
            local e = t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63) or 0
            local result = a * b * c + d - e
            local fight = s.fight
            fight.report:using(function(____, r)
                r:log(
                    "#gray 固定伤害计算 #red " .. tostring(result),
                    ((((((((((((((((((((((((((((((((((("\n    v = " .. tostring(v)) .. "\n    (v == nil ? 1 : v) = ") .. tostring(a)) .. "\n    (isCritical == true ? ((初始暴击伤害(") .. tostring(s:p(_____521D_59CB_66B4_51FB_4F24_5BB3))) .. ") + 额外暴击伤害(") .. tostring(s:p(_____989D_5916_66B4_51FB_4F24_5BB3))) .. "))) : 1) = ") .. tostring(b)) .. "\n    (abilityType == AbilityType.大招 ? 1 + 大招伤害增加(") .. tostring(s:p(_____5927_62DB_4F24_5BB3_589E_52A0))) .. ") : 1) = ") .. tostring(c)) .. "\n    A类最终修正(") .. tostring(s:p(____A_7C7B_6700_7EC8_4FEE_6B63))) .. ") + B类最终修正(") .. tostring(s:p(____B_7C7B_6700_7EC8_4FEE_6B63))) .. ") = ") .. tostring(d)) .. "\n    (C类最终修正(") .. tostring(t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63))) .. ") ?? 0) = ") .. tostring(e)) .. "\n\n    ") .. tostring(a)) .. "*") .. tostring(b)) .. "*") .. tostring(c)) .. "+") .. tostring(d)) .. "-") .. tostring(e)) .. " = ") .. tostring(result)) .. "\n            "
                )
            end)
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["真实伤害"],
        function(____, s, t, isCritical, abilityType, v)
            local a = v == nil and 1 or v
            local b = isCritical == true and s:p(_____521D_59CB_66B4_51FB_4F24_5BB3) + s:p(_____989D_5916_66B4_51FB_4F24_5BB3) or 1
            local c = abilityType == ____exports.AbilityType["大招"] and 1 + s:p(_____5927_62DB_4F24_5BB3_589E_52A0) or 1
            local d = (1 + s:p(____A_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____B_7C7B_4F24_5BB3_589E_52A0)) * (1 + s:p(____C_7C7B_4F24_5BB3_589E_52A0))
            local e = s:p(____A_7C7B_6700_7EC8_4FEE_6B63) + s:p(____B_7C7B_6700_7EC8_4FEE_6B63)
            local f = t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63) or 0
            local result = a * b * c * d + e - f
            local fight = s.fight
            fight.report:using(function(____, r)
                r:log(
                    "#gray 固定伤害计算 #red " .. tostring(result),
                    ((((((((((((((((((((((((((((((((((((((((((("\n    v = " .. tostring(v)) .. "\n    (v == undefined ? 1 : v) = ") .. tostring(a)) .. "\n    (isCritical == true ? ((初始暴击伤害(") .. tostring(s:p(_____521D_59CB_66B4_51FB_4F24_5BB3))) .. ") + 额外暴击伤害(") .. tostring(s:p(_____989D_5916_66B4_51FB_4F24_5BB3))) .. "))) : 1) = ") .. tostring(b)) .. "\n    (abilityType == AbilityType.大招 ? 1 + 大招伤害增加(") .. tostring(s:p(_____5927_62DB_4F24_5BB3_589E_52A0))) .. ") : 1) = ") .. tostring(c)) .. "\n    (1 + s.p(A类伤害增加)) * (1 + B类伤害增加(") .. tostring(s:p(____B_7C7B_4F24_5BB3_589E_52A0))) .. ")) * (1 + C类伤害增加(") .. tostring(s:p(____C_7C7B_4F24_5BB3_589E_52A0))) .. ")) = ") .. tostring(d)) .. "\n    A类最终修正(") .. tostring(s:p(____A_7C7B_6700_7EC8_4FEE_6B63))) .. ") + B类最终修正(") .. tostring(s:p(____B_7C7B_6700_7EC8_4FEE_6B63))) .. ") = ") .. tostring(e)) .. "\n    (C类最终修正(") .. tostring(t and t:p(____C_7C7B_6700_7EC8_4FEE_6B63))) .. ") ?? 0) = ") .. tostring(f)) .. "\n\n    ") .. tostring(a)) .. "*") .. tostring(b)) .. "*") .. tostring(c)) .. "*") .. tostring(d)) .. "+") .. tostring(e)) .. "-") .. tostring(f)) .. " = ") .. tostring(result)) .. "\n            "
                )
            end)
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["绝对伤害"],
        function(____, s, t, isCritical, abilityType, v)
            local result = v == nil and 1 or v
            local fight = s.fight
            fight.report:using(function(____, r)
                r:log("#gray 绝对伤害 #red " .. tostring(result))
            end)
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["回血值"],
        function(____, s, t, isCritical, abilityType, value)
            local result = (value or 1) * (1 + s:p(_____6062_590D_7CFB_6570))
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["回血值_无恢复效果影响"],
        function(____, s, t, isCritical, abilityType, value)
            local result = value or 1
            return math.max(
                1,
                math.floor(result + 0.5)
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["闪避公式"],
        function(____, s, t, isCritical, abilityType, value)
            local probability = s:p(_____95EA_907F_7387) - (t and t:p(_____547D_4E2D) or 0)
            probability = math.min(
                math.max(probability, 0),
                1
            )
            return probability
        end
    )
    fight:registerFormula(
        ____exports.Formula["法术闪避公式"],
        function(____, s, t, isCritical, abilityType, value)
            local probability = s:p(_____6CD5_672F_95EA_907F_7387) - (t and t:p(_____547D_4E2D) or 0)
            probability = math.min(
                math.max(probability, 0),
                1
            )
            return probability
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理攻击"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____653B_51FB) * (1 + s:p(_____7269_7406_653B_51FB_767E_5206_6BD4)) + s:p(_____989D_5916_7269_7406_653B_51FB)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术攻击"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6CD5_672F_653B_51FB) * (1 + s:p(_____6CD5_672F_653B_51FB_767E_5206_6BD4)) + s:p(_____989D_5916_6CD5_672F_653B_51FB)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_暴击"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____66B4_51FB_7387)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_攻速"],
        function(____, s, t, isCritical, abilityType, value)
            local x = math.max(
                s:p(_____653B_51FB_901F_5EA6) * (1 + s:p(_____653B_51FB_901F_5EA6_767E_5206_6BD4)),
                40
            )
            return x
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_闪避"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____95EA_907F_7387)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_精准"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____547D_4E2D)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_血量上限"],
        function(____, s, t, isCritical, abilityType, value)
            local result = s:p(_____57FA_7840_8840_91CF_4E0A_9650) * (1 + s:p(_____8840_91CF_767E_5206_6BD4)) + s:p(_____989D_5916_8840_91CF)
            return math.max(
                math.floor(result + 0.5),
                1
            )
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_回蓝速度"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6BCF_79D2_56DE_84DD) * (1 + s:p(_____603B_56DE_84DD_901F_7387))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_暴击伤害"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____521D_59CB_66B4_51FB_4F24_5BB3) + s:p(_____989D_5916_66B4_51FB_4F24_5BB3)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_毒系数"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6BD2_7CFB_6570)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_恢复系数"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6062_590D_7CFB_6570)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_大招伤害增加"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____5927_62DB_4F24_5BB3_589E_52A0)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_总物理防御系数"],
        function(____, s, t, isCritical, abilityType, value)
            return 1 - (1 - s:p(_____7269_7406_4F24_5BB3_62B5_6297)) * (100 / (100 + s:p(_____7269_7406_9632_5FA1) * (1 + s:p(_____7269_7406_9632_5FA1_767E_5206_6BD4))))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_总法术防御系数"],
        function(____, s, t, isCritical, abilityType, value)
            return 1 - (1 - s:p(_____6CD5_672F_4F24_5BB3_62B5_6297)) * (100 / (100 + s:p(_____6CD5_672F_9632_5FA1) * (1 + s:p(_____6CD5_672F_9632_5FA1_767E_5206_6BD4))))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理防御系数"],
        function(____, s, t, isCritical, abilityType, value)
            return 1 - 100 / (100 + s:p(_____7269_7406_9632_5FA1) * (1 + s:p(_____7269_7406_9632_5FA1_767E_5206_6BD4)))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术防御系数"],
        function(____, s, t, isCritical, abilityType, value)
            return 1 - 100 / (100 + s:p(_____6CD5_672F_9632_5FA1) * (1 + s:p(_____6CD5_672F_9632_5FA1_767E_5206_6BD4)))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理防御"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____7269_7406_9632_5FA1) * (1 + s:p(_____7269_7406_9632_5FA1_767E_5206_6BD4))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术防御"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6CD5_672F_9632_5FA1) * (1 + s:p(_____6CD5_672F_9632_5FA1_767E_5206_6BD4))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_每5秒恢复生命"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6BCF5_79D2_751F_547D_6062_590D)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_每5秒获得护盾"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6BCF5_79D2_83B7_5F97_62A4_76FE)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理吸血百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____7269_7406_5438_8840_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术吸血百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6CD5_672F_5438_8840_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_普攻吸血百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____666E_653B_5438_8840_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_大招吸血百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____5927_62DB_5438_8840_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_全能吸血百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____5168_80FD_5438_8840_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_移动速度"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____79FB_52A8_901F_5EA6) * (1 + s:p(_____79FB_52A8_901F_5EA6_767E_5206_6BD4))
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理穿透"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____7269_7406_7A7F_900F)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_物理穿透百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____7269_7406_7A7F_900F_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术穿透"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6CD5_672F_7A7F_900F)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_法术穿透百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____6CD5_672F_7A7F_900F_767E_5206_6BD4)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_全能穿透"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____5168_80FD_7A7F_900F)
        end
    )
    fight:registerFormula(
        ____exports.Formula["展示面板_全能穿透百分比"],
        function(____, s, t, isCritical, abilityType, value)
            return s:p(_____5168_80FD_7A7F_900F_767E_5206_6BD4)
        end
    )
end
function FightController.prototype.initStatistics(self)
    local totalEffect = {
        [1] = function(____, source, target, effect, quantity)
        end,
        [2] = function(____, source, target, effect, quantity)
            getUnit(nil, source):genStatistics("给别人添加寒霜效果的总层数", quantity)
        end,
        [3] = function(____, source, target, effect, quantity)
            target:genStatistics("自己获取怒火总层数", quantity)
        end,
        [4] = function(____, source, target, effect, quantity)
            getUnit(nil, source):genStatistics("给别人添加易伤效果的总层数", quantity)
            target:genStatistics("自己获得易伤总层数", quantity)
        end,
        [5] = function(____, source, target, effect, quantity)
            target:genStatistics("自己获得护盾总层数", quantity)
        end
    }
    fight:registerCallbacks({
        onCreate = function(____, unit)
        end,
        onAddEffect = function(____, source, target, effect, quantity)
            if quantity < 0 then
                return
            end
            local logic = totalEffect[effect.config.id]
            if logic ~= nil then
                logic(
                    nil,
                    source,
                    target,
                    effect,
                    quantity
                )
            end
        end,
        onModifyEffectQuantity = function(____, source, target, effect, oldQuantity, newQuantity)
        end,
        onCure = function(____, source, target, value)
            local sourceUnit = getUnit(nil, source)
            local ancestor = getAncestor(nil, sourceUnit)
            if isSkill(nil, source) or isSimpleSkill(nil, source) then
                local skillConfigList = skillConfigMap_abilityName[source.skillName]
                local skill = skillConfigList ~= nil and skillConfigList[1] or nil
                local name = skill and skill.name or source.skillName
                local old = ancestor.hurtTotal.cureTotal[name]
                ancestor.hurtTotal.cureTotal[name] = (old or 0) + value
                old = ancestor.hurtTotal.cureTotalAll[name]
                ancestor.hurtTotal.cureTotalAll[name] = (old or 0) + value
                old = target.hurtTotal.treatedTotal[name]
                target.hurtTotal.treatedTotal[name] = (old or 0) + value
                old = target.hurtTotal.treatedTotalAll[name]
                target.hurtTotal.treatedTotalAll[name] = (old or 0) + value
            elseif isEffect(nil, source) then
                local old = ancestor.hurtTotal.cureTotal[source.config.name]
                ancestor.hurtTotal.cureTotal[source.config.name] = (old or 0) + value
                old = ancestor.hurtTotal.cureTotalAll[source.config.name]
                ancestor.hurtTotal.cureTotalAll[source.config.name] = (old or 0) + value
                old = target.hurtTotal.treatedTotal[source.config.name]
                target.hurtTotal.treatedTotal[source.config.name] = (old or 0) + value
                old = target.hurtTotal.treatedTotalAll[source.config.name]
                target.hurtTotal.treatedTotalAll[source.config.name] = (old or 0) + value
            elseif isUnit(nil, source) then
                local old = ancestor.hurtTotal.cureTotal[source:getName()]
                ancestor.hurtTotal.cureTotal[source:getName()] = (old or 0) + value
                old = ancestor.hurtTotal.cureTotalAll[source:getName()]
                ancestor.hurtTotal.cureTotalAll[source:getName()] = (old or 0) + value
                old = target.hurtTotal.treatedTotal[source:getName()]
                target.hurtTotal.treatedTotal[source:getName()] = (old or 0) + value
                old = target.hurtTotal.treatedTotalAll[source:getName()]
                target.hurtTotal.treatedTotalAll[source:getName()] = (old or 0) + value
            end
            target:genStatistics("回复次数")
            target:genStatistics("累计被恢复血量值", value)
        end,
        onPreHurt = function(____, source, target, formulaId, value, critical, miss, overwrite)
            local gameData = datas.global:getSingle(GameData)
            if gameData == nil then
                return
            end
            if gameData.randomEventType == GameRandomEventType["混乱伤害"] then
                local r = math.random()
                if r < 0.2 then
                    overwrite(nil, value * 0.1)
                elseif r < 0.4 then
                    overwrite(nil, value * 0.5)
                elseif r < 0.6 then
                elseif r < 0.8 then
                    overwrite(nil, value * 2)
                else
                    overwrite(nil, value * 10)
                end
            elseif gameData.randomEventType == GameRandomEventType["艰苦抉择"] then
                local sourceUnit = getUnit(nil, source)
                if (sourceUnit and sourceUnit.playerId) == nil or datas.players[sourceUnit and sourceUnit.playerId] == nil then
                    return
                end
                local playerData = datas.players[sourceUnit.playerId]:getSingle(PlayerData)
                if playerData == nil then
                    return
                end
                if GameUtils.maxBaseInterest <= 0 then
                    local scale = 1 + defaultConfig["随机事件艰苦抉择"]
                    overwrite(nil, value * scale)
                else
                    local gold = math.max(
                        0,
                        math.min(
                            GameUtils.maxBaseInterest,
                            math.floor(playerData.gold / 10 * defaultConfig["利息"])
                        )
                    )
                    local scale = 1 + defaultConfig["随机事件艰苦抉择"] * ((GameUtils.maxBaseInterest - gold) / GameUtils.maxBaseInterest)
                    overwrite(nil, value * scale)
                end
            end
        end,
        onHurt = function(____, source, target, formulaId, value, critical, miss, shieldMinusValue, abilityType)
            local sourceUnit = getUnit(nil, source)
            local jumpValue = value + shieldMinusValue
            local ancestor = getAncestor(nil, sourceUnit)
            if isSkill(nil, source) or isSimpleSkill(nil, source) then
                local skillConfigList = skillConfigMap_abilityName[source.skillName]
                local skill = skillConfigList ~= nil and skillConfigList[1] or nil
                local name = skill and skill.name or source.skillName
                local old = ancestor.hurtTotal.hurtTotal[name]
                ancestor.hurtTotal.hurtTotal[name] = (old or 0) + jumpValue
                old = ancestor.hurtTotal.hurtTotalAll[name]
                ancestor.hurtTotal.hurtTotalAll[name] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotal[name]
                target.hurtTotal.injuredTotal[name] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotalAll[name]
                target.hurtTotal.injuredTotalAll[name] = (old or 0) + jumpValue
            elseif isEffect(nil, source) then
                local old = ancestor.hurtTotal.hurtTotal[source.config.name]
                ancestor.hurtTotal.hurtTotal[source.config.name] = (old or 0) + jumpValue
                old = ancestor.hurtTotal.hurtTotalAll[source.config.name]
                ancestor.hurtTotal.hurtTotalAll[source.config.name] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotal[source.config.name]
                target.hurtTotal.injuredTotal[source.config.name] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotalAll[source.config.name]
                target.hurtTotal.injuredTotalAll[source.config.name] = (old or 0) + jumpValue
            elseif isUnit(nil, source) then
                local old = ancestor.hurtTotal.hurtTotal[source:getName()]
                ancestor.hurtTotal.hurtTotal[source:getName()] = (old or 0) + jumpValue
                old = ancestor.hurtTotal.hurtTotalAll[source:getName()]
                ancestor.hurtTotal.hurtTotalAll[source:getName()] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotal[source:getName()]
                target.hurtTotal.injuredTotal[source:getName()] = (old or 0) + jumpValue
                old = target.hurtTotal.injuredTotalAll[source:getName()]
                target.hurtTotal.injuredTotalAll[source:getName()] = (old or 0) + jumpValue
            end
            if critical then
                sourceUnit:genStatistics("暴击别人次数")
            end
            if miss then
                target:genStatistics("自己闪避次数")
            end
            if not miss then
                target:genStatistics("被攻击次数")
                sourceUnit:genStatistics("攻击次数")
                if formulaId == ____exports.Formula["物理伤害"] then
                    target:genStatistics("被物理攻击次数")
                    sourceUnit:genStatistics("物理攻击次数")
                    target:genStatistics("累计被物理伤害值", jumpValue)
                    sourceUnit:genStatistics("累计产生物理伤害值", jumpValue)
                elseif formulaId == ____exports.Formula["法术伤害"] then
                    target:genStatistics("被法术攻击次数")
                    sourceUnit:genStatistics("法术攻击次数")
                    target:genStatistics("累计被法术伤害值", jumpValue)
                    sourceUnit:genStatistics("累计产生法术伤害值", jumpValue)
                elseif formulaId == ____exports.Formula["固定伤害"] then
                    target:genStatistics("累计被固定伤害值", jumpValue)
                    sourceUnit:genStatistics("累计产生固定伤害值", jumpValue)
                elseif formulaId == ____exports.Formula["真实伤害"] then
                    target:genStatistics("累计被真实伤害值", jumpValue)
                    sourceUnit:genStatistics("累计产生真实伤害值", jumpValue)
                end
            end
            target:genStatistics("本场战斗损失生命值", value)
            target:genStatistics("本场战斗受到伤害", jumpValue)
            if sourceUnit:checkTag(UnitTag["召唤物"]) and sourceUnit.parent ~= nil then
                sourceUnit.parent:genStatistics("我的召唤物造成伤害", jumpValue)
            end
            if formulaId == ____exports.Formula["物理伤害"] then
                sourceUnit:genStatistics("发出物理伤害次数")
                target:genStatistics("受到物理伤害次数")
                if critical then
                    sourceUnit:genStatistics("发出物理伤害并暴击次数")
                    target:genStatistics("受到物理伤害并被暴击次数")
                else
                    sourceUnit:genStatistics("发出物理伤害未暴击次数")
                    target:genStatistics("受到物理伤害未暴击次数")
                end
            end
            if shieldMinusValue > 0 then
                target:genStatistics("护盾减少累计值", shieldMinusValue)
            end
            local bloodSuckPercent = sourceUnit:f(____exports.Formula["展示面板_全能吸血百分比"])
            if abilityType ~= nil then
                bloodSuckPercent = bloodSuckPercent + (abilityType == 0 and sourceUnit:f(____exports.Formula["展示面板_普攻吸血百分比"]) or (abilityType == 1 and sourceUnit:f(____exports.Formula["展示面板_大招吸血百分比"]) or 0))
            end
            if formulaId == ____exports.Formula["物理伤害"] then
                bloodSuckPercent = bloodSuckPercent + sourceUnit:f(____exports.Formula["展示面板_物理吸血百分比"])
            end
            if formulaId == ____exports.Formula["法术伤害"] then
                bloodSuckPercent = bloodSuckPercent + sourceUnit:f(____exports.Formula["展示面板_法术吸血百分比"])
            end
            local cureValue = math.floor(bloodSuckPercent * jumpValue)
            if cureValue > 0 then
                sourceUnit:cure(sourceUnit, ____exports.Formula["回血值"], cureValue)
            end
        end,
        onUseSkill = function(____, source, skill, isNormal)
            local sourceUnit = getUnit(nil, source)
            if skill.isBigSkill then
                sourceUnit:genStatistics("自己释放大招")
            end
            if isNormal then
                sourceUnit:genStatistics("自己发起普攻")
            else
                sourceUnit:genStatistics("自己释放技能")
            end
        end,
        onUseSkillEnd = function(____, source, skill, isNormal)
            local sourceUnit = getUnit(nil, source)
            if skill.isBigSkill then
                sourceUnit:genStatistics("自己释放大招后")
            end
            if isNormal then
                sourceUnit:genStatistics("自己发起普攻后")
            else
                sourceUnit:genStatistics("自己释放技能后")
            end
        end,
        onUseSimpleSkill = function(____, source, simpleSkill, isNormal)
            local sourceUnit = getUnit(nil, source)
            sourceUnit:genStatistics("自己释放简易技能次数")
        end,
        onEnterFight = function(____, unit)
            if unit:isAlive() then
                unit.activeData.pauseTimer = false
            end
        end,
        onLeaveFight = function(____, unit)
            unit.activeData.pauseTimer = true
        end,
        onMoveEnd = function(____, unit)
        end,
        onMoveAlongEnd = function(____, unit)
        end,
        onDied = function(____, target, source)
            local old = source.hurtTotal.killTotal[target:getName()]
            source.hurtTotal.killTotal[target:getName()] = (old or 0) + 1
            local ancestor = getAncestor(nil, source)
            old = target.hurtTotal.deathTotal[ancestor:getName()]
            target.hurtTotal.deathTotal[ancestor:getName()] = (old or 0) + 1
            target:removeEffectByGroup(target, {100, -1})
            y3.ltimer.wait(
                2,
                function()
                    if target.y3Unit ~= nil and not target:isAlive() then
                        local pos = target.y3Unit:get_point()
                        target.y3Unit:set_height(-1000, 10)
                        y3.ltimer.wait(
                            0.25,
                            function()
                                local particle = y3.particle.create({
                                    type = 134270826,
                                    angle = math.random() * 360,
                                    target = pos,
                                    time = nil,
                                    scale = 1,
                                    socket = "root",
                                    follow_rotation = nil,
                                    follow_scale = true,
                                    height = nil,
                                    immediate = nil,
                                    detach = nil
                                })
                            end
                        )
                    end
                end
            )
            local ancestorUnitData = ancestor.customData
            if target.customData ~= nil and ancestorUnitData ~= nil and (ancestorUnitData.type == UnitType.PLAYER or ancestorUnitData.type == UnitType.MERCENARY) then
                local playerStatisticsData = writeableDatas.players[ancestorUnitData.creatorPlayerId]:getOrCreateSingle(PlayerStatisticsData)
                local targetUnit = target.customData
                if targetUnit.type == UnitType.MONSTER then
                    playerStatisticsData.killMonster = playerStatisticsData.killMonster + 1
                elseif targetUnit.type == UnitType.ELITE then
                    playerStatisticsData.killElite = playerStatisticsData.killElite + 1
                elseif targetUnit.type == UnitType.HERO_IMAGE then
                    playerStatisticsData.killHero = playerStatisticsData.killHero + 1
                end
            end
            local unitData = target.customData
            if unitData ~= nil and unitData.type == UnitType.PLAYER then
                triggerManager:trigger(TriggerType["英雄死亡时"], {playerId = unitData.y3Player.id})
            end
            local gameData = datas.global:getSingle(GameData)
            if (gameData and gameData.randomEventType) == GameRandomEventType["死亡自爆"] then
                local targets = target:findTargets(
                    {"敌军", "友军"},
                    nil,
                    nil,
                    1,
                    350
                )
                for ____, t in ipairs(targets) do
                    t:hurt(source, 3, gameData.level * 10)
                end
            end
        end,
        onMpChange = function(____, unit, newVal, oldVal)
            if newVal > oldVal then
                local add = newVal - oldVal
                unit.hurtTotal.mpTotal = unit.hurtTotal.mpTotal + add
                unit.hurtTotal.mpTotalAll = unit.hurtTotal.mpTotalAll + add
            end
        end,
        onAddShield = function(____, target, source, id, value)
            local sourceUnit = getUnit(nil, source)
            if isSkill(nil, source) or isSimpleSkill(nil, source) then
                local skillConfigList = skillConfigMap_abilityName[source.skillName]
                local skill = skillConfigList ~= nil and skillConfigList[1] or nil
                local name = skill and skill.name or source.skillName
                local old = target.hurtTotal.shieldTotal[name]
                target.hurtTotal.shieldTotal[name] = (old or 0) + value
                old = target.hurtTotal.shieldTotalAll[name]
                target.hurtTotal.shieldTotalAll[name] = (old or 0) + value
            elseif isEffect(nil, source) then
                local old = target.hurtTotal.shieldTotal[source.config.name]
                target.hurtTotal.shieldTotal[source.config.name] = (old or 0) + value
                old = target.hurtTotal.shieldTotalAll[source.config.name]
                target.hurtTotal.shieldTotalAll[source.config.name] = (old or 0) + value
            elseif isUnit(nil, source) then
                local old = target.hurtTotal.shieldTotal[source:getName()]
                target.hurtTotal.shieldTotal[source:getName()] = (old or 0) + value
                old = target.hurtTotal.shieldTotalAll[source:getName()]
                target.hurtTotal.shieldTotalAll[source:getName()] = (old or 0) + value
            end
            if id == _____901A_7528_62A4_76FE then
                target:genStatistics("通用护盾累计数值", value)
            elseif id == _____7269_7406_62A4_76FE then
                target:genStatistics("物理护盾护盾累计数值", value)
            elseif id == _____6CD5_672F_62A4_76FE then
                target:genStatistics("法术护盾护盾累计数值", value)
            end
        end
    })
    fight.globalStatistics = function(____, unit, name)
        if name == "开战次数" then
            local gameData = datas.global:getSingle(GameData)
            return gameData and gameData.runningLevel
        end
        return nil
    end
end
function FightController.prototype.initDynamicTags(self)
    local ____fight_dynamicTags_68 = fight.dynamicTags
    local ____fight_dynamicTags_67 = fight.dynamicTags
    local function ____temp_66(____, unit)
        return getEnemyTagsMap(nil, unit)
    end
    fight.dynamicTags["敌方"] = ____temp_66
    ____fight_dynamicTags_67["敌人"] = ____temp_66
    ____fight_dynamicTags_68["敌军"] = ____temp_66
    local ____fight_dynamicTags_71 = fight.dynamicTags
    local ____fight_dynamicTags_70 = fight.dynamicTags
    local function ____temp_69(____, unit)
        return getFriendlyTagsMap(nil, unit)
    end
    fight.dynamicTags["友方"] = ____temp_69
    ____fight_dynamicTags_70["友人"] = ____temp_69
    ____fight_dynamicTags_71["友军"] = ____temp_69
    fight.dynamicTags["我的召唤物"] = function(____, unit)
        local map = {}
        map[tostring(unit.id) .. "_的召唤物"] = true
        return map
    end
end
function FightController.prototype.initTextType(self)
    fight.getTextType = function(____, formulaId)
        repeat
            local ____switch240 = formulaId
            local ____cond240 = ____switch240 == ____exports.Formula["物理伤害"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["物理"], jump = ____exports["跳字动画"]["物理伤害"], critical = ____exports["飘字"]["物理暴击"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["法术伤害"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["法术"], jump = ____exports["跳字动画"]["法术伤害"], critical = ____exports["飘字"]["法术暴击"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["固定伤害"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["真实"], jump = ____exports["跳字动画"]["固定伤害"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["真实伤害"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["真实"], jump = ____exports["跳字动画"]["真实伤害"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["绝对伤害"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["真实"], jump = ____exports["跳字动画"]["真实伤害"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["回血值"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["治疗"], jump = ____exports["跳字动画"]["治疗"]}
            end
            ____cond240 = ____cond240 or ____switch240 == ____exports.Formula["回血值_无恢复效果影响"]
            if ____cond240 then
                return {textType = ____exports["飘字"]["治疗"], jump = ____exports["跳字动画"]["治疗"]}
            end
            do
                return {textType = ____exports["飘字"]["真实"], jump = 0}
            end
        until true
    end
end
____exports.fightController = make(nil, ____exports.FightController)
return ____exports
