local ____lualib = include("lualib_bundle")
local __TS__Class = ____lualib.__TS__Class
local __TS__ClassExtends = ____lualib.__TS__ClassExtends
local __TS__ArrayReduce = ____lualib.__TS__ArrayReduce
local __TS__ArrayFilter = ____lualib.__TS__ArrayFilter
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["9"] = 1,["10"] = 1,["11"] = 1,["12"] = 1,["13"] = 1,["14"] = 1,["15"] = 1,["16"] = 1,["17"] = 1,["18"] = 1,["19"] = 1,["20"] = 1,["21"] = 1,["22"] = 1,["23"] = 1,["24"] = 1,["25"] = 2,["26"] = 2,["27"] = 2,["28"] = 3,["29"] = 3,["30"] = 4,["31"] = 4,["32"] = 5,["33"] = 5,["34"] = 6,["35"] = 6,["36"] = 7,["37"] = 7,["38"] = 8,["39"] = 8,["40"] = 9,["41"] = 9,["42"] = 10,["43"] = 10,["44"] = 11,["45"] = 11,["46"] = 12,["47"] = 12,["48"] = 13,["49"] = 13,["50"] = 15,["51"] = 15,["52"] = 15,["53"] = 16,["54"] = 16,["55"] = 17,["56"] = 17,["57"] = 18,["58"] = 18,["59"] = 19,["60"] = 19,["61"] = 20,["62"] = 20,["63"] = 21,["64"] = 21,["65"] = 22,["66"] = 22,["67"] = 23,["68"] = 23,["69"] = 24,["70"] = 24,["71"] = 25,["72"] = 25,["73"] = 26,["74"] = 26,["75"] = 27,["76"] = 27,["77"] = 28,["78"] = 28,["79"] = 29,["80"] = 29,["81"] = 30,["82"] = 30,["83"] = 31,["84"] = 31,["85"] = 32,["86"] = 32,["87"] = 33,["88"] = 33,["89"] = 34,["90"] = 34,["91"] = 35,["92"] = 35,["93"] = 36,["94"] = 36,["95"] = 37,["96"] = 37,["97"] = 38,["98"] = 38,["99"] = 39,["100"] = 39,["101"] = 40,["102"] = 40,["103"] = 41,["104"] = 41,["105"] = 43,["106"] = 43,["107"] = 44,["108"] = 44,["109"] = 45,["110"] = 45,["111"] = 46,["112"] = 46,["113"] = 47,["114"] = 47,["115"] = 48,["116"] = 48,["119"] = 54,["120"] = 55,["121"] = 55,["122"] = 56,["123"] = 56,["124"] = 56,["125"] = 56,["126"] = 56,["127"] = 56,["128"] = 56,["129"] = 56,["130"] = 55,["131"] = 60,["132"] = 60,["133"] = 60,["134"] = 60,["135"] = 55,["136"] = 55,["137"] = 54,["138"] = 64,["139"] = 66,["140"] = 67,["141"] = 67,["142"] = 68,["143"] = 68,["144"] = 68,["145"] = 68,["146"] = 68,["147"] = 68,["148"] = 68,["149"] = 68,["150"] = 68,["151"] = 68,["152"] = 69,["153"] = 69,["154"] = 69,["155"] = 69,["156"] = 69,["157"] = 69,["158"] = 69,["159"] = 69,["160"] = 69,["161"] = 69,["162"] = 69,["163"] = 68,["164"] = 70,["165"] = 70,["166"] = 70,["167"] = 70,["168"] = 70,["169"] = 70,["170"] = 70,["171"] = 70,["172"] = 70,["173"] = 70,["174"] = 70,["175"] = 68,["176"] = 71,["177"] = 71,["178"] = 71,["179"] = 71,["180"] = 71,["181"] = 71,["182"] = 71,["183"] = 71,["184"] = 71,["185"] = 71,["186"] = 71,["187"] = 68,["188"] = 72,["189"] = 72,["190"] = 72,["191"] = 72,["192"] = 72,["193"] = 72,["194"] = 72,["195"] = 72,["196"] = 72,["197"] = 72,["198"] = 72,["199"] = 68,["200"] = 73,["201"] = 73,["202"] = 73,["203"] = 73,["204"] = 73,["205"] = 73,["206"] = 73,["207"] = 73,["208"] = 73,["209"] = 73,["210"] = 73,["211"] = 68,["212"] = 74,["213"] = 74,["214"] = 74,["215"] = 74,["216"] = 74,["217"] = 74,["218"] = 74,["219"] = 74,["220"] = 74,["221"] = 74,["222"] = 74,["223"] = 68,["224"] = 68,["225"] = 68,["226"] = 67,["227"] = 76,["228"] = 76,["229"] = 77,["230"] = 77,["231"] = 77,["232"] = 77,["233"] = 77,["234"] = 77,["235"] = 77,["236"] = 77,["237"] = 77,["238"] = 77,["239"] = 77,["240"] = 76,["241"] = 78,["242"] = 78,["243"] = 78,["244"] = 78,["245"] = 78,["246"] = 78,["247"] = 78,["248"] = 78,["249"] = 78,["250"] = 78,["251"] = 78,["252"] = 76,["253"] = 79,["254"] = 79,["255"] = 79,["256"] = 79,["257"] = 79,["258"] = 79,["259"] = 79,["260"] = 79,["261"] = 79,["262"] = 79,["263"] = 79,["264"] = 76,["265"] = 80,["266"] = 80,["267"] = 80,["268"] = 80,["269"] = 80,["270"] = 80,["271"] = 80,["272"] = 80,["273"] = 80,["274"] = 80,["275"] = 80,["276"] = 76,["277"] = 81,["278"] = 81,["279"] = 81,["280"] = 81,["281"] = 81,["282"] = 81,["283"] = 81,["284"] = 81,["285"] = 81,["286"] = 81,["287"] = 81,["288"] = 76,["289"] = 82,["290"] = 82,["291"] = 82,["292"] = 82,["293"] = 82,["294"] = 82,["295"] = 82,["296"] = 82,["297"] = 82,["298"] = 82,["299"] = 82,["300"] = 76,["301"] = 67,["302"] = 67,["303"] = 66,["304"] = 87,["305"] = 87,["306"] = 87,["307"] = 87,["308"] = 87,["309"] = 87,["310"] = 87,["311"] = 87,["312"] = 88,["313"] = 88,["314"] = 88,["315"] = 88,["316"] = 88,["317"] = 88,["318"] = 88,["319"] = 88,["320"] = 91,["321"] = 91,["322"] = 91,["323"] = 91,["324"] = 88,["325"] = 94,["326"] = 94,["327"] = 94,["328"] = 94,["329"] = 94,["330"] = 94,["331"] = 94,["332"] = 94,["333"] = 94,["334"] = 94,["335"] = 94,["336"] = 88,["337"] = 88,["338"] = 87,["339"] = 87,["340"] = 87,["341"] = 87,["342"] = 64,["343"] = 100,["344"] = 101,["345"] = 101,["346"] = 101,["347"] = 101,["348"] = 101,["349"] = 101,["350"] = 101,["351"] = 101,["352"] = 101,["353"] = 101,["354"] = 110,["355"] = 110,["356"] = 110,["357"] = 112,["358"] = 112,["359"] = 112,["360"] = 112,["361"] = 112,["362"] = 112,["363"] = 112,["364"] = 112,["365"] = 110,["366"] = 101,["367"] = 101,["368"] = 100,["369"] = 125,["370"] = 125,["371"] = 125,["372"] = 125,["373"] = 127,["374"] = 128,["375"] = 128,["376"] = 128,["377"] = 128,["378"] = 128,["379"] = 128,["380"] = 130,["381"] = 130,["382"] = 133,["383"] = 133,["384"] = 134,["385"] = 134,["386"] = 134,["387"] = 134,["388"] = 134,["389"] = 134,["390"] = 134,["391"] = 134,["392"] = 134,["393"] = 136,["394"] = 136,["395"] = 136,["396"] = 136,["397"] = 136,["398"] = 136,["399"] = 137,["400"] = 137,["401"] = 137,["402"] = 137,["403"] = 138,["404"] = 138,["405"] = 138,["406"] = 138,["407"] = 138,["408"] = 137,["409"] = 143,["410"] = 143,["411"] = 143,["412"] = 143,["413"] = 143,["414"] = 143,["415"] = 143,["416"] = 146,["417"] = 146,["418"] = 146,["419"] = 146,["420"] = 143,["421"] = 143,["422"] = 148,["423"] = 148,["424"] = 148,["425"] = 148,["426"] = 143,["427"] = 143,["428"] = 150,["429"] = 150,["430"] = 150,["431"] = 150,["432"] = 143,["433"] = 143,["434"] = 152,["435"] = 152,["436"] = 152,["437"] = 152,["438"] = 143,["439"] = 143,["440"] = 154,["441"] = 154,["442"] = 154,["443"] = 154,["444"] = 143,["445"] = 143,["446"] = 143,["447"] = 137,["448"] = 136,["449"] = 134,["450"] = 133,["451"] = 160,["452"] = 160,["453"] = 160,["454"] = 160,["455"] = 160,["456"] = 160,["457"] = 161,["458"] = 161,["459"] = 161,["460"] = 161,["461"] = 164,["462"] = 164,["463"] = 164,["464"] = 164,["465"] = 164,["466"] = 164,["467"] = 164,["468"] = 161,["469"] = 161,["470"] = 169,["471"] = 169,["472"] = 169,["473"] = 169,["474"] = 169,["475"] = 169,["476"] = 169,["477"] = 161,["478"] = 161,["479"] = 160,["480"] = 133,["481"] = 130,["482"] = 179,["483"] = 179,["484"] = 180,["485"] = 180,["486"] = 180,["487"] = 180,["488"] = 180,["489"] = 180,["490"] = 180,["491"] = 180,["492"] = 180,["493"] = 183,["494"] = 183,["495"] = 183,["496"] = 183,["497"] = 183,["498"] = 183,["499"] = 183,["500"] = 183,["501"] = 184,["502"] = 184,["503"] = 184,["504"] = 184,["505"] = 188,["506"] = 188,["507"] = 188,["508"] = 188,["509"] = 188,["510"] = 188,["511"] = 188,["512"] = 188,["513"] = 188,["514"] = 188,["515"] = 188,["516"] = 188,["517"] = 188,["518"] = 188,["519"] = 184,["520"] = 184,["521"] = 184,["522"] = 184,["523"] = 183,["524"] = 200,["525"] = 200,["526"] = 200,["527"] = 200,["528"] = 200,["529"] = 200,["530"] = 200,["531"] = 183,["532"] = 183,["533"] = 180,["534"] = 179,["535"] = 209,["536"] = 209,["537"] = 209,["538"] = 209,["539"] = 209,["540"] = 209,["541"] = 209,["542"] = 209,["543"] = 209,["544"] = 209,["545"] = 209,["546"] = 209,["547"] = 209,["548"] = 179,["549"] = 130,["550"] = 220,["551"] = 220,["552"] = 220,["553"] = 220,["554"] = 220,["555"] = 220,["556"] = 220,["557"] = 220,["558"] = 220,["559"] = 221,["560"] = 220,["561"] = 220,["562"] = 130,["563"] = 225,["564"] = 225,["565"] = 225,["566"] = 225,["567"] = 225,["568"] = 225,["569"] = 225,["570"] = 225,["571"] = 225,["572"] = 225,["573"] = 228,["574"] = 228,["575"] = 228,["576"] = 228,["577"] = 228,["578"] = 228,["579"] = 229,["580"] = 229,["581"] = 230,["582"] = 230,["583"] = 230,["584"] = 229,["585"] = 231,["586"] = 231,["587"] = 231,["588"] = 232,["589"] = 233,["590"] = 234,["591"] = 235,["592"] = 236,["593"] = 238,["594"] = 239,["596"] = 239,["597"] = 239,["599"] = 239,["600"] = 241,["602"] = 244,["603"] = 245,["604"] = 246,["606"] = 248,["607"] = 249,["608"] = 250,["609"] = 251,["611"] = 254,["612"] = 255,["613"] = 256,["614"] = 258,["615"] = 259,["616"] = 261,["618"] = 263,["620"] = 266,["621"] = 267,["622"] = 268,["623"] = 269,["624"] = 270,["625"] = 271,["627"] = 273,["628"] = 274,["632"] = 279,["633"] = 280,["634"] = 280,["635"] = 280,["636"] = 280,["637"] = 281,["638"] = 282,["639"] = 283,["640"] = 286,["641"] = 287,["642"] = 288,["644"] = 289,["645"] = 290,["646"] = 291,["648"] = 293,["649"] = 294,["651"] = 296,["656"] = 299,["657"] = 300,["658"] = 300,["659"] = 300,["660"] = 299,["661"] = 301,["662"] = 301,["663"] = 301,["664"] = 301,["665"] = 303,["666"] = 304,["667"] = 305,["668"] = 306,["669"] = 308,["670"] = 309,["672"] = 313,["673"] = 313,["674"] = 313,["675"] = 313,["676"] = 316,["677"] = 231,["678"] = 229,["679"] = 228,["680"] = 225,["681"] = 325,["682"] = 325,["683"] = 328,["684"] = 328,["685"] = 329,["686"] = 329,["687"] = 330,["688"] = 330,["689"] = 330,["690"] = 332,["691"] = 332,["692"] = 333,["693"] = 333,["694"] = 333,["695"] = 332,["696"] = 330,["697"] = 329,["698"] = 336,["699"] = 336,["700"] = 336,["701"] = 338,["702"] = 338,["703"] = 339,["704"] = 339,["705"] = 339,["706"] = 338,["707"] = 336,["708"] = 329,["709"] = 342,["710"] = 342,["711"] = 342,["712"] = 342,["713"] = 342,["714"] = 342,["715"] = 344,["716"] = 344,["717"] = 345,["718"] = 345,["719"] = 345,["720"] = 344,["721"] = 342,["722"] = 342,["723"] = 329,["724"] = 348,["725"] = 348,["726"] = 348,["727"] = 348,["728"] = 348,["729"] = 348,["730"] = 350,["731"] = 350,["732"] = 351,["733"] = 351,["734"] = 351,["735"] = 350,["736"] = 348,["737"] = 348,["738"] = 329,["739"] = 328,["740"] = 325,["741"] = 358,["742"] = 358,["743"] = 359,["744"] = 359,["745"] = 359,["746"] = 359,["747"] = 358,["748"] = 325,["749"] = 366,["750"] = 366,["751"] = 367,["752"] = 367,["753"] = 368,["754"] = 368,["755"] = 368,["756"] = 368,["757"] = 368,["758"] = 370,["759"] = 370,["760"] = 370,["761"] = 370,["762"] = 368,["763"] = 368,["764"] = 367,["765"] = 375,["766"] = 375,["767"] = 375,["768"] = 377,["769"] = 377,["770"] = 377,["771"] = 377,["772"] = 375,["773"] = 367,["774"] = 366,["775"] = 325,["776"] = 386,["777"] = 386,["778"] = 386,["779"] = 386,["780"] = 386,["781"] = 386,["782"] = 386,["783"] = 386,["784"] = 386,["785"] = 386,["786"] = 386,["787"] = 386,["788"] = 386,["789"] = 387,["790"] = 387,["791"] = 388,["792"] = 388,["793"] = 388,["794"] = 390,["795"] = 390,["796"] = 390,["797"] = 390,["798"] = 390,["799"] = 388,["800"] = 387,["801"] = 397,["802"] = 397,["803"] = 397,["804"] = 399,["805"] = 399,["806"] = 399,["807"] = 399,["808"] = 399,["809"] = 397,["810"] = 387,["811"] = 406,["812"] = 406,["813"] = 406,["814"] = 408,["815"] = 408,["816"] = 408,["817"] = 408,["818"] = 408,["819"] = 406,["820"] = 387,["821"] = 414,["822"] = 414,["823"] = 414,["824"] = 416,["825"] = 416,["826"] = 416,["827"] = 416,["828"] = 414,["829"] = 387,["830"] = 386,["831"] = 422,["832"] = 422,["833"] = 423,["834"] = 423,["835"] = 423,["836"] = 423,["837"] = 423,["838"] = 423,["839"] = 423,["840"] = 426,["841"] = 426,["842"] = 426,["843"] = 426,["844"] = 423,["845"] = 423,["846"] = 428,["847"] = 428,["848"] = 428,["849"] = 428,["850"] = 423,["851"] = 423,["852"] = 430,["853"] = 430,["854"] = 430,["855"] = 430,["856"] = 423,["857"] = 423,["858"] = 432,["859"] = 432,["860"] = 432,["861"] = 432,["862"] = 423,["863"] = 423,["864"] = 434,["865"] = 434,["866"] = 434,["867"] = 434,["868"] = 423,["869"] = 423,["870"] = 422,["871"] = 386,["872"] = 386,["873"] = 325,["874"] = 225,["875"] = 449,["876"] = 449,["877"] = 452,["878"] = 452,["879"] = 452,["880"] = 453,["881"] = 454,["882"] = 452,["883"] = 452,["884"] = 452,["885"] = 452,["886"] = 457,["887"] = 457,["888"] = 459,["889"] = 459,["890"] = 462,["891"] = 462,["892"] = 462,["893"] = 459,["894"] = 464,["895"] = 464,["896"] = 466,["897"] = 466,["898"] = 466,["899"] = 466,["900"] = 466,["901"] = 466,["902"] = 466,["903"] = 464,["904"] = 468,["905"] = 468,["906"] = 468,["907"] = 468,["908"] = 468,["909"] = 468,["910"] = 468,["911"] = 468,["912"] = 468,["913"] = 468,["914"] = 468,["915"] = 464,["916"] = 459,["917"] = 457,["918"] = 472,["919"] = 472,["920"] = 473,["921"] = 473,["922"] = 474,["923"] = 474,["924"] = 474,["925"] = 474,["926"] = 474,["927"] = 474,["928"] = 474,["929"] = 473,["930"] = 475,["931"] = 475,["932"] = 475,["933"] = 475,["934"] = 475,["935"] = 475,["936"] = 475,["937"] = 473,["938"] = 473,["939"] = 472,["940"] = 479,["941"] = 479,["942"] = 479,["943"] = 472,["944"] = 480,["945"] = 480,["946"] = 480,["947"] = 481,["948"] = 482,["949"] = 480,["950"] = 480,["951"] = 480,["952"] = 480,["953"] = 480,["954"] = 472,["955"] = 457,["956"] = 452,["957"] = 449,["958"] = 490,["959"] = 490,["960"] = 490,["961"] = 490,["962"] = 490,["963"] = 490,["964"] = 490,["965"] = 490,["966"] = 493,["967"] = 493,["968"] = 494,["969"] = 494,["970"] = 495,["971"] = 495,["972"] = 495,["973"] = 495,["974"] = 495,["975"] = 495,["976"] = 495,["977"] = 494,["978"] = 496,["979"] = 496,["980"] = 496,["981"] = 496,["982"] = 496,["983"] = 496,["984"] = 496,["985"] = 494,["986"] = 494,["987"] = 493,["988"] = 500,["989"] = 500,["990"] = 500,["991"] = 500,["992"] = 500,["993"] = 502,["994"] = 503,["995"] = 503,["996"] = 504,["997"] = 505,["998"] = 506,["1000"] = 508,["1001"] = 509,["1002"] = 511,["1003"] = 500,["1004"] = 500,["1005"] = 500,["1006"] = 500,["1007"] = 500,["1008"] = 500,["1009"] = 493,["1010"] = 513,["1011"] = 513,["1012"] = 513,["1013"] = 514,["1014"] = 515,["1015"] = 513,["1016"] = 513,["1017"] = 513,["1018"] = 513,["1019"] = 513,["1020"] = 493,["1021"] = 490,["1022"] = 522,["1023"] = 522,["1024"] = 526,["1025"] = 526,["1026"] = 526,["1027"] = 522,["1028"] = 528,["1029"] = 528,["1030"] = 531,["1031"] = 531,["1032"] = 531,["1033"] = 532,["1034"] = 533,["1035"] = 534,["1037"] = 536,["1038"] = 531,["1039"] = 531,["1040"] = 531,["1041"] = 531,["1042"] = 531,["1043"] = 528,["1044"] = 540,["1045"] = 540,["1046"] = 540,["1047"] = 540,["1048"] = 540,["1049"] = 540,["1050"] = 540,["1051"] = 540,["1052"] = 540,["1053"] = 540,["1054"] = 540,["1055"] = 540,["1056"] = 540,["1057"] = 540,["1058"] = 540,["1059"] = 540,["1060"] = 540,["1061"] = 528,["1062"] = 542,["1063"] = 542,["1064"] = 542,["1065"] = 542,["1066"] = 528,["1067"] = 522,["1068"] = 490,["1069"] = 490,["1070"] = 449,["1071"] = 550,["1072"] = 550,["1073"] = 550,["1074"] = 551,["1075"] = 550,["1076"] = 550,["1077"] = 550,["1078"] = 550,["1079"] = 553,["1080"] = 553,["1081"] = 553,["1082"] = 553,["1083"] = 553,["1084"] = 557,["1085"] = 557,["1086"] = 557,["1087"] = 557,["1088"] = 553,["1089"] = 550,["1090"] = 449,["1091"] = 563,["1092"] = 563,["1093"] = 563,["1094"] = 563,["1095"] = 563,["1096"] = 563,["1097"] = 563,["1098"] = 449,["1099"] = 566,["1100"] = 566,["1101"] = 566,["1102"] = 566,["1103"] = 566,["1104"] = 566,["1105"] = 569,["1106"] = 569,["1107"] = 572,["1108"] = 572,["1109"] = 576,["1110"] = 576,["1111"] = 576,["1112"] = 572,["1113"] = 578,["1114"] = 578,["1115"] = 580,["1116"] = 580,["1117"] = 580,["1118"] = 580,["1119"] = 580,["1120"] = 580,["1121"] = 580,["1122"] = 580,["1123"] = 580,["1124"] = 580,["1125"] = 580,["1126"] = 580,["1127"] = 580,["1128"] = 580,["1129"] = 580,["1130"] = 580,["1131"] = 580,["1132"] = 578,["1133"] = 582,["1134"] = 582,["1135"] = 582,["1136"] = 582,["1137"] = 578,["1138"] = 572,["1139"] = 569,["1140"] = 609,["1141"] = 609,["1142"] = 610,["1143"] = 610,["1144"] = 611,["1145"] = 611,["1146"] = 611,["1147"] = 611,["1148"] = 611,["1149"] = 611,["1150"] = 611,["1151"] = 610,["1152"] = 612,["1153"] = 612,["1154"] = 612,["1155"] = 612,["1156"] = 612,["1157"] = 612,["1158"] = 612,["1159"] = 610,["1160"] = 610,["1161"] = 609,["1162"] = 616,["1163"] = 616,["1164"] = 616,["1165"] = 609,["1166"] = 569,["1167"] = 566,["1168"] = 449,["1169"] = 225,["1170"] = 624,["1171"] = 624,["1172"] = 624,["1173"] = 624,["1174"] = 624,["1175"] = 624,["1176"] = 624,["1177"] = 624,["1178"] = 627,["1179"] = 627,["1180"] = 627,["1181"] = 630,["1182"] = 630,["1183"] = 630,["1184"] = 630,["1185"] = 630,["1186"] = 630,["1187"] = 630,["1188"] = 630,["1189"] = 630,["1190"] = 630,["1191"] = 630,["1192"] = 627,["1193"] = 624,["1194"] = 637,["1195"] = 637,["1196"] = 638,["1197"] = 638,["1198"] = 639,["1199"] = 639,["1200"] = 639,["1201"] = 639,["1202"] = 639,["1203"] = 639,["1204"] = 639,["1205"] = 638,["1206"] = 640,["1207"] = 640,["1208"] = 640,["1209"] = 640,["1210"] = 640,["1211"] = 640,["1212"] = 640,["1213"] = 638,["1214"] = 638,["1215"] = 637,["1216"] = 644,["1217"] = 644,["1218"] = 644,["1219"] = 637,["1220"] = 645,["1221"] = 645,["1222"] = 645,["1223"] = 645,["1224"] = 645,["1225"] = 645,["1226"] = 645,["1227"] = 637,["1228"] = 624,["1229"] = 624,["1230"] = 225,["1231"] = 652,["1232"] = 652,["1233"] = 652,["1234"] = 652,["1235"] = 652,["1236"] = 652,["1237"] = 652,["1238"] = 652,["1239"] = 656,["1240"] = 656,["1241"] = 657,["1242"] = 657,["1243"] = 657,["1244"] = 656,["1245"] = 662,["1246"] = 662,["1247"] = 662,["1248"] = 662,["1249"] = 662,["1250"] = 662,["1251"] = 664,["1252"] = 664,["1253"] = 664,["1254"] = 662,["1255"] = 656,["1256"] = 652,["1257"] = 670,["1258"] = 670,["1259"] = 670,["1260"] = 673,["1261"] = 673,["1262"] = 673,["1263"] = 673,["1264"] = 673,["1265"] = 673,["1266"] = 673,["1267"] = 673,["1268"] = 673,["1269"] = 673,["1270"] = 673,["1271"] = 670,["1272"] = 652,["1273"] = 652,["1274"] = 225,["1275"] = 225,["1276"] = 130,["1277"] = 128,["1278"] = 128,["1279"] = 127,["1280"] = 686,["1281"] = 688,["1282"] = 689,["1283"] = 690,["1284"] = 691,["1285"] = 692,["1286"] = 693,["1287"] = 694,["1288"] = 695,["1289"] = 696,["1290"] = 697,["1291"] = 699,["1292"] = 700,["1293"] = 701,["1294"] = 702,["1295"] = 686});
local ____exports = {}
local ____BehaveTree = include("framework.ai.BehaveTree")
local _____670D_52A1 = ____BehaveTree["服务"]
local _____9009_62E9 = ____BehaveTree["选择"]
local _____9ED1_677F_6761_4EF6 = ____BehaveTree["黑板条件"]
local _____64CD_4F5C = ____BehaveTree["操作"]
local _____505C_6B62_89C4_5219 = ____BehaveTree["停止规则"]
local _____6267_884C = ____BehaveTree["执行"]
local _____5E73_884C_6267_884C = ____BehaveTree["平行执行"]
local _____5E73_884C_7B56_7565 = ____BehaveTree["平行策略"]
local _____7B49_5F85_505C_6B62 = ____BehaveTree["等待停止"]
local _____987A_5E8F_6267_884C = ____BehaveTree["顺序执行"]
local _____968F_673A_9009_62E9 = ____BehaveTree["随机选择"]
local _____7B49_5F85 = ____BehaveTree["等待"]
local _____968F_673A = ____BehaveTree["随机"]
local _____6761_4EF6 = ____BehaveTree["条件"]
local _____603B_662F_6210_529F = ____BehaveTree["总是成功"]
local ____DataManager = include("framework.data.DataManager")
local datas = ____DataManager.datas
local writeableDatas = ____DataManager.writeableDatas
local ____Random = include("framework.utils.Random")
local random = ____Random.random
local ____Archive = include("logic.archive.Archive")
local archive = ____Archive.archive
local ____BudgetConfig = include("logic.configs.BudgetConfig")
local budgetConfigMap = ____BudgetConfig.budgetConfigMap
local ____MercenaryConfig = include("logic.configs.MercenaryConfig")
local mercenaryConfigList = ____MercenaryConfig.mercenaryConfigList
local ____RobotLevelConfig = include("logic.configs.RobotLevelConfig")
local robotLevelConfigMap = ____RobotLevelConfig.robotLevelConfigMap
local ____MercenaryController = include("logic.controllers.MercenaryController")
local mercenaryController = ____MercenaryController.mercenaryController
local ____BobInfo = include("logic.match.BobInfo")
local isPvpModeRobot = ____BobInfo.isPvpModeRobot
local ____BigBlessData = include("logic.models.BigBlessData")
local BigBlessData = ____BigBlessData.BigBlessData
local ____GameData = include("logic.models.GameData")
local GameData = ____GameData.GameData
local ____PlayerData = include("logic.models.PlayerData")
local PlayerData = ____PlayerData.PlayerData
local ____PlayerGenreData = include("logic.models.PlayerGenreData")
local PlayerGenreData = ____PlayerGenreData.PlayerGenreData
local ____PlayerUtils = include("logic.utils.PlayerUtils")
local player2King = ____PlayerUtils.player2King
local playerIdList = ____PlayerUtils.playerIdList
local ____BlackboardEnum = include("logic.ai.BlackboardEnum")
local BlackboardEnum = ____BlackboardEnum.BlackboardEnum
local ____PlayerBehaveTreeBase = include("logic.ai.PlayerBehaveTreeBase")
local PlayerBehaveTreeBase = ____PlayerBehaveTreeBase.PlayerBehaveTreeBase
local ____needSelAuction = include("logic.ai.decorator.auction.needSelAuction")
local needSelAuction = ____needSelAuction.needSelAuction
local ____isFirstSelBless = include("logic.ai.decorator.bless.isFirstSelBless")
local isFirstSelBless = ____isFirstSelBless.isFirstSelBless
local ____needSelBless = include("logic.ai.decorator.bless.needSelBless")
local needSelBless = ____needSelBless.needSelBless
local ____cardPoolLeft = include("logic.ai.decorator.card.cardPoolLeft")
local cardPoolLeft = ____cardPoolLeft.cardPoolLeft
local ____checkAverageGold = include("logic.ai.decorator.card.checkAverageGold")
local checkAverageGold = ____checkAverageGold.checkAverageGold
local ____hasCardInPool = include("logic.ai.decorator.card.hasCardInPool")
local hasCardInPool = ____hasCardInPool.hasCardInPool
local ____checkGenreType = include("logic.ai.decorator.hero.checkGenreType")
local checkGenreType = ____checkGenreType.checkGenreType
local ____checkMercenaryCount = include("logic.ai.decorator.mercenary.checkMercenaryCount")
local checkMercenaryCount = ____checkMercenaryCount.checkMercenaryCount
local ____needSelTalent = include("logic.ai.decorator.talent.needSelTalent")
local needSelTalent = ____needSelTalent.needSelTalent
local ____bidAuction = include("logic.ai.task.auction.bidAuction")
local bidAuction = ____bidAuction.bidAuction
local ____refreshBless = include("logic.ai.task.bless.refreshBless")
local refreshBless = ____refreshBless.refreshBless
local ____selBless = include("logic.ai.task.bless.selBless")
local selBless = ____selBless.selBless
local ____buyCard = include("logic.ai.task.card.buyCard")
local buyCard = ____buyCard.buyCard
local ____lockCardPool = include("logic.ai.task.card.lockCardPool")
local lockCardPool = ____lockCardPool.lockCardPool
local ____refreshCardPool = include("logic.ai.task.card.refreshCardPool")
local refreshCardPool = ____refreshCardPool.refreshCardPool
local ____unlockCardPool = include("logic.ai.task.card.unlockCardPool")
local unlockCardPool = ____unlockCardPool.unlockCardPool
local ____cancelSelHero = include("logic.ai.task.hero.cancelSelHero")
local cancelSelHero = ____cancelSelHero.cancelSelHero
local ____readyHero = include("logic.ai.task.hero.readyHero")
local readyHero = ____readyHero.readyHero
local ____refreshHeroPool = include("logic.ai.task.hero.refreshHeroPool")
local refreshHeroPool = ____refreshHeroPool.refreshHeroPool
local ____selHero = include("logic.ai.task.hero.selHero")
local selHero = ____selHero.selHero
local ____selectKOFSeat = include("logic.ai.task.kof.selectKOFSeat")
local selectKOFSeat = ____selectKOFSeat.selectKOFSeat
local ____createMercenary = include("logic.ai.task.mercenary.createMercenary")
local createMercenary = ____createMercenary.createMercenary
local ____movePetToBigBless = include("logic.ai.task.pet.movePetToBigBless")
local movePetToBigBless = ____movePetToBigBless.movePetToBigBless
local ____petAttack = include("logic.ai.task.pet.petAttack")
local petAttack = ____petAttack.petAttack
local ____randomMovePet = include("logic.ai.task.pet.randomMovePet")
local randomMovePet = ____randomMovePet.randomMovePet
local ____sendPetToHero = include("logic.ai.task.pet.sendPetToHero")
local sendPetToHero = ____sendPetToHero.sendPetToHero
local ____sendPetToImage = include("logic.ai.task.pet.sendPetToImage")
local sendPetToImage = ____sendPetToImage.sendPetToImage
local ____sendPetToTeammate = include("logic.ai.task.pet.sendPetToTeammate")
local sendPetToTeammate = ____sendPetToTeammate.sendPetToTeammate
local ____selTalent = include("logic.ai.task.talent.selTalent")
local selTalent = ____selTalent.selTalent
local ____upgradeTech = include("logic.ai.task.tech.upgradeTech")
local upgradeTech = ____upgradeTech.upgradeTech
--- 如果卡池中有推荐的流派卡，则购买，如果买不起则锁定。
-- 如果卡池中没有推荐的流派卡，且卡池已经接近枯竭，则直接随机购买。
local function commonBuyCard(self)
    return _____9009_62E9(
        nil,
        hasCardInPool(
            self,
            {playerGenre = true},
            _____9009_62E9(
                nil,
                buyCard(self),
                lockCardPool(self)
            )
        ),
        cardPoolLeft(
            self,
            {percent = 0.2, lessThan = true},
            buyCard(self, {random = true})
        )
    )
end
local function commonBuyMercenary(self)
    local function logic()
        return _____9009_62E9(
            nil,
            _____9ED1_677F_6761_4EF6(
                nil,
                BlackboardEnum.readyLeftTime,
                _____64CD_4F5C["小于等于"],
                10,
                _____505C_6B62_89C4_5219["自己"],
                _____603B_662F_6210_529F(
                    nil,
                    _____9009_62E9(
                        nil,
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            1,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "攻攻",
                                createMercenary(self, {filterByProbability = 0.5, orderByCheap = 1, heightOnly = true})
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            1,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "攻防",
                                createMercenary(self, {filterByProbability = 0.3, orderByCheap = 1, heightOnly = true})
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            1,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "防防",
                                createMercenary(self, {filterByProbability = 0.1, orderByCheap = 1, heightOnly = true})
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            2,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "攻攻",
                                createMercenary(self, {filterByProbability = 0.8, orderByCheap = 1, heightOnly = true})
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            2,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "攻防",
                                createMercenary(self, {filterByProbability = 0.7, orderByCheap = 1, heightOnly = true})
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.heroHurtDistance,
                            _____64CD_4F5C["等于"],
                            2,
                            _____505C_6B62_89C4_5219["自己"],
                            checkGenreType(
                                self,
                                "防防",
                                createMercenary(self, {filterByProbability = 0.3, orderByCheap = 1, heightOnly = true})
                            )
                        )
                    )
                )
            ),
            _____9009_62E9(
                nil,
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    1,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "攻攻",
                        createMercenary(self, {filterByProbability = 0.5, orderByCheap = 1})
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    1,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "攻防",
                        createMercenary(self, {filterByProbability = 0.3, orderByCheap = 1})
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    1,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "防防",
                        createMercenary(self, {filterByProbability = 0.1, orderByCheap = 1})
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    2,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "攻攻",
                        createMercenary(self, {filterByProbability = 0.8, orderByCheap = 1})
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    2,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "攻防",
                        createMercenary(self, {filterByProbability = 0.7, orderByCheap = 1})
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.heroHurtDistance,
                    _____64CD_4F5C["等于"],
                    2,
                    _____505C_6B62_89C4_5219["自己"],
                    checkGenreType(
                        self,
                        "防防",
                        createMercenary(self, {filterByProbability = 0.3, orderByCheap = 1})
                    )
                )
            )
        )
    end
    return _____9ED1_677F_6761_4EF6(
        nil,
        BlackboardEnum.gameStage,
        _____64CD_4F5C["等于"],
        2,
        _____505C_6B62_89C4_5219["自己"],
        _____9009_62E9(
            nil,
            _____9ED1_677F_6761_4EF6(
                nil,
                BlackboardEnum.heroId,
                _____64CD_4F5C["等于"],
                27,
                _____505C_6B62_89C4_5219["自己"],
                _____9009_62E9(
                    nil,
                    checkMercenaryCount(
                        self,
                        {count = 10},
                        logic(nil)
                    ),
                    _____9ED1_677F_6761_4EF6(
                        nil,
                        BlackboardEnum.heroHurtDistance,
                        _____64CD_4F5C["等于"],
                        1,
                        _____505C_6B62_89C4_5219["自己"],
                        checkGenreType(
                            self,
                            "攻防",
                            createMercenary(self, {filterByProbability = 0.3, orderByCheap = 0})
                        )
                    )
                )
            ),
            logic(nil)
        )
    )
end
local function randomMovePetList(self)
    return _____987A_5E8F_6267_884C(
        nil,
        _____7B49_5F85(nil, 0.5, 0.8),
        randomMovePet(self, {angleRange = 180}),
        _____7B49_5F85(nil, 0.25),
        randomMovePet(self, {angleRange = 180}),
        _____7B49_5F85(nil, 0.25),
        randomMovePet(self, {angleRange = 90}),
        _____7B49_5F85(nil, 0.25),
        randomMovePet(self, {angleRange = 90}),
        _____968F_673A(
            nil,
            0.5,
            _____987A_5E8F_6267_884C(
                nil,
                _____7B49_5F85(nil, 0.25),
                randomMovePet(self, {angleRange = 180}),
                _____7B49_5F85(nil, 0.25),
                randomMovePet(self, {angleRange = 180}),
                _____7B49_5F85(nil, 0.25),
                randomMovePet(self, {angleRange = 90})
            )
        )
    )
end
____exports.SimplePlayerBehaveTree = __TS__Class()
local SimplePlayerBehaveTree = ____exports.SimplePlayerBehaveTree
SimplePlayerBehaveTree.name = "SimplePlayerBehaveTree"
__TS__ClassExtends(SimplePlayerBehaveTree, PlayerBehaveTreeBase)
function SimplePlayerBehaveTree.prototype.initTree(self)
    return _____670D_52A1(
        nil,
        2,
        1,
        function()
        end,
        _____9009_62E9(
            nil,
            _____9009_62E9(
                nil,
                _____6761_4EF6(
                    nil,
                    function()
                        local ____opt_0 = datas.players[self.playerId]:getSingle(PlayerData)
                        return (____opt_0 and ____opt_0.isSimpleAI) ~= true
                    end,
                    _____505C_6B62_89C4_5219["无"],
                    nil,
                    nil,
                    _____9ED1_677F_6761_4EF6(
                        nil,
                        BlackboardEnum.gameStage,
                        _____64CD_4F5C["等于"],
                        0,
                        _____505C_6B62_89C4_5219["自己"],
                        _____5E73_884C_6267_884C(
                            nil,
                            _____5E73_884C_7B56_7565["全部"],
                            _____5E73_884C_7B56_7565["全部"],
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 3, 15),
                                movePetToBigBless(self, {}),
                                _____7B49_5F85(nil, 30)
                            ),
                            _____968F_673A(
                                nil,
                                0.2,
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    petAttack(self, {}),
                                    _____7B49_5F85(nil, 0.25, 0.5),
                                    _____968F_673A(
                                        nil,
                                        0.8,
                                        petAttack(self, {})
                                    ),
                                    _____7B49_5F85(nil, 0.25, 0.5),
                                    _____968F_673A(
                                        nil,
                                        0.5,
                                        petAttack(self, {})
                                    ),
                                    _____7B49_5F85(nil, 0.25, 0.5),
                                    _____968F_673A(
                                        nil,
                                        0.3,
                                        petAttack(self, {})
                                    ),
                                    _____7B49_5F85(nil, 0.25, 0.5),
                                    _____968F_673A(
                                        nil,
                                        0.1,
                                        petAttack(self, {})
                                    ),
                                    _____7B49_5F85(nil, 0.25, 0.5),
                                    _____968F_673A(
                                        nil,
                                        0.05,
                                        petAttack(self, {})
                                    ),
                                    _____7B49_5F85(nil, 30)
                                )
                            )
                        )
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.gameStage,
                    _____64CD_4F5C["等于"],
                    0,
                    _____505C_6B62_89C4_5219["自己"],
                    _____987A_5E8F_6267_884C(
                        nil,
                        movePetToBigBless(self, {}),
                        _____7B49_5F85(nil, 6),
                        _____603B_662F_6210_529F(
                            nil,
                            _____968F_673A(
                                nil,
                                0.5,
                                movePetToBigBless(self, {})
                            )
                        ),
                        _____7B49_5F85(nil, 3),
                        _____603B_662F_6210_529F(
                            nil,
                            _____968F_673A(
                                nil,
                                0.5,
                                movePetToBigBless(self, {})
                            )
                        ),
                        _____7B49_5F85(nil, 20)
                    )
                )
            ),
            _____9009_62E9(
                nil,
                _____6761_4EF6(
                    nil,
                    function()
                        local ____opt_2 = datas.players[self.playerId]:getSingle(PlayerData)
                        return (____opt_2 and ____opt_2.isSimpleAI) ~= true
                    end,
                    _____505C_6B62_89C4_5219["无"],
                    nil,
                    nil,
                    _____9ED1_677F_6761_4EF6(
                        nil,
                        BlackboardEnum.gameStage,
                        _____64CD_4F5C["等于"],
                        1,
                        _____505C_6B62_89C4_5219["自己"],
                        _____968F_673A_9009_62E9(
                            nil,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 5, 15),
                                selHero(self),
                                _____603B_662F_6210_529F(
                                    nil,
                                    _____968F_673A(
                                        nil,
                                        0.4,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            _____7B49_5F85(nil, 0.25, 5),
                                            cancelSelHero(self, {}),
                                            refreshHeroPool(self),
                                            _____7B49_5F85(nil, 0.25, 2),
                                            selHero(self, {lowerTeammateHeroWeight = true})
                                        )
                                    )
                                ),
                                _____7B49_5F85(nil, 0.25, 5),
                                readyHero(self, {}),
                                _____7B49_5F85_505C_6B62(nil)
                            ),
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 11, 20),
                                selHero(self, {lowerTeammateHeroWeight = true}),
                                _____7B49_5F85(nil, 0.25, 1),
                                readyHero(self, {}),
                                _____7B49_5F85_505C_6B62(nil)
                            )
                        )
                    )
                ),
                _____9ED1_677F_6761_4EF6(
                    nil,
                    BlackboardEnum.gameStage,
                    _____64CD_4F5C["等于"],
                    1,
                    _____505C_6B62_89C4_5219["自己"],
                    _____987A_5E8F_6267_884C(
                        nil,
                        _____7B49_5F85(nil, 0.25, 2),
                        selHero(self, {lowerTeammateHeroWeight = true}),
                        readyHero(self, {}),
                        _____7B49_5F85_505C_6B62(nil)
                    )
                )
            ),
            _____9ED1_677F_6761_4EF6(
                nil,
                BlackboardEnum.gameStage,
                _____64CD_4F5C["等于"],
                4,
                _____505C_6B62_89C4_5219["自己"],
                _____6267_884C(
                    nil,
                    function()
                        self:log(function() return "游戏结束" end)
                    end
                )
            ),
            _____9ED1_677F_6761_4EF6(
                nil,
                BlackboardEnum.gameStage,
                _____64CD_4F5C["大于"],
                1,
                _____505C_6B62_89C4_5219["自己"],
                _____5E73_884C_6267_884C(
                    nil,
                    _____5E73_884C_7B56_7565["全部"],
                    _____5E73_884C_7B56_7565["全部"],
                    _____6761_4EF6(
                        nil,
                        function() return self.blackboard:Get(BlackboardEnum.resetBudgetLevel) < self.blackboard:Get(BlackboardEnum.gameLevel) end,
                        _____505C_6B62_89C4_5219["自己"],
                        nil,
                        nil,
                        _____987A_5E8F_6267_884C(
                            nil,
                            _____603B_662F_6210_529F(
                                nil,
                                unlockCardPool(self)
                            ),
                            _____6267_884C(
                                nil,
                                function()
                                    local playerData = datas.players[self.playerId]:getSingle(PlayerData)
                                    local gameData = datas.global:getSingle(GameData)
                                    local budget = budgetConfigMap[self.blackboard:Get(BlackboardEnum.gameLevel)]
                                    local gameMode = self.blackboard:Get(BlackboardEnum.gameMode)
                                    local result = budget.wood
                                    local bigBlessData = datas.global:getSingle(BigBlessData)
                                    local ____temp_8 = gameData.level >= 3
                                    if ____temp_8 then
                                        local ____opt_4 = bigBlessData and bigBlessData.bigBless
                                        ____temp_8 = (____opt_4 and ____opt_4.id) == 17
                                    end
                                    if ____temp_8 then
                                        result = result + random:randomRange(0, 800)
                                    end
                                    if gameData.randomEventType ~= 0 then
                                        self:log(function() return "事件预算" .. tostring(budget.eventAdd) end)
                                        result = result + budget.eventAdd
                                    end
                                    if gameMode == 1 then
                                        result = result + playerData.monsterBreakCount * budget.breakThrough
                                    elseif gameMode == 2 then
                                        result = result + playerData.eliteMonsterBreakCount * budget.breakThrough
                                    end
                                    if playerData.isSimpleAI then
                                        local p = 0
                                        if playerData.simpleAIType == "easy" then
                                            p = 0.3
                                        elseif playerData.simpleAIType == "hard" then
                                            p = 1
                                        end
                                        result = math.floor(result * p)
                                    end
                                    if isPvpModeRobot(nil) then
                                        local config = robotLevelConfigMap[archive.playerData.singleModeChooseLevel]
                                        if config ~= nil then
                                            if self.playerId <= 4 then
                                                result = math.floor(result * (1 - config.ourMistake))
                                                self:log(function() return "我方AI预算乘以系数 " .. tostring(1 - config.ourMistake) end)
                                            else
                                                result = math.floor(result * (1 - config.enemyMistake))
                                                self:log(function() return "敌方AI预算乘以系数 " .. tostring(1 - config.enemyMistake) end)
                                            end
                                        end
                                    end
                                    self.blackboard:Set(BlackboardEnum.woodBudget, result)
                                    self.blackboard:Set(
                                        BlackboardEnum.resetBudgetLevel,
                                        self.blackboard:Get(BlackboardEnum.gameLevel)
                                    )
                                    self.blackboard:Set(BlackboardEnum.woodConsume, 0)
                                    self.blackboard:Set(BlackboardEnum.levelupCount, 0)
                                    self:log(function() return "刷新预算 " .. tostring(result) end)
                                    local selfPlayers = {}
                                    local targetPlayers = {}
                                    for ____, playerId in ipairs(playerIdList) do
                                        do
                                            local playerData = datas.players[playerId]:getSingle(PlayerData)
                                            if playerData.behaveTree ~= nil then
                                                goto __continue29
                                            end
                                            if player2King[playerId] == player2King[self.playerId] then
                                                selfPlayers[#selfPlayers + 1] = playerData.level
                                            else
                                                targetPlayers[#targetPlayers + 1] = playerData.level
                                            end
                                        end
                                        ::__continue29::
                                    end
                                    local level = #selfPlayers == 0 and __TS__ArrayReduce(
                                        targetPlayers,
                                        function(____, a, b) return a + b end,
                                        0
                                    ) / #targetPlayers or __TS__ArrayReduce(
                                        selfPlayers,
                                        function(____, a, b) return a + b end,
                                        0
                                    ) / #selfPlayers
                                    local levelOffset = math.max(0, level - playerData.level)
                                    local playerGenreData = writeableDatas.players[self.playerId]:getOrCreateSingle(PlayerGenreData)
                                    local old = playerGenreData.weightChange
                                    playerGenreData.weightChange = levelOffset * 50
                                    if old ~= playerGenreData.weightChange then
                                        self:log(function() return "流派卡权重改变 " .. tostring(playerGenreData.weightChange) end)
                                    end
                                    local list = __TS__ArrayFilter(
                                        mercenaryConfigList,
                                        function(____, a) return not mercenaryController:isLocked(self.playerId, a.id) and not a.ban end
                                    )
                                    self.blackboard:Set(BlackboardEnum.mercenaryList, list)
                                end
                            )
                        )
                    ),
                    _____9009_62E9(
                        nil,
                        needSelAuction(
                            self,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____7B49_5F85(nil, 1, 5),
                                    _____968F_673A_9009_62E9(
                                        nil,
                                        _____603B_662F_6210_529F(
                                            nil,
                                            bidAuction(self, {strategy = "倍数", multiple = {0.5, 1.5}, random = {100, 200}})
                                        )
                                    )
                                ),
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____7B49_5F85(nil, 1, 5),
                                    _____968F_673A_9009_62E9(
                                        nil,
                                        _____603B_662F_6210_529F(
                                            nil,
                                            bidAuction(self, {strategy = "倍数", multiple = {0.5, 1.5}, random = {100, 200}})
                                        )
                                    )
                                ),
                                _____968F_673A(
                                    nil,
                                    0.3,
                                    _____987A_5E8F_6267_884C(
                                        nil,
                                        _____7B49_5F85(nil, 1, 5),
                                        _____968F_673A_9009_62E9(
                                            nil,
                                            _____603B_662F_6210_529F(
                                                nil,
                                                bidAuction(self, {strategy = "倍数", multiple = {0.5, 1.5}, random = {100, 200}})
                                            )
                                        )
                                    )
                                ),
                                _____968F_673A(
                                    nil,
                                    0.3,
                                    _____987A_5E8F_6267_884C(
                                        nil,
                                        _____7B49_5F85(nil, 1, 5),
                                        _____968F_673A_9009_62E9(
                                            nil,
                                            _____603B_662F_6210_529F(
                                                nil,
                                                bidAuction(self, {strategy = "倍数", multiple = {0.5, 1.5}, random = {100, 200}})
                                            )
                                        )
                                    )
                                )
                            )
                        ),
                        needSelTalent(
                            self,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 1, 2),
                                selTalent(self, nil)
                            )
                        ),
                        needSelBless(
                            self,
                            _____9009_62E9(
                                nil,
                                isFirstSelBless(
                                    self,
                                    _____987A_5E8F_6267_884C(
                                        nil,
                                        _____7B49_5F85(nil, 1, 2),
                                        _____9009_62E9(
                                            nil,
                                            selBless(self, nil),
                                            refreshBless(self)
                                        )
                                    )
                                ),
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____7B49_5F85(nil, 1, 2),
                                    _____9009_62E9(
                                        nil,
                                        selBless(self, {selByOldTag = true}),
                                        refreshBless(self)
                                    )
                                )
                            )
                        ),
                        _____6761_4EF6(
                            nil,
                            function()
                                local ____opt_9 = datas.players[self.playerId]:getSingle(PlayerData)
                                return (____opt_9 and ____opt_9.isSimpleAI) ~= true
                            end,
                            _____505C_6B62_89C4_5219["无"],
                            nil,
                            nil,
                            _____5E73_884C_6267_884C(
                                nil,
                                _____5E73_884C_7B56_7565["一个"],
                                _____5E73_884C_7B56_7565["全部"],
                                _____9009_62E9(
                                    nil,
                                    _____968F_673A(
                                        nil,
                                        0.05,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            sendPetToImage(self, {}),
                                            randomMovePetList(self),
                                            _____7B49_5F85(nil, 1, 2)
                                        )
                                    ),
                                    _____968F_673A(
                                        nil,
                                        0.05,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            sendPetToTeammate(self, {}),
                                            randomMovePetList(self),
                                            _____7B49_5F85(nil, 1, 2)
                                        )
                                    ),
                                    _____968F_673A(
                                        nil,
                                        0.05,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            sendPetToHero(self, {}),
                                            randomMovePetList(self),
                                            _____7B49_5F85(nil, 1, 2)
                                        )
                                    ),
                                    _____968F_673A(
                                        nil,
                                        0.1,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            randomMovePetList(self),
                                            _____7B49_5F85(nil, 1, 2)
                                        )
                                    )
                                ),
                                _____9009_62E9(
                                    nil,
                                    _____968F_673A(
                                        nil,
                                        0.1,
                                        _____987A_5E8F_6267_884C(
                                            nil,
                                            petAttack(self, {}),
                                            _____7B49_5F85(nil, 0.25, 0.5),
                                            _____968F_673A(
                                                nil,
                                                0.8,
                                                petAttack(self, {})
                                            ),
                                            _____7B49_5F85(nil, 0.25, 0.5),
                                            _____968F_673A(
                                                nil,
                                                0.5,
                                                petAttack(self, {})
                                            ),
                                            _____7B49_5F85(nil, 0.25, 0.5),
                                            _____968F_673A(
                                                nil,
                                                0.3,
                                                petAttack(self, {})
                                            ),
                                            _____7B49_5F85(nil, 0.25, 0.5),
                                            _____968F_673A(
                                                nil,
                                                0.1,
                                                petAttack(self, {})
                                            ),
                                            _____7B49_5F85(nil, 0.25, 0.5),
                                            _____968F_673A(
                                                nil,
                                                0.05,
                                                petAttack(self, {})
                                            )
                                        )
                                    )
                                )
                            )
                        )
                    ),
                    _____9009_62E9(
                        nil,
                        _____6761_4EF6(
                            nil,
                            function()
                                self:log(function() return ("游戏模式（" .. tostring(self.blackboard:Get(BlackboardEnum.gameMode))) .. "） 等于1 或 2" end)
                                return self.blackboard:Get(BlackboardEnum.gameMode) == 1 or self.blackboard:Get(BlackboardEnum.gameMode) == 2
                            end,
                            _____505C_6B62_89C4_5219["自己"],
                            nil,
                            nil,
                            _____9009_62E9(
                                nil,
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____603B_662F_6210_529F(
                                        nil,
                                        commonBuyCard(self)
                                    ),
                                    _____9009_62E9(
                                        nil,
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.gold,
                                            _____64CD_4F5C["大于等于"],
                                            1120,
                                            _____505C_6B62_89C4_5219["自己"],
                                            refreshCardPool(self)
                                        ),
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.gameLevel,
                                            _____64CD_4F5C["大于"],
                                            10,
                                            _____505C_6B62_89C4_5219["自己"],
                                            checkAverageGold(
                                                self,
                                                {},
                                                refreshCardPool(self)
                                            )
                                        )
                                    )
                                ),
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____9009_62E9(
                                        nil,
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            15,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 0.1, 1)
                                        ),
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            7,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 0.1, 0.5)
                                        ),
                                        _____7B49_5F85(nil, 0.25)
                                    ),
                                    _____603B_662F_6210_529F(
                                        nil,
                                        upgradeTech(self)
                                    ),
                                    _____6761_4EF6(
                                        nil,
                                        function()
                                            self:log(function() return ((((("剩余木头" .. tostring(self.blackboard:Get(BlackboardEnum.wood))) .. ">=30 且 消费(") .. tostring(self.blackboard:Get(BlackboardEnum.woodConsume))) .. ") < 预算(") .. tostring(self.blackboard:Get(BlackboardEnum.woodBudget))) .. ")" end)
                                            return self.blackboard:Get(BlackboardEnum.wood) >= 30 and self.blackboard:Get(BlackboardEnum.woodConsume) < self.blackboard:Get(BlackboardEnum.woodBudget)
                                        end,
                                        _____505C_6B62_89C4_5219["自己"],
                                        nil,
                                        nil,
                                        commonBuyMercenary(self)
                                    )
                                )
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.gameMode,
                            _____64CD_4F5C["等于"],
                            4,
                            _____505C_6B62_89C4_5219["自己"],
                            _____9009_62E9(
                                nil,
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____9009_62E9(
                                        nil,
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            15,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 0.1, 1)
                                        ),
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            7,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 0.1, 0.5)
                                        ),
                                        _____7B49_5F85(nil, 0.25)
                                    ),
                                    _____603B_662F_6210_529F(
                                        nil,
                                        _____6761_4EF6(
                                            nil,
                                            function()
                                                local playerData = datas.players[self.playerId]:getSingle(PlayerData)
                                                local ____opt_11 = datas.players[playerData.imagePlayerId[1]]
                                                local image = ____opt_11 and ____opt_11:getSingle(PlayerData)
                                                if image == nil then
                                                    self:log(function() return "无法找到镜像" end)
                                                    return false
                                                end
                                                local level = image.level
                                                self:log(function() return ((("自己等级(" .. tostring(playerData.level)) .. ")>镜像等级(") .. tostring(level)) .. ")" end)
                                                return playerData.level >= level
                                            end,
                                            _____505C_6B62_89C4_5219["自己"],
                                            nil,
                                            nil,
                                            upgradeTech(self)
                                        )
                                    ),
                                    _____6761_4EF6(
                                        nil,
                                        function()
                                            self:log(function() return ((((("剩余木头" .. tostring(self.blackboard:Get(BlackboardEnum.wood))) .. ">=30 且 消费(") .. tostring(self.blackboard:Get(BlackboardEnum.woodConsume))) .. ") < 预算(") .. tostring(self.blackboard:Get(BlackboardEnum.woodBudget))) .. ")" end)
                                            return self.blackboard:Get(BlackboardEnum.wood) >= 30 and self.blackboard:Get(BlackboardEnum.woodConsume) < self.blackboard:Get(BlackboardEnum.woodBudget)
                                        end,
                                        _____505C_6B62_89C4_5219["自己"],
                                        nil,
                                        nil,
                                        commonBuyMercenary(self)
                                    )
                                ),
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____603B_662F_6210_529F(
                                        nil,
                                        commonBuyCard(self)
                                    ),
                                    _____9009_62E9(
                                        nil,
                                        _____6761_4EF6(
                                            nil,
                                            function()
                                                if self.blackboard:Get(BlackboardEnum.kingLeft) == 1 then
                                                    self:log(function() return ("镜像波，剩余国王数量(" .. tostring(self.blackboard:Get(BlackboardEnum.kingLeft))) .. ")==1 " end)
                                                    return true
                                                end
                                                return false
                                            end,
                                            _____505C_6B62_89C4_5219["自己"],
                                            nil,
                                            nil,
                                            refreshCardPool(self)
                                        ),
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.gameLevel,
                                            _____64CD_4F5C["小于等于"],
                                            10,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____603B_662F_6210_529F(
                                                nil,
                                                _____9ED1_677F_6761_4EF6(
                                                    nil,
                                                    BlackboardEnum.gold,
                                                    _____64CD_4F5C["大于等于"],
                                                    1120,
                                                    _____505C_6B62_89C4_5219["自己"],
                                                    refreshCardPool(self)
                                                )
                                            )
                                        ),
                                        checkAverageGold(
                                            self,
                                            {},
                                            refreshCardPool(self)
                                        )
                                    )
                                )
                            )
                        ),
                        _____6761_4EF6(
                            nil,
                            function()
                                return self.blackboard:Get(BlackboardEnum.gameMode) == 3 and self.blackboard:Get(BlackboardEnum.readyLeftTime) >= 30
                            end,
                            _____505C_6B62_89C4_5219["自己"],
                            nil,
                            nil,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 2, 7),
                                selectKOFSeat(self),
                                _____7B49_5F85(nil, 2, 7),
                                _____968F_673A(
                                    nil,
                                    0.5,
                                    selectKOFSeat(self)
                                )
                            )
                        ),
                        _____9ED1_677F_6761_4EF6(
                            nil,
                            BlackboardEnum.readyLeftTime,
                            _____64CD_4F5C["大于等于"],
                            7,
                            _____505C_6B62_89C4_5219["自己"],
                            _____7B49_5F85(nil, 0.5)
                        ),
                        _____6761_4EF6(
                            nil,
                            function() return self.blackboard:Get(BlackboardEnum.gameMode) == 3 or self.blackboard:Get(BlackboardEnum.gameMode) == 5 end,
                            _____505C_6B62_89C4_5219["自己"],
                            nil,
                            nil,
                            _____9009_62E9(
                                nil,
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____603B_662F_6210_529F(
                                        nil,
                                        commonBuyCard(self)
                                    ),
                                    _____9009_62E9(
                                        nil,
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.gameLevel,
                                            _____64CD_4F5C["小于等于"],
                                            10,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____603B_662F_6210_529F(
                                                nil,
                                                _____9ED1_677F_6761_4EF6(
                                                    nil,
                                                    BlackboardEnum.gold,
                                                    _____64CD_4F5C["大于等于"],
                                                    1120,
                                                    _____505C_6B62_89C4_5219["自己"],
                                                    refreshCardPool(self)
                                                )
                                            )
                                        ),
                                        checkAverageGold(
                                            self,
                                            {},
                                            refreshCardPool(self)
                                        )
                                    )
                                ),
                                _____987A_5E8F_6267_884C(
                                    nil,
                                    _____9009_62E9(
                                        nil,
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            15,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 1, 2)
                                        ),
                                        _____9ED1_677F_6761_4EF6(
                                            nil,
                                            BlackboardEnum.readyLeftTime,
                                            _____64CD_4F5C["大于等于"],
                                            7,
                                            _____505C_6B62_89C4_5219["自己"],
                                            _____7B49_5F85(nil, 0.5)
                                        ),
                                        _____7B49_5F85(nil, 0.25)
                                    ),
                                    _____603B_662F_6210_529F(
                                        nil,
                                        upgradeTech(self)
                                    )
                                )
                            )
                        )
                    ),
                    _____9ED1_677F_6761_4EF6(
                        nil,
                        BlackboardEnum.gameMode,
                        _____64CD_4F5C["等于"],
                        6,
                        _____505C_6B62_89C4_5219["自己"],
                        _____9009_62E9(
                            nil,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 0.5, 1),
                                _____9ED1_677F_6761_4EF6(
                                    nil,
                                    BlackboardEnum.gold,
                                    _____64CD_4F5C["大于等于"],
                                    0,
                                    _____505C_6B62_89C4_5219["自己"],
                                    _____9009_62E9(
                                        nil,
                                        commonBuyCard(self),
                                        refreshCardPool(self)
                                    )
                                )
                            ),
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____9009_62E9(
                                    nil,
                                    _____9ED1_677F_6761_4EF6(
                                        nil,
                                        BlackboardEnum.readyLeftTime,
                                        _____64CD_4F5C["大于等于"],
                                        15,
                                        _____505C_6B62_89C4_5219["自己"],
                                        _____7B49_5F85(nil, 0.1, 1)
                                    ),
                                    _____9ED1_677F_6761_4EF6(
                                        nil,
                                        BlackboardEnum.readyLeftTime,
                                        _____64CD_4F5C["大于等于"],
                                        7,
                                        _____505C_6B62_89C4_5219["自己"],
                                        _____7B49_5F85(nil, 0.1, 0.5)
                                    ),
                                    _____7B49_5F85(nil, 0.25)
                                ),
                                _____603B_662F_6210_529F(
                                    nil,
                                    upgradeTech(self)
                                ),
                                _____6761_4EF6(
                                    nil,
                                    function() return self.blackboard:Get(BlackboardEnum.wood) > 0 end,
                                    _____505C_6B62_89C4_5219["自己"],
                                    nil,
                                    nil,
                                    commonBuyMercenary(self)
                                )
                            )
                        )
                    ),
                    _____9ED1_677F_6761_4EF6(
                        nil,
                        BlackboardEnum.gameMode,
                        _____64CD_4F5C["等于"],
                        7,
                        _____505C_6B62_89C4_5219["自己"],
                        _____9009_62E9(
                            nil,
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____9009_62E9(
                                    nil,
                                    _____7B49_5F85(nil, 0.1)
                                ),
                                _____6761_4EF6(
                                    nil,
                                    function() return self.blackboard:Get(BlackboardEnum.wood) > 0 end,
                                    _____505C_6B62_89C4_5219["自己"],
                                    nil,
                                    nil,
                                    _____9009_62E9(
                                        nil,
                                        commonBuyMercenary(self)
                                    )
                                )
                            ),
                            _____987A_5E8F_6267_884C(
                                nil,
                                _____7B49_5F85(nil, 0.5, 1),
                                _____9ED1_677F_6761_4EF6(
                                    nil,
                                    BlackboardEnum.gold,
                                    _____64CD_4F5C["大于等于"],
                                    0,
                                    _____505C_6B62_89C4_5219["自己"],
                                    _____9009_62E9(
                                        nil,
                                        commonBuyCard(self),
                                        refreshCardPool(self)
                                    )
                                )
                            )
                        )
                    )
                )
            )
        )
    )
end
function SimplePlayerBehaveTree.prototype.initBlackboard(self, blackboard)
    blackboard:Set(BlackboardEnum.gold, 0)
    blackboard:Set(BlackboardEnum.wood, 0)
    blackboard:Set(BlackboardEnum.roleLevel, 0)
    blackboard:Set(BlackboardEnum.kingLeft, 0)
    blackboard:Set(BlackboardEnum.enemyKingLeft, 0)
    blackboard:Set(BlackboardEnum.cutThroughCount, 0)
    blackboard:Set(BlackboardEnum.farmerLevel, 0)
    blackboard:Set(BlackboardEnum.gatherLevel, 0)
    blackboard:Set(BlackboardEnum.heroHurtDistance, 0)
    blackboard:Set(BlackboardEnum.heroId, 0)
    blackboard:Set(BlackboardEnum.resetBudgetLevel, 0)
    blackboard:Set(BlackboardEnum.woodBudget, 0)
    blackboard:Set(BlackboardEnum.woodConsume, 0)
    blackboard:Set(BlackboardEnum.levelupCount, 0)
end
return ____exports
