local ____lualib = include("lualib_bundle")
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["5"] = 1,["6"] = 1,["7"] = 2,["8"] = 2,["9"] = 2,["10"] = 2,["11"] = 2,["12"] = 2,["13"] = 2,["14"] = 2,["15"] = 2,["16"] = 6,["17"] = 7,["18"] = 7,["19"] = 7,["20"] = 6,["21"] = 15,["22"] = 15,["23"] = 15,["24"] = 6,["25"] = 23,["26"] = 23,["27"] = 23,["28"] = 6,["29"] = 31,["30"] = 31,["31"] = 31,["32"] = 6,["33"] = 39,["34"] = 39,["35"] = 39,["36"] = 6,["37"] = 47,["38"] = 47,["39"] = 47,["40"] = 6,["41"] = 55,["42"] = 55,["43"] = 55,["44"] = 6,["45"] = 63,["46"] = 63,["47"] = 63,["48"] = 6,["49"] = 71,["50"] = 71,["51"] = 71,["52"] = 6,["53"] = 79,["54"] = 80,["55"] = 80,["56"] = 80,["57"] = 80,["58"] = 79,["59"] = 85,["60"] = 85,["61"] = 85,["62"] = 79,["63"] = 6,["64"] = 91,["65"] = 92,["66"] = 92,["67"] = 92,["68"] = 91,["69"] = 96,["70"] = 96,["71"] = 96,["72"] = 91,["73"] = 6,["74"] = 101,["75"] = 101,["76"] = 101,["77"] = 6,["78"] = 109,["79"] = 109,["80"] = 109,["81"] = 109,["82"] = 6,["83"] = 114,["84"] = 115,["85"] = 115,["86"] = 115,["87"] = 115,["88"] = 115,["89"] = 115,["90"] = 114,["91"] = 122,["92"] = 122,["93"] = 122,["94"] = 122,["95"] = 114,["96"] = 6,["97"] = 128,["98"] = 129,["99"] = 129,["100"] = 129,["101"] = 129,["102"] = 128,["103"] = 134,["104"] = 134,["105"] = 134,["106"] = 134,["107"] = 134,["108"] = 134,["109"] = 134,["110"] = 128,["111"] = 142,["112"] = 142,["113"] = 142,["114"] = 142,["115"] = 142,["116"] = 128,["117"] = 6,["118"] = 150,["119"] = 151,["120"] = 151,["121"] = 151,["122"] = 151,["123"] = 150,["124"] = 156,["125"] = 156,["126"] = 156,["127"] = 156,["128"] = 156,["129"] = 150,["130"] = 6,["131"] = 163,["132"] = 164,["133"] = 164,["134"] = 164,["135"] = 164,["136"] = 163,["137"] = 163,["138"] = 6,["139"] = 175,["140"] = 176,["141"] = 176,["142"] = 176,["143"] = 176,["144"] = 176,["145"] = 175,["146"] = 182,["147"] = 182,["148"] = 182,["149"] = 182,["150"] = 182,["151"] = 175,["152"] = 6,["153"] = 189,["154"] = 190,["155"] = 190,["156"] = 190,["157"] = 190,["158"] = 190,["159"] = 189,["160"] = 196,["161"] = 196,["162"] = 196,["163"] = 196,["164"] = 196,["165"] = 196,["166"] = 189,["167"] = 6,["168"] = 204,["169"] = 204,["170"] = 208,["171"] = 208,["172"] = 208,["173"] = 208,["174"] = 204,["175"] = 6,["176"] = 214,["177"] = 215,["178"] = 215,["179"] = 215,["180"] = 215,["181"] = 214,["182"] = 220,["183"] = 220,["184"] = 222,["185"] = 223,["186"] = 223,["187"] = 220,["188"] = 220,["189"] = 220,["190"] = 220,["191"] = 220,["192"] = 214,["193"] = 6,["194"] = 232,["195"] = 233,["196"] = 233,["197"] = 233,["198"] = 233,["199"] = 233,["200"] = 233,["201"] = 232,["202"] = 232,["203"] = 243,["204"] = 243,["205"] = 243,["206"] = 243,["207"] = 243,["208"] = 243,["209"] = 232,["210"] = 6,["211"] = 251,["212"] = 252,["213"] = 252,["214"] = 252,["215"] = 252,["216"] = 252,["217"] = 252,["218"] = 252,["219"] = 252,["220"] = 252,["221"] = 252,["222"] = 252,["223"] = 252,["224"] = 252,["225"] = 251,["226"] = 266,["227"] = 266,["228"] = 266,["229"] = 251,["230"] = 6,["231"] = 271,["232"] = 272,["233"] = 272,["234"] = 272,["235"] = 272,["236"] = 272,["237"] = 272,["238"] = 271,["239"] = 279,["240"] = 279,["241"] = 279,["242"] = 282,["243"] = 282,["244"] = 282,["245"] = 279,["246"] = 279,["247"] = 279,["248"] = 285,["249"] = 285,["250"] = 285,["251"] = 279,["252"] = 271,["253"] = 6,["254"] = 288,["255"] = 289,["256"] = 289,["257"] = 289,["258"] = 289,["259"] = 289,["260"] = 288,["261"] = 295,["262"] = 295,["263"] = 295,["264"] = 295,["265"] = 288,["266"] = 6,["267"] = 301,["268"] = 302,["269"] = 302,["270"] = 302,["271"] = 302,["272"] = 302,["273"] = 302,["274"] = 301,["275"] = 309,["276"] = 309,["277"] = 309,["278"] = 309,["279"] = 309,["280"] = 309,["281"] = 309,["282"] = 309,["283"] = 309,["284"] = 309,["285"] = 309,["286"] = 301,["287"] = 6,["288"] = 327,["289"] = 328,["290"] = 328,["291"] = 328,["292"] = 328,["293"] = 328,["294"] = 328,["295"] = 328,["296"] = 327,["297"] = 336,["298"] = 336,["299"] = 336,["300"] = 327,["301"] = 6,["302"] = 341,["303"] = 342,["304"] = 342,["305"] = 342,["306"] = 342,["307"] = 342,["308"] = 341,["309"] = 348,["310"] = 348,["311"] = 348,["312"] = 348,["313"] = 348,["314"] = 348,["315"] = 348,["316"] = 348,["317"] = 341,["318"] = 6,["319"] = 358,["320"] = 359,["321"] = 359,["322"] = 359,["323"] = 359,["324"] = 359,["325"] = 359,["326"] = 358,["327"] = 366,["328"] = 366,["329"] = 366,["330"] = 366,["331"] = 358,["332"] = 6,["333"] = 372,["334"] = 373,["335"] = 373,["336"] = 373,["337"] = 373,["338"] = 373,["339"] = 373,["340"] = 373,["341"] = 373,["342"] = 372,["343"] = 382,["344"] = 382,["345"] = 382,["346"] = 382,["347"] = 372,["348"] = 6,["349"] = 388,["350"] = 389,["351"] = 389,["352"] = 389,["353"] = 389,["354"] = 389,["355"] = 389,["356"] = 389,["357"] = 388,["358"] = 397,["359"] = 397,["360"] = 397,["361"] = 397,["362"] = 388,["363"] = 6,["364"] = 403,["365"] = 404,["366"] = 404,["367"] = 404,["368"] = 404,["369"] = 404,["370"] = 403,["371"] = 403,["372"] = 403,["373"] = 6,["374"] = 417,["375"] = 418,["376"] = 418,["377"] = 418,["378"] = 418,["379"] = 418,["380"] = 417,["381"] = 424,["382"] = 424,["383"] = 424,["384"] = 424,["385"] = 424,["386"] = 417,["387"] = 430,["388"] = 430,["389"] = 430,["390"] = 430,["391"] = 430,["392"] = 430,["393"] = 430,["394"] = 417,["395"] = 6,["396"] = 439,["397"] = 440,["398"] = 440,["399"] = 440,["400"] = 440,["401"] = 440,["402"] = 439,["403"] = 446,["404"] = 446,["405"] = 446,["406"] = 446,["407"] = 446,["408"] = 439,["409"] = 439,["410"] = 6,["411"] = 456,["412"] = 457,["413"] = 457,["414"] = 457,["415"] = 457,["416"] = 457,["417"] = 457,["418"] = 457,["419"] = 457,["420"] = 456,["421"] = 466,["422"] = 466,["423"] = 466,["424"] = 466,["425"] = 466,["426"] = 466,["427"] = 466,["428"] = 466,["429"] = 456,["430"] = 6,["431"] = 476,["432"] = 477,["433"] = 477,["434"] = 477,["435"] = 477,["436"] = 477,["437"] = 476,["438"] = 483,["439"] = 483,["440"] = 483,["441"] = 483,["442"] = 483,["443"] = 476,["444"] = 489,["445"] = 489,["446"] = 489,["447"] = 489,["448"] = 489,["449"] = 489,["450"] = 476,["451"] = 6,["452"] = 497,["453"] = 498,["454"] = 498,["455"] = 498,["456"] = 498,["457"] = 498,["458"] = 498,["459"] = 498,["460"] = 498,["461"] = 498,["462"] = 498,["463"] = 498,["464"] = 498,["465"] = 498,["466"] = 498,["467"] = 498,["468"] = 497,["469"] = 497,["470"] = 6,["471"] = 518,["472"] = 519,["473"] = 519,["474"] = 519,["475"] = 519,["476"] = 519,["477"] = 518,["478"] = 525,["479"] = 525,["480"] = 525,["481"] = 525,["482"] = 525,["483"] = 525,["484"] = 525,["485"] = 518,["486"] = 6,["487"] = 534,["488"] = 535,["489"] = 535,["490"] = 535,["491"] = 535,["492"] = 539,["493"] = 539,["494"] = 539,["495"] = 539,["496"] = 539,["497"] = 539,["498"] = 535,["499"] = 540,["500"] = 540,["501"] = 540,["502"] = 540,["503"] = 540,["504"] = 540,["505"] = 540,["506"] = 540,["507"] = 540,["508"] = 535,["509"] = 535,["510"] = 535,["511"] = 535,["512"] = 534,["513"] = 545,["514"] = 545,["515"] = 545,["516"] = 545,["517"] = 534,["518"] = 550,["519"] = 550,["520"] = 550,["521"] = 550,["522"] = 550,["523"] = 550,["524"] = 534,["525"] = 6,["526"] = 558,["527"] = 559,["528"] = 559,["529"] = 559,["530"] = 559,["531"] = 559,["532"] = 564,["533"] = 564,["534"] = 564,["535"] = 564,["536"] = 564,["537"] = 564,["538"] = 559,["539"] = 559,["540"] = 558,["541"] = 567,["542"] = 567,["543"] = 569,["544"] = 569,["545"] = 569,["546"] = 567,["547"] = 567,["548"] = 567,["549"] = 558,["550"] = 573,["551"] = 573,["552"] = 573,["553"] = 558,["554"] = 6,["555"] = 578,["556"] = 579,["557"] = 579,["558"] = 579,["559"] = 579,["560"] = 579,["561"] = 579,["562"] = 579,["563"] = 578,["564"] = 587,["565"] = 587,["566"] = 587,["567"] = 587,["568"] = 587,["569"] = 587,["570"] = 578,["571"] = 594,["572"] = 594,["573"] = 594,["574"] = 578,["575"] = 6,["576"] = 599,["577"] = 600,["578"] = 600,["579"] = 600,["580"] = 600,["581"] = 600,["582"] = 600,["583"] = 600,["584"] = 600,["585"] = 599,["586"] = 609,["587"] = 609,["588"] = 609,["589"] = 609,["590"] = 613,["591"] = 613,["592"] = 613,["593"] = 613,["594"] = 613,["595"] = 613,["596"] = 609,["597"] = 599,["598"] = 615,["599"] = 615,["600"] = 615,["601"] = 618,["602"] = 618,["603"] = 618,["604"] = 615,["605"] = 615,["606"] = 599,["607"] = 6,["608"] = 622,["609"] = 623,["610"] = 623,["611"] = 623,["612"] = 623,["613"] = 623,["614"] = 622,["615"] = 629,["616"] = 629,["617"] = 629,["618"] = 622,["619"] = 633,["620"] = 633,["621"] = 633,["622"] = 633,["623"] = 633,["624"] = 622,["625"] = 639,["626"] = 639,["627"] = 639,["628"] = 622,["629"] = 6,["630"] = 644,["631"] = 645,["632"] = 645,["633"] = 645,["634"] = 645,["635"] = 645,["636"] = 645,["637"] = 645,["638"] = 652,["639"] = 652,["640"] = 652,["641"] = 645,["642"] = 644,["643"] = 654,["644"] = 654,["645"] = 654,["646"] = 654,["647"] = 654,["648"] = 654,["649"] = 644,["650"] = 661,["651"] = 661,["652"] = 661,["653"] = 661,["654"] = 661,["655"] = 644,["656"] = 6,["657"] = 668,["658"] = 669,["659"] = 669,["660"] = 669,["661"] = 669,["662"] = 669,["663"] = 668,["664"] = 675,["665"] = 675,["666"] = 675,["667"] = 675,["668"] = 679,["669"] = 679,["670"] = 679,["671"] = 675,["672"] = 675,["673"] = 668,["674"] = 6,["675"] = 683,["676"] = 684,["677"] = 684,["678"] = 684,["679"] = 684,["680"] = 684,["681"] = 684,["682"] = 683,["683"] = 691,["684"] = 691,["685"] = 691,["686"] = 691,["687"] = 691,["688"] = 691,["689"] = 691,["690"] = 683,["691"] = 6,["692"] = 700,["693"] = 701,["694"] = 701,["695"] = 701,["696"] = 701,["697"] = 701,["698"] = 706,["699"] = 706,["700"] = 706,["701"] = 706,["702"] = 706,["703"] = 706,["704"] = 701,["705"] = 707,["706"] = 707,["707"] = 707,["708"] = 707,["709"] = 707,["710"] = 707,["711"] = 701,["712"] = 701,["713"] = 700,["714"] = 710,["715"] = 710,["716"] = 710,["717"] = 710,["718"] = 700,["719"] = 715,["720"] = 715,["721"] = 715,["722"] = 715,["723"] = 715,["724"] = 715,["725"] = 715,["726"] = 700,["727"] = 6,["728"] = 724,["729"] = 725,["730"] = 725,["731"] = 725,["732"] = 725,["733"] = 725,["734"] = 725,["735"] = 724,["736"] = 732,["737"] = 732,["738"] = 732,["739"] = 732,["740"] = 732,["741"] = 732,["742"] = 732,["743"] = 724,["744"] = 6,["745"] = 742,["746"] = 743,["747"] = 743,["748"] = 743,["749"] = 743,["750"] = 743,["751"] = 743,["752"] = 742,["753"] = 751,["754"] = 751,["755"] = 751,["756"] = 751,["757"] = 751,["758"] = 757,["759"] = 757,["760"] = 757,["761"] = 751,["762"] = 751,["763"] = 742,["764"] = 6,["765"] = 761,["766"] = 762,["767"] = 762,["768"] = 762,["769"] = 762,["770"] = 767,["771"] = 767,["772"] = 767,["773"] = 762,["774"] = 762,["775"] = 761,["776"] = 770,["777"] = 770,["778"] = 770,["779"] = 770,["780"] = 761,["781"] = 6,["782"] = 776,["783"] = 777,["784"] = 777,["785"] = 777,["786"] = 777,["787"] = 777,["788"] = 777,["789"] = 777,["790"] = 777,["791"] = 776,["792"] = 787,["793"] = 787,["794"] = 787,["795"] = 787,["796"] = 787,["797"] = 776,["798"] = 6,["799"] = 795,["800"] = 796,["801"] = 796,["802"] = 796,["803"] = 796,["804"] = 795,["805"] = 802,["806"] = 803,["807"] = 803,["808"] = 803,["809"] = 802,["810"] = 804,["811"] = 804,["812"] = 804,["813"] = 802,["814"] = 795,["815"] = 806,["816"] = 806,["817"] = 806,["818"] = 795,["819"] = 6,["820"] = 811,["821"] = 812,["822"] = 812,["823"] = 812,["824"] = 812,["825"] = 812,["826"] = 812,["827"] = 819,["828"] = 819,["829"] = 819,["830"] = 812,["831"] = 811,["832"] = 821,["833"] = 821,["834"] = 821,["835"] = 821,["836"] = 811,["837"] = 6,["838"] = 828,["839"] = 829,["840"] = 829,["841"] = 829,["842"] = 829,["843"] = 829,["844"] = 829,["845"] = 829,["846"] = 828,["847"] = 838,["848"] = 838,["849"] = 838,["850"] = 838,["851"] = 838,["852"] = 838,["853"] = 838,["854"] = 838,["855"] = 838,["856"] = 828,["857"] = 6,["858"] = 850,["859"] = 851,["860"] = 851,["861"] = 851,["862"] = 851,["863"] = 851,["864"] = 850,["865"] = 858,["866"] = 858,["867"] = 858,["868"] = 858,["869"] = 858,["870"] = 858,["871"] = 858,["872"] = 858,["873"] = 850,["874"] = 6,["875"] = 870,["876"] = 871,["877"] = 871,["878"] = 6,["879"] = 877,["880"] = 878,["881"] = 878,["882"] = 6,["883"] = 883,["884"] = 884,["885"] = 884,["886"] = 6,["887"] = 890,["888"] = 891,["889"] = 891,["890"] = 6,["891"] = 897,["892"] = 898,["893"] = 898,["894"] = 6,["895"] = 904,["896"] = 905,["897"] = 905,["898"] = 6,["899"] = 911,["900"] = 912,["901"] = 912,["902"] = 912,["903"] = 6,["904"] = 918,["905"] = 919,["906"] = 919,["907"] = 919,["908"] = 6,["909"] = 925,["910"] = 925,["911"] = 925,["912"] = 932,["913"] = 932,["914"] = 932,["915"] = 925,["916"] = 925,["917"] = 925,["918"] = 942,["919"] = 942,["920"] = 942,["921"] = 925,["922"] = 946,["923"] = 946,["924"] = 946,["925"] = 925,["926"] = 950,["927"] = 950,["928"] = 950,["929"] = 925,["930"] = 954,["931"] = 954,["932"] = 954,["933"] = 954,["934"] = 925,["935"] = 925,["936"] = 962,["937"] = 962,["938"] = 962,["939"] = 925,["940"] = 966,["941"] = 966,["942"] = 966,["943"] = 925,["944"] = 970,["945"] = 970,["946"] = 970,["947"] = 925,["948"] = 974,["949"] = 974,["950"] = 974,["951"] = 925,["952"] = 925,["953"] = 981,["954"] = 981,["955"] = 981,["956"] = 925,["957"] = 985,["958"] = 985,["959"] = 985,["960"] = 925,["961"] = 989,["962"] = 989,["963"] = 989,["964"] = 989,["965"] = 989,["966"] = 925,["967"] = 925,["968"] = 999,["969"] = 999,["970"] = 999,["971"] = 925,["972"] = 1003,["973"] = 1003,["974"] = 1003,["975"] = 925,["976"] = 925,["977"] = 1010,["978"] = 1010,["979"] = 1010,["980"] = 925,["981"] = 1014,["982"] = 1014,["983"] = 1014,["984"] = 925,["985"] = 925,["986"] = 1021,["987"] = 1021,["988"] = 1021,["989"] = 925,["990"] = 1025,["991"] = 1025,["992"] = 1025,["993"] = 1025,["994"] = 925,["995"] = 925,["996"] = 925,["997"] = 925,["998"] = 925,["999"] = 1042,["1000"] = 1042,["1001"] = 1042,["1002"] = 925,["1003"] = 1046,["1004"] = 1046,["1005"] = 1046,["1006"] = 925,["1007"] = 1050,["1008"] = 1050,["1009"] = 1050,["1010"] = 925,["1011"] = 1054,["1012"] = 1054,["1013"] = 1054,["1014"] = 925,["1015"] = 1058,["1016"] = 1058,["1017"] = 1058,["1018"] = 1058,["1019"] = 925,["1020"] = 925,["1021"] = 1066,["1022"] = 1066,["1023"] = 1066,["1024"] = 1066,["1025"] = 1066,["1026"] = 925,["1027"] = 925,["1028"] = 1075,["1029"] = 1076,["1030"] = 1076,["1031"] = 925,["1032"] = 925,["1033"] = 925,["1034"] = 925,["1035"] = 925,["1036"] = 1090,["1037"] = 1090,["1038"] = 1090,["1039"] = 1090,["1040"] = 1090,["1041"] = 1090,["1042"] = 1090,["1043"] = 1090,["1044"] = 925,["1045"] = 925,["1046"] = 1102,["1047"] = 1102,["1048"] = 1102,["1049"] = 925,["1050"] = 925,["1051"] = 6,["1052"] = 1111,["1053"] = 1111,["1054"] = 1111,["1055"] = 1111,["1056"] = 1111,["1057"] = 1124,["1058"] = 1124,["1059"] = 1124,["1060"] = 1111,["1061"] = 1128,["1062"] = 1128,["1063"] = 1128,["1064"] = 1128,["1065"] = 1111,["1066"] = 1111,["1067"] = 1136,["1068"] = 1136,["1069"] = 1136,["1070"] = 1111,["1071"] = 1111,["1072"] = 1111,["1073"] = 1111,["1074"] = 1111,["1075"] = 1111,["1076"] = 1155,["1077"] = 1155,["1078"] = 1155,["1079"] = 1155,["1080"] = 1111,["1081"] = 1160,["1082"] = 1160,["1083"] = 1160,["1084"] = 1111,["1085"] = 1111,["1086"] = 1111,["1087"] = 1170,["1088"] = 1170,["1089"] = 1170,["1090"] = 1111,["1091"] = 1111,["1092"] = 1111,["1093"] = 1111,["1094"] = 1183,["1095"] = 1183,["1096"] = 1183,["1097"] = 1111,["1098"] = 1111,["1099"] = 1190,["1100"] = 1190,["1101"] = 1190,["1102"] = 1111,["1103"] = 1111,["1104"] = 1197,["1105"] = 1197,["1106"] = 1197,["1107"] = 1111,["1108"] = 1201,["1109"] = 1201,["1110"] = 1201,["1111"] = 1201,["1112"] = 1111,["1113"] = 1206,["1114"] = 1206,["1115"] = 1206,["1116"] = 1111,["1117"] = 1111,["1118"] = 1213,["1119"] = 1213,["1120"] = 1213,["1121"] = 1213,["1122"] = 1111,["1123"] = 1111,["1124"] = 1111,["1125"] = 1224,["1126"] = 1224,["1127"] = 1224,["1128"] = 1111,["1129"] = 1228,["1130"] = 1228,["1131"] = 1228,["1132"] = 1111,["1133"] = 1232,["1134"] = 1232,["1135"] = 1232,["1136"] = 1232,["1137"] = 1111,["1138"] = 1111,["1139"] = 1111,["1140"] = 1243,["1141"] = 1243,["1142"] = 1243,["1143"] = 1111,["1144"] = 1247,["1145"] = 1247,["1146"] = 1247,["1147"] = 1247,["1148"] = 1111,["1149"] = 1111,["1150"] = 1111,["1151"] = 1111,["1152"] = 1111,["1153"] = 1264,["1154"] = 1264,["1155"] = 1264,["1156"] = 1264,["1157"] = 1111,["1158"] = 1111,["1159"] = 1111,["1160"] = 1275,["1161"] = 1275,["1162"] = 1275,["1163"] = 1111,["1164"] = 1111,["1165"] = 1282,["1166"] = 1282,["1167"] = 1282,["1168"] = 1282,["1169"] = 1282,["1170"] = 1111,["1171"] = 1288,["1172"] = 1288,["1173"] = 1288,["1174"] = 1288,["1175"] = 1288,["1176"] = 1288,["1177"] = 1111,["1178"] = 1295,["1179"] = 1295,["1180"] = 1297,["1181"] = 1297,["1182"] = 1297,["1183"] = 1295,["1184"] = 1111,["1185"] = 1111,["1186"] = 1302,["1187"] = 1302,["1188"] = 1302,["1189"] = 1111,["1190"] = 1111,["1191"] = 1111,["1192"] = 1312,["1193"] = 1312,["1194"] = 1312,["1195"] = 1111,["1196"] = 1316,["1197"] = 1316,["1198"] = 1316,["1199"] = 1316,["1200"] = 1111,["1201"] = 1321,["1202"] = 1321,["1203"] = 1321,["1204"] = 1321,["1205"] = 1321,["1206"] = 1111,["1207"] = 1111,["1208"] = 1330,["1209"] = 1330,["1210"] = 1330,["1211"] = 1111,["1212"] = 1111,["1213"] = 6,["1214"] = 1338,["1215"] = 1339,["1216"] = 1339,["1217"] = 1339,["1218"] = 1339,["1219"] = 1338,["1220"] = 1338,["1221"] = 1347,["1222"] = 1347,["1223"] = 1347,["1224"] = 1338,["1225"] = 1351,["1226"] = 1351,["1227"] = 1351,["1228"] = 1338,["1229"] = 1338,["1230"] = 1358,["1231"] = 1358,["1232"] = 1358,["1233"] = 1358,["1234"] = 1338,["1235"] = 1363,["1236"] = 1363,["1237"] = 1363,["1238"] = 1338,["1239"] = 1367,["1240"] = 1367,["1241"] = 1367,["1242"] = 1338,["1243"] = 1371,["1244"] = 1371,["1245"] = 1371,["1246"] = 1371,["1247"] = 1338,["1248"] = 1376,["1249"] = 1376,["1250"] = 1376,["1251"] = 1338,["1252"] = 1338,["1253"] = 1385,["1254"] = 1385,["1255"] = 1385,["1256"] = 1385,["1257"] = 1338,["1258"] = 1390,["1259"] = 1390,["1260"] = 1390,["1261"] = 1338,["1262"] = 1338,["1263"] = 1397,["1264"] = 1397,["1265"] = 1397,["1266"] = 1397,["1267"] = 1338,["1268"] = 1402,["1269"] = 1402,["1270"] = 1402,["1271"] = 1338,["1272"] = 1338,["1273"] = 1338,["1274"] = 1338,["1275"] = 1338,["1276"] = 1338,["1277"] = 1338,["1278"] = 1424,["1279"] = 1424,["1280"] = 1424,["1281"] = 1338,["1282"] = 1428,["1283"] = 1428,["1284"] = 1428,["1285"] = 1338,["1286"] = 1432,["1287"] = 1432,["1288"] = 1432,["1289"] = 1338,["1290"] = 1338,["1291"] = 1338,["1292"] = 1338,["1293"] = 1445,["1294"] = 1445,["1295"] = 1445,["1296"] = 1338,["1297"] = 1449,["1298"] = 1449,["1299"] = 1449,["1300"] = 1338,["1301"] = 6,["1302"] = 1454,["1303"] = 1455,["1304"] = 1455,["1305"] = 6,["1306"] = 6});
local ____exports = {}
local ____FightController = include("logic.controllers.FightController")
local Formula = ____FightController.Formula
local ____Property = include("logic.models.Property")
local _____8840 = ____Property["血"]
local _____7279_6280_2 = ____Property["特技_2"]
local _____6BCF5_79D2_83B7_5F97_62A4_76FE = ____Property["每5秒获得护盾"]
local _____95EA_907F_7387 = ____Property["闪避率"]
local _____4F53_578B = ____Property["体型"]
local _____5929_8D4B_2 = ____Property["天赋_2"]
local _____66B4_51FB_7387 = ____Property["暴击率"]
local _____901A_7528_62A4_76FE = ____Property["通用护盾"]
____exports["数值"] = {
    ["苍坤机器人1"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人2"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人3"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人4"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人5"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人6"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人7"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人8"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人9"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["苍坤机器人10"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["左手固定伤害"] = function() return 15 end,
            ["右手护盾"] = function() return 10 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return 150 end,
            ["蓄力获得护盾值"] = function(____, level) return 100 + level * 3 end
        }
    },
    ["苍坤机器人11"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["中毒层数"] = function() return 3 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return 150 end,
            ["中毒层数"] = function() return 3 end
        }
    },
    ["苍坤机器人12"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end},
        ["大招"] = {["伤害"] = function(____, source) return 150 end}
    },
    ["钢人机器人普通攻击"] = {
        ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.75 end,
        ["额外伤害1"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.75 end,
        ["额外伤害2"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.75 end
    },
    ["火焰女王"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 10 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 + 20 end,
            ["天赋11_火球伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 3 + 20 end,
            ["天赋12_灼烧buffId"] = function() return 100713 end,
            ["天赋12_灼烧概率"] = function() return 1 end
        },
        ["大招"] = {
            ["伤害1"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end,
            ["伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 + 25 end,
            ["重复释放伤害系数"] = function() return 0.5 end
        }
    },
    ["恶魔小丑"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 + 10 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + source:formula(Formula["展示面板_血量上限"]) * 0.03 end,
            ["天赋12_特殊伤害加强"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + source:formula(Formula["展示面板_血量上限"]) * 0.05 end
        },
        ["华丽舞姿"] = {
            ["伤害"] = function(____, source) return 28 + source:formula(Formula["展示面板_血量上限"]) * (0.004 + math.random() * 0.004) end,
            ["天赋21_延长华丽舞姿时间"] = function() return 1 end,
            ["天赋22_恢复生命值"] = function(____, source) return (source:formula(Formula["展示面板_血量上限"]) - source:getValue(_____8840)) * 0.005 end,
            ["持续时间"] = function() return 3 end,
            ["最大持续时间"] = function() return 3 end,
            ["天赋树额外持续时间"] = function() return 2 end
        },
        ["大招"] = {
            ["前两击伤害"] = function(____, source) return 50 + source:formula(Formula["展示面板_血量上限"]) * 0.01 end,
            ["最后一击伤害"] = function(____, source) return 70 + source:formula(Formula["展示面板_血量上限"]) * 0.04 end,
            ["天赋31伤害提升"] = function() return 0.2 end,
            ["天赋32恢复生命值"] = function(____, source) return (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.05 end
        }
    },
    ["冰霜女王"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 10 end,
            ["特殊攻击回蓝"] = function() return 2 end,
            ["天赋11特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 + 10 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return 120 + source:formula(Formula["展示面板_法术攻击"]) * 2 end,
            ["叠加buff"] = function() return 100832 end,
            ["天赋31大招护盾"] = function(____, level) return level * 6 end,
            ["天赋32叠加buff"] = function() return 100833 end
        }
    },
    ["塔塔"] = {
        ["普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end,
            ["天赋12_暴击伤害加强"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 end
        },
        ["大招"] = {}
    },
    ["护盾法师"] = {
        ["普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 end,
            ["天赋12_伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 end,
            ["天赋11_加蓝"] = function() return 10 end,
            ["天赋32_伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.1 end
        },
        ["大招"] = {
            ["伤害"] = function() return 50 end,
            ["持续时间"] = function() return 5 end,
            ["天赋31_大招持续时间"] = function() return 10 end,
            buffId = -1
        }
    },
    ["画痴"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["冤魂buffId"] = function() return 1 end,
            ["冤魂触发CD"] = function() return 5 end,
            ["天赋11_冤魂buffId"] = function() return 2 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 end,
            ["伤害叠加"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.1 end,
            ["最高伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 2.5 end,
            ["天赋31_路径持续时间"] = function() return 5 end,
            ["天赋31_路径每秒伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.05 end
        }
    },
    ["奥术少女"] = {
        ["普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 end,
            ["持续时间"] = function() return 1 end,
            ["最大持续时间"] = function() return 5 end
        }
    },
    ["闲青山"] = {
        ["普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 15 end,
            ["强化额外伤害"] = function(____, source) return source:formula(Formula["展示面板_法术防御"]) * 0.8 + 50 + source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 15 end,
            ["天赋12恢复生命"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.05 end
        },
        ["大招"] = {
            effectId = function() return 101431 end,
            ["伤害"] = function(____, source, target) return (source:formula(Formula["展示面板_法术防御"]) * 1.8 + 60) * (1 + 2 * (math.min(
                math.abs(source:formula(Formula["展示面板_法术防御"]) - target:formula(Formula["展示面板_法术防御"])),
                100
            ) / 100)) end,
            ["天赋31恢复生命"] = function(____, source, level) return level * 6 + 80 end,
            ["天赋32法抗"] = function() return 70 end,
            ["天赋32法抗持续时间"] = function() return 3 end,
            ["杀敌回蓝"] = function() return 50 end
        }
    },
    ["苍坤"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["左手固定伤害"] = function() return 15 end,
            ["右手护盾"] = function() return 10 end,
            ["天赋11额外固定伤害"] = function(____, level) return level * 2 end,
            ["天赋12额外护盾"] = function(____, level) return level * 1.5 end
        },
        ["被动"] = {["伤害"] = function(____, source) return source:p(_____6BCF5_79D2_83B7_5F97_62A4_76FE) + 100 end},
        ["大招"] = {
            ["伤害"] = function(____, source) return source:getValue(_____7279_6280_2) * 2 + 150 end,
            ["附加effectId"] = function() return 101531 end,
            ["蓄力获得护盾值"] = function(____, level) return 50 + level * 2 end,
            ["天赋31最终伤害"] = function(____, source) return source:getValue(_____7279_6280_2) * 3 + 250 end,
            ["天赋32蓄力获得额外护盾值"] = function(____, source, level) return level * 8 end
        }
    },
    ["侠盗"] = {
        ["普通攻击"] = {
            ["第一击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 + 10 end,
            ["天赋11第一击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.3 + 10 end,
            ["第二击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.4 + 10 end,
            ["天赋11第二击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 10 end,
            ["第三击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 10 end,
            ["天赋11第三击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 + 10 end,
            ["最后一击附加中毒层数"] = function() return 10 end,
            ["天赋12额外附加中毒层数"] = function() return 10 end,
            ["被动回蓝"] = function() return 2 end,
            ["天赋21buff"] = function() return 102121 end,
            ["大招额外中毒层数"] = function(____, level) return 10 + level end,
            ["天赋32大招中毒层数"] = function(____, level) return 10 + level * 2 end
        },
        ["大招"] = {
            ["附加effectId"] = function() return 102131 end,
            ["天赋31额外effectId"] = function() return 102132 end
        }
    },
    ["卓尔"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end,
            ["特殊攻击概率"] = function(____, source) return 0.1 + 0.5 * source:formula(Formula["展示面板_闪避"]) end,
            ["被动刺击伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 400 end,
            ["天赋11buff"] = function() return 103311 end
        },
        ["大招"] = {
            ["前六次伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 60 + 5 end,
            ["最后一次伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 100 + 50 end,
            ["天赋31伤害提升系数"] = function(____, source) return math.min(
                0.5,
                (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) / source:formula(Formula["展示面板_血量上限"]) * 0.5
            ) end,
            ["降低攻速"] = function() return -0.3 end,
            ["降低攻速时长"] = function() return 5 end,
            ["天赋32治疗值"] = function(____, source, value) return math.min(
                source:formula(Formula["展示面板_血量上限"]) * 0.1,
                value * 0.1
            ) end
        }
    },
    ["壹壹"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 20 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 35 end,
            ["天赋11特殊攻击伤害提升"] = function() return 0.2 end,
            ["天赋12buff"] = function() return 102411 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 + 80 end,
            ["附加effectId"] = function() return 102431 end,
            ["天赋32附加effectId"] = function() return 102432 end
        }
    },
    ["林正嘤"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end,
            ["天赋11概率"] = function() return 0.3 end,
            ["天赋12卡牌分布概率"] = function() return {0.6, 0.8, 1} end,
            ["卡牌1恢复蓝量"] = function() return 1 end,
            ["卡牌3额外伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 end
        },
        ["大招"] = {
            ["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.2 + 8 end,
            ["天赋32每跳伤害提升系数"] = function(____, distance) return 1 + math.min(0.3, (1800 - distance) / 1800 * 0.3) end,
            ["距离1"] = function() return 500 end,
            ["距离2"] = function() return 1200 end,
            ["距离3"] = function() return 1800 end,
            ["距离1计算伤害跳数"] = function() return 5 end,
            ["距离2计算伤害跳数"] = function() return 7 end,
            ["距离3计算伤害跳数"] = function() return 10 end,
            ["卡牌总数量"] = function() return 50 end,
            ["天赋31额外叠加卡牌数量"] = function() return 3 end
        }
    },
    ["芙罗拉"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["穿透伤害系数"] = function() return 0.35 end,
            ["天赋11首目标伤害系数"] = function() return 1.2 end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.1 end,
            ["投射物碰撞半径"] = function() return 50 end,
            ["暴击投射物碰撞半径"] = function() return 100 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 2 + 50 end,
            ["天赋32伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 3 + 90 end
        }
    },
    ["新塔塔"] = {
        ["普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 5 end,
            ["三连击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.6 + 10 end,
            ["天赋11普攻伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.9 + 5 end,
            ["天赋12三连击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 15 end
        },
        ["大招"] = {
            ["分身id"] = function() return 6 end,
            ["天赋22分身id"] = function() return 7 end,
            ["分身持续时间"] = function() return 10 end,
            ["天赋31分身id"] = function() return 8 end,
            ["天赋31分身持续时间"] = function() return 20 end,
            ["天赋31和22分身id"] = function() return 9 end,
            ["天赋32分身数量"] = function() return 2 end
        }
    },
    ["钟无艳"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 20 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 + 30 end,
            ["特殊攻击治疗"] = function(____, source) return 5 + 2 * source:formula(Formula["展示面板_法术攻击"]) end,
            ["天赋11特殊攻击治疗"] = function(____, source) return (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.05 + 50 end,
            ["天赋12概率"] = function() return 0.2 end
        },
        ["大招"] = {
            ["伤害"] = function(____, value) return 100 + value * 0.2 end,
            ["天赋31伤害提升系数"] = function() return 0.1 end,
            ["天赋32effectId"] = function() return 102532 end
        }
    },
    ["熊猫人"] = {
        ["普通攻击"] = {
            ["第一击伤害"] = function(____, source) return 20 + source:formula(Formula["展示面板_物理防御"]) * 0.6 end,
            ["第二击伤害"] = function(____, source) return 10 + source:formula(Formula["展示面板_物理防御"]) * 0.8 end,
            ["第三段治疗"] = function(____, source) return 20 + source:formula(Formula["展示面板_物理防御"]) * 0.7 end,
            ["天赋11第一击伤害"] = function(____, source) return 20 + source:formula(Formula["展示面板_物理防御"]) * 0.8 end,
            ["天赋11第二击伤害"] = function(____, source) return 10 + source:formula(Formula["展示面板_物理防御"]) * 1 end,
            ["天赋12治疗"] = function(____, source) return 20 + source:formula(Formula["展示面板_物理防御"]) * 0.7 + source:getLevel() * 3 end,
            ["天赋22buff"] = function() return 102924 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 1 + 70 end,
            ["附加effectId"] = function() return 102931 end,
            ["天赋32伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 1 + 80 + source:formula(Formula["展示面板_血量上限"]) * 0.08 end
        }
    },
    ["黑天鹅"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 + 10 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 + 40 end,
            ["天赋11减少防御"] = function() return -0.2 end,
            ["天赋11减少防御持续时间"] = function() return 5 end,
            ["天赋12提升暴击"] = function() return 0.1 end,
            ["天赋12提升暴击持续时间"] = function() return 3 end
        },
        ["大招"] = {
            ["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_暴击"]) * 60 + 10 end,
            ["伤害跳数"] = function() return 10 end,
            ["天赋32buff"] = function() return 103531 end
        }
    },
    ["龛"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 0.5 + 20 end,
            ["特殊攻击中毒层数"] = function(____, level) return 10 + level end,
            ["天赋11普攻附加中毒层数"] = function() return 15 end,
            ["天赋12特殊攻击召唤僵尸概率"] = function() return 0.5 end
        },
        ["铁皮僵尸普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end},
        ["剧毒僵尸普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end}
    },
    ["妖精剑士"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 end,
            ["天赋11伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 end,
            ["天赋11伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.1 end
        },
        ["被动"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.4 end,
            ["天赋21伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end,
            ["天赋21伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.4 end,
            ["天赋22额外暴击率"] = function() return 0.3 end
        },
        ["大招"] = {
            ["血剑数量"] = function() return 5 end,
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.4 end,
            ["天赋31伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end,
            ["天赋31伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.4 end,
            ["天赋32提升攻击攻速"] = function() return 0.3 end,
            ["天赋32buff持续时间"] = function() return 5 end
        }
    },
    ["吉格"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.4 + 5 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.5 end,
            ["天赋11召唤数量"] = function() return 1 end,
            ["天赋12特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 end
        },
        ["大招"] = {
            ["召唤数量"] = function() return 3 end,
            ["持续时间"] = function() return 6 end,
            ["天赋31召唤数量"] = function() return 4 end,
            ["天赋32持续时间"] = function() return 8 end
        },
        ["蝮蛇普通攻击"] = {["伤害"] = function(____, source, parentAtk, count) return (parentAtk * 0.2 + 3) * 0.55 + (parentAtk * 0.2 + 3) * 0.15 * count end}
    },
    ["希露"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 10 end,
            ["特殊攻击所需次数"] = function() return 4 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + source:formula(Formula["展示面板_闪避"]) * 100 end,
            ["特殊攻击提升闪避"] = function() return 0.2 end,
            ["特殊攻击闪避持续时间"] = function() return 2 end,
            ["天赋11特殊攻击所需次数"] = function() return 3 end,
            ["天赋12特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + source:formula(Formula["展示面板_闪避"]) * 140 end
        },
        ["大招"] = {
            ["第一段击飞伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 100 + 50 end,
            ["第二段三连击单次伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 20 + 15 end,
            ["第三段击退伤害"] = function(____, source) return source:formula(Formula["展示面板_闪避"]) * 300 + 50 end,
            ["击退距离"] = function() return 100 end,
            ["击退高度"] = function() return 0 end,
            ["天赋31三连击暴击附加buff"] = function() return 101631 end,
            ["天赋32伤害提升系数"] = function(____, source, buffId) return source:getEffectQuantity(buffId) * 0.015 end
        }
    },
    ["三观"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 + 8 end,
            ["投掷伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 8 end,
            ["天赋11获得护盾"] = function(____, source) return source:getLevel() * 2 end,
            ["天赋12有护盾时投掷伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.2 + 8 end
        },
        ["被动"] = {
            ["英雄增加护盾"] = function(____, source) return source:getLevel() * 4 + 20 end,
            ["佣兵增加护盾"] = function(____, source) return (source:getLevel() * 4 + 20) * 0.5 end,
            ["天赋21伤害"] = function(____, source) return source:getLevel() * 2 + 40 end,
            ["天赋22概率"] = function() return 0.1 end
        },
        ["大招"] = {
            ["吃小孩护盾"] = function(____, source) return source:getLevel() * 2 + 35 end,
            ["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_每5秒获得护盾"]) * 0.4 + 15 end,
            ["吐小孩击退距离"] = function() return 350 end,
            ["天赋31吃小孩护盾"] = function(____, source) return source:getLevel() * 10 + 35 end,
            ["天赋32吐小孩附加buffId"] = function() return 103231 end
        }
    },
    ["秋山"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 10 end,
            ["飓风斩伤害"] = function(____, source) return source:getLevel() * 3 + 20 end,
            ["踏风斩伤害"] = function(____, source) return source:getLevel() * 6 + 20 end,
            ["飓风斩附加buffId"] = function() return 101912 end,
            ["踏风斩次数上限"] = function() return 6 end,
            ["踏风斩治疗"] = function(____, source) return source:getLevel() * 2 end,
            ["天赋11伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 + 10 end,
            ["天赋12飓风斩伤害"] = function(____, source) return source:getLevel() * 5 + 20 end,
            ["天赋21击飞所需踏风斩次数"] = function() return 3 end,
            ["天赋22踏风斩次数上限"] = function() return 4 end,
            ["天赋31飓风斩数量"] = function() return 3 end,
            ["天赋31飓风斩伤害系数"] = function() return 0.2 end,
            ["天赋32飓风斩降低物防百分比"] = function() return -0.2 end,
            ["天赋32飓风斩降低物防持续时间"] = function() return 5 end
        },
        ["大招"] = {buffId = function() return 101931 end}
    },
    ["大头"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.01 + 25 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.02 + 40 end,
            ["天赋11特殊攻击恢复"] = function(____, source, count) return (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.01 * math.min(count, 6) end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.025 + 25 end
        },
        ["大招"] = {
            ["伤害跳数"] = function() return 6 end,
            ["每跳伤害"] = function(____, source) return source:getLevel() * 1.5 + 8 end,
            ["最后一击伤害"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.05 + 20 end,
            ["伤害范围"] = function(____, source) return 450 * math.floor(source:p(_____4F53_578B) * 10) / 10 end,
            ["天赋31最后一击追加伤害"] = function(____, target) return target:formula(Formula["展示面板_血量上限"]) * 0.05 end,
            ["天赋32每跳伤害"] = function(____, source) return (source:getLevel() * 1.5 + 8) * 2 end
        }
    },
    ["时之女妖"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 + 10 end,
            ["溅射伤害系数"] = function() return 0.5 end,
            ["附加buffId"] = function() return 102611 end,
            ["同时发射数量"] = function(____, source) return 1 + math.max(
                0,
                math.min(
                    4,
                    math.floor(source:formula(Formula["展示面板_法术攻击"]) / 55)
                )
            ) end,
            ["天赋12同时发射数量"] = function(____, source) return 1 + math.min(
                4,
                1 + math.max(
                    0,
                    math.min(
                        4,
                        math.floor(source:formula(Formula["展示面板_法术攻击"]) / 55)
                    )
                )
            ) end,
            ["天赋11额外附加buffId1"] = function() return 102612 end,
            ["天赋11额外附加buffId2"] = function() return 102613 end,
            ["溅射伤害buffId"] = function() return 102619 end
        },
        ["被动"] = {
            ["附加buffId"] = function() return 102621 end,
            ["天赋21附加buffId"] = function() return 102622 end,
            ["天赋22附加buffId"] = function() return 102623 end
        },
        ["大招"] = {
            ["附加buffId1"] = function() return 102631 end,
            ["附加buffId2"] = function() return 102632 end,
            ["附加buffId3"] = function() return 102633 end,
            ["天赋31友方附加buffId"] = function() return 102634 end,
            ["天赋32友方附加buffId"] = function() return 102635 end
        }
    },
    ["莉莉"] = {
        ["普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 + 10 end,
            ["普攻伤害频率"] = function() return 5 end,
            ["特殊攻击伤害"] = function(____, source) return source:getLevel() * 3 + 20 end,
            ["特殊攻击附加buffId"] = function() return 102013 end,
            ["天赋11普攻伤害频率"] = function(____, source) return 5 + math.max(
                0,
                math.min(
                    4,
                    math.floor((source:formula(Formula["展示面板_攻速"]) - 1) / 0.2)
                )
            ) end,
            ["天赋12特殊攻击刷新释放最大次数"] = function() return 3 end
        },
        ["大招"] = {
            ["伤害"] = function(____, source) return source:getLevel() * 10 + 40 end,
            ["治疗"] = function(____, source, hurtValue) return math.min(
                hurtValue * 0.1,
                source:formula(Formula["展示面板_血量上限"]) * 0.1
            ) end,
            ["天赋31对流血伤害"] = function(____, source) return (source:getLevel() * 10 + 40) * 1.4 end,
            ["天赋32附加buffId"] = function() return 102013 end
        },
        ["大灰狼普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["治疗"] = function(____, parent) return parent:getLevel() * 2 + 12 end
        }
    },
    ["玲珑"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.4 + 25 end,
            ["特殊攻击概率"] = function(____, source) return 0.1 + source:p(_____95EA_907F_7387) * 0.5 end,
            ["特殊攻击段数"] = function() return 3 end,
            ["特殊攻击伤害"] = function(____, source) return 15 + source:p(_____95EA_907F_7387) * 80 end,
            ["天赋11特殊攻击概率"] = function(____, source) return 0.1 + source:p(_____95EA_907F_7387) * 0.7 end,
            ["天赋12特殊攻击伤害"] = function(____, source) return 15 + source:p(_____95EA_907F_7387) * 50 + source:formula(Formula["展示面板_法术攻击"]) * 0.3 end
        },
        ["被动"] = {
            ["自己附加buffId"] = function() return 102321 end,
            ["敌人附加buffId"] = function() return 102322 end,
            ["天赋21敌人附加buffId"] = function() return 102323 end,
            ["天赋22敌人附加buffId"] = function() return 102324 end,
            ["天赋22自己附加buffId"] = function() return 102325 end
        },
        ["大招"] = {
            ["偷取双抗系数"] = function(____, source) return source:p(_____95EA_907F_7387) * 0.4 + 0.05 end,
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 + source:p(_____95EA_907F_7387) * 300 end
        }
    },
    ["爱神"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.7 + 15 end,
            ["分裂箭伤害系数"] = function() return 0.7 end,
            ["普攻分裂概率"] = function() return 0.15 end,
            ["分裂叠加buffId"] = function() return 103612 end,
            ["对敌人附加buffId"] = function() return 103611 end,
            ["天赋11附加撕裂概率"] = function() return 0.5 end,
            ["天赋12普攻分裂概率"] = function() return 0.25 end
        },
        ["被动"] = {
            ["箭矢数量"] = function(____, count) return math.min(10 + count, 20) end,
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 8 end,
            ["天赋21箭矢数量"] = function(____, count) return math.min(10 + count * 2, 20) end,
            ["天赋22伤害"] = function(____, source, target) return math.min(
                10000,
                (source:formula(Formula["展示面板_物理攻击"]) * 0.6 + 8) * (1 + math.min(
                    1,
                    target:v(_____8840) / target:formula(Formula["展示面板_血量上限"])
                ))
            ) end
        },
        ["大招"] = {
            ["伤害"] = function(____, source, count) return 0.5 * source:getLevel() * count + 15 end,
            ["天赋31附加buffId"] = function() return 103631 end,
            ["天赋31附加buff层数"] = function(____, count) return math.min(
                5,
                math.floor(count / 6)
            ) end,
            ["天赋32附加buffId"] = function() return 103632 end
        }
    },
    ["天命人"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 0.8 + 10 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 1.2 + 20 end,
            ["天赋11治疗"] = function(____, source) return (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.05 end,
            ["天赋12附加debuff"] = function() return 103813 end
        },
        ["被动"] = {
            ["附加debuff"] = function() return 103829 end,
            ["天赋22自身附加buffId"] = function() return 103823 end
        },
        ["大招"] = {
            ["召唤数量"] = function() return 5 end,
            ["持续时间"] = function() return 10 end,
            ["天赋31附加buff"] = function() return 103831 end,
            ["天赋32额外当头一棒概率"] = function() return 0.1 end
        },
        ["猴子猴孙普通攻击"] = {
            ["伤害"] = function(____, source) return (source:formula(Formula["展示面板_物理防御"]) * 0.8 + 10) * 0.75 end,
            ["特殊攻击伤害"] = function(____, source) return (source:formula(Formula["展示面板_物理防御"]) * 1.2 + 20) * 0.75 end
        }
    },
    ["膨肥兔"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术防御"]) * 1 + 15 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_法术防御"]) * 1 + source:formula(Formula["展示面板_法术攻击"]) * 1 + 80 end,
            ["特殊攻击伤害系数"] = function() return 0.6 end,
            ["特殊攻击目标数量"] = function() return 4 end,
            ["特殊攻击概率"] = function() return 0.18 end,
            ["天赋11净化debuff数量"] = function() return 3 end,
            ["天赋12特殊攻击概率"] = function(____, source) return math.min(
                source:formula(Formula["展示面板_法术攻击"]),
                120
            ) * (0.4 / 120) + 0.18 end
        },
        ["被动"] = {
            ["附加buff"] = function() return 103122 end,
            ["影响范围"] = function() return 1000 end,
            ["天赋21附加毒层数"] = function() return 30 end,
            ["天赋22附加buff"] = function() return 103123 end,
            ["天赋22影响范围"] = function() return 1500 end
        },
        ["大招"] = {
            ["目标伤害"] = function(____, source) return source:formula(Formula["展示面板_法术防御"]) * 2 + 80 end,
            ["沿途伤害"] = function(____, source) return source:formula(Formula["展示面板_法术防御"]) * 1 end,
            ["天赋31附加毒层数"] = function() return 40 end,
            ["天赋32附加buff"] = function() return 103131 end
        }
    },
    ["科学怪人"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 + 20 end,
            ["爆气伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 + source:formula(Formula["展示面板_血量上限"]) * 0.03 end,
            ["天赋11爆气附加buff"] = function() return 102813 end,
            ["天赋12爆气附加buff"] = function() return 102814 end
        },
        ["大招"] = {
            ["消耗血量"] = function(____, source) return source:v(_____8840) * 0.05 end,
            ["伤害"] = function(____, value) return value * 2.5 + 90 end,
            ["投射物半径"] = function() return 150 end,
            ["天赋31投射物缩放"] = function(____, source) return 1.5 * (1 + math.min(
                12000,
                source:formula(Formula["展示面板_血量上限"])
            ) / 12000 * 0.5) end,
            ["天赋32恢复生命值"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.04 end
        }
    },
    ["锦鲤"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end,
            ["回旋刃概率"] = function(____, source) return source:getEffectQuantity(source:v(_____5929_8D4B_2) == 0 and 101127 or (source:v(_____5929_8D4B_2) == 1 and 101128 or 101129)) * 0.001 + 0.1 end,
            ["回旋刃伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["天赋11回旋刃伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.4 end,
            ["天赋12回旋刃概率"] = function(____, source) return source:getEffectQuantity(source:v(_____5929_8D4B_2) == 0 and 101127 or (source:v(_____5929_8D4B_2) == 1 and 101128 or 101129)) * 0.002 + 0.1 end
        },
        ["大招"] = {
            ["原皮替身id"] = function() return 24 end,
            ["皮肤替身id"] = function() return 26 end,
            ["狂战buff"] = function() return 101131 end,
            ["天赋31原皮替身id"] = function() return 25 end,
            ["天赋31皮肤替身id"] = function() return 27 end,
            ["天赋32狂战buff"] = function() return 101132 end
        }
    },
    ["毒研法师"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 + 10 end,
            ["毒液压制概率"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.0025 + 0.1 end,
            ["毒液压制目标数量"] = function() return 4 end,
            ["毒液压制伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 + 20 end,
            ["毒液压制中毒层数"] = function(____, source, target) return math.floor(math.min(
                math.max(
                    source:formula(Formula["展示面板_法术攻击"]) - target:formula(Formula["展示面板_法术攻击"]),
                    0
                ),
                1
            )) * 40 end,
            ["天赋11毒液压制额外中毒层数"] = function(____, source, target) return math.floor(math.min(
                math.max(
                    source:formula(Formula["展示面板_血量上限"]) - target:formula(Formula["展示面板_血量上限"]),
                    0
                ),
                3000
            ) / 1000) * 40 end,
            ["天赋12毒液压制目标数量"] = function() return 6 end
        },
        ["被动"] = {
            ["中毒层数"] = function(____, source) return source:getLevel() * 2 end,
            ["中毒层数350_500"] = function(____, source) return source:getLevel() * 3 + 10 end,
            ["中毒层数350"] = function(____, source) return source:getLevel() * 4 + 20 end
        },
        ["大招"] = {
            ["首目标伤害"] = function(____, target) return target:getEffectQuantity(1) * 1 + 100 end,
            ["弹射目标伤害"] = function(____, target) return target:getEffectQuantity(1) * 0.3 + 80 end,
            ["附加中毒层数"] = function() return 40 end,
            ["天赋31附加buff"] = function() return 101231 end,
            ["天赋31每层附加中毒层数"] = function() return 20 end,
            ["天赋32首目标伤害系数"] = function() return 2 end
        }
    },
    ["黄金甲"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 0.7 + 18 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 2 end,
            ["特殊攻击目标数量"] = function() return 3 end,
            ["特殊攻击击飞延迟"] = function() return 0.5 end,
            ["天赋11伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 0.9 + 18 end
        },
        ["大招"] = {
            ["附加buff"] = function() return 103931 end,
            ["召唤物id"] = function() return 28 end,
            ["召唤物数量"] = function() return 4 end,
            ["召唤物伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 1.5 + 40 end,
            ["天赋31召唤物数量"] = function() return 6 end,
            ["天赋32附加buff"] = function() return 103933 end
        }
    },
    ["灵魄"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 + 5 end,
            ["恢复"] = function(____, source) return (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.02 end,
            ["天赋11附加中毒概率"] = function(____, count) return 0.1 * count end,
            ["天赋11附加中毒层数"] = function() return 30 end,
            ["天赋12法爆时额外固伤"] = function(____, count) return count * 10 end
        },
        ["大招"] = {
            ["每颗珠子伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 + 8 end,
            ["最后一颗伤害"] = function(____, source, count) return source:formula(Formula["展示面板_法术攻击"]) * 0.3 * count end,
            ["爆炸溅射数量"] = function() return 4 end,
            ["提前爆炸伤害系数"] = function() return 2 end,
            ["天赋31保留珠子数量"] = function(____, source, count) return math.min(
                count,
                math.floor(source:formula(Formula["展示面板_法术攻击"]) / 5)
            ) end,
            ["天赋32附加中毒层数"] = function(____, count) return count * 20 end
        }
    },
    ["矮人王"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + source:formula(Formula["展示面板_法术防御"]) * 0.5 end,
            ["特殊攻击概率"] = function() return 0.2 end,
            ["特殊攻击溅射数量"] = function() return 4 end,
            ["天赋11特殊攻击概率"] = function(____, source) return math.min(
                0.2,
                source:formula(Formula["展示面板_法术防御"]) * 0.2 / 200
            ) + 0.2 end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_物理防御"]) * 0.5 + source:formula(Formula["展示面板_法术防御"]) * 0.7 end
        },
        ["大招"] = {
            ["附加buff"] = function() return 104131 end,
            ["天赋31附加buff"] = function() return 104132 end,
            ["天赋32附加buff"] = function() return 104133 end
        }
    },
    ["游侠"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["特殊攻击概率"] = function(____, source) return source:p(_____66B4_51FB_7387) / 3 + 0.1 end,
            ["特殊攻击伤害次数"] = function() return 3 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + source:p(_____66B4_51FB_7387) * 80 end,
            ["特殊攻击影响范围"] = function() return 150 end,
            ["天赋11暴击分裂箭伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["天赋12特殊攻击影响范围"] = function() return 150 * 1.2 end
        },
        ["大招"] = {
            ["召唤物id"] = function() return 29 end,
            ["召唤物数量上限"] = function() return 4 end,
            ["召唤物伤害"] = function(____, source) return source:getLevel() * 4 + 20 end,
            ["天赋32附加buff"] = function() return 104241 end
        }
    },
    ["战王"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 + 10 end,
            ["特殊攻击护盾"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.02 end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 + 10 end
        },
        ["被动"] = {
            ["转换真实伤害比例"] = function(____, source) return math.min(
                0.6,
                source:p(_____901A_7528_62A4_76FE) / source:formula(Formula["展示面板_血量上限"])
            ) end,
            ["天赋21转换真实伤害比例"] = function(____, source) return math.min(
                1,
                source:p(_____901A_7528_62A4_76FE) / source:formula(Formula["展示面板_血量上限"])
            ) end
        },
        ["大招"] = {
            ["附加buff"] = function() return 104331 end,
            ["天赋31附加buff"] = function() return 104333 end
        }
    },
    ["战狂"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 35 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 + 60 end,
            ["特殊攻击恢复"] = function(____, source) return source:getLevel() * 5 + 15 end,
            ["天赋11特殊攻击恢复"] = function(____, source) return math.floor(source:getLevel() * 5 + 15 + (source:formula(Formula["展示面板_血量上限"]) - source:v(_____8840)) * 0.03) end,
            ["天赋12特殊攻击额外恢复"] = function(____, target) return target:p(_____901A_7528_62A4_76FE) * 0.5 end,
            ["天赋12总回血量"] = function(____, total, source) return math.floor(math.min(
                total,
                source:formula(Formula["展示面板_血量上限"]) * 0.08
            )) end
        },
        ["大招"] = {
            ["伤害"] = function(____, value) return 40 + value * 0.2 end,
            ["天赋31伤害"] = function(____, value) return 40 + value * 0.25 end,
            ["天赋32附加buff"] = function() return 104431 end
        }
    },
    ["风伯"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:getLevel() * 3 + 30 end,
            ["特殊攻击概率"] = function() return 0.2 end,
            ["特殊攻击伤害"] = function(____, source) return source:getLevel() * 5 + 30 end,
            ["天赋11普攻伤害"] = function(____, source) return source:getLevel() * 5 + 30 + source:formula(Formula["展示面板_法术攻击"]) * 0.5 end,
            ["天赋11特殊攻击伤害"] = function(____, source) return source:getLevel() * 10 + 30 + source:formula(Formula["展示面板_法术攻击"]) * 0.5 end,
            ["天赋12附加buff"] = function() return 104511 end
        },
        ["大招"] = {
            ["初始龙卷风数量"] = function() return 4 end,
            ["龙卷风伤害"] = function(____, source) return source:getLevel() * 15 + 15 end,
            ["爆炸伤害"] = function(____, source) return source:getLevel() * 10 + 40 end,
            ["龙卷风叠加数量所需次数"] = function() return 2 end,
            ["龙卷风叠加数量"] = function() return 1 end,
            ["龙卷风数量上限"] = function() return 8 end,
            ["天赋31龙卷风伤害"] = function(____, source) return source:getLevel() * 20 + 10 + source:formula(Formula["展示面板_法术攻击"]) * 0.5 end,
            ["天赋32爆炸伤害"] = function(____, source, count) return source:getLevel() * 30 + 50 + count * 50 end
        }
    },
    ["雨师"] = {
        ["普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end,
            ["附加buff"] = function() return 104611 end,
            ["天赋11附加buff概率"] = function() return 0.2 end,
            ["天赋12伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.2 end
        },
        ["大招"] = {
            ["持续时间"] = function() return 5 end,
            ["伤害跳数"] = function() return 5 end,
            ["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 + 20 end,
            ["附加buff概率"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.001 + 0.1 end,
            ["附加buff"] = function() return 104611 end,
            ["天赋31附加buff概率"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.002 + 0.1 end,
            ["天赋32伤害跳数"] = function() return 7 end
        }
    },
    ["冰巨人"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end
    }},
    ["石巨人"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.25 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.25 end
    }},
    ["冰斧巨人"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end
    }},
    ["火魔怪"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.25 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.25 end
    }},
    ["雷龙"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.6 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.6 end
    }},
    ["大雷龙"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.55 end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.55 end
    }},
    ["水晶"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
        ["附加buff"] = function() return 1053 end
    }},
    ["国王"] = {["普通攻击"] = {
        ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
        ["暴击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
        ["附加buff"] = function() return 1054 end
    }},
    ["精英技能"] = {
        ["密教战士大招"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["密教战士普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end},
        ["钢人普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.9 end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 end
        },
        ["钢人大招"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 6 end},
        ["海妖普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 3 end},
        ["海妖大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 5 end,
            ["护盾值"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.06 end
        },
        ["恶魔普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["暴击额外伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.6 end
        },
        ["恶魔大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 3 end,
            ["单体伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 8 end
        },
        ["牛头人普通攻击"] = {
            ["一段伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.1 end,
            ["二段伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
            ["三段伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end
        },
        ["牛头人大招"] = {buffId = function() return 280531 end},
        ["司令法师普通攻击"] = {
            ["普通伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["特殊攻击伤害"] = function(____, source, target) return source:formula(Formula["展示面板_法术攻击"]) * 1 + target:formula(Formula["展示面板_血量上限"]) * 0.05 end
        },
        ["司令法师大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end,
            ["恢复"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end
        },
        ["火元素普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 end,
            buffId = function() return 280711 end
        },
        ["火元素大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 end,
            buffId = function() return 280711 end
        },
        ["魔女普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end},
        ["魔女大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.4 end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.3 end
        },
        ["蛇女普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.3 end,
            ["附加中毒层数"] = function() return 10 end
        },
        ["蛇女大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.4 end,
            ["附加中毒层数"] = function() return 20 end,
            ["附加物理防御叠加"] = function() return -5 end,
            ["最后一击附加中毒层数"] = function() return 150 end
        },
        ["大石头普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.6 end},
        ["大石头大招"] = {
            ["蓄力每跳获得护盾值"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.0025 end,
            ["伤害"] = function(____, source) return source:p(53) * 1.5 + 50 end
        },
        ["炎魔普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end,
            ["附加effectId"] = function() return 281111 end
        },
        ["炎魔大招"] = {["持续时间"] = function() return 10 end},
        ["地精法师普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.9 end,
            ["附加获得蓝量"] = function() return -5 end
        },
        ["地精法师大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.4 end,
            ["沉默时长"] = function() return 3 end
        },
        ["力法师普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end},
        ["力法师大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2.5 end,
            ["眩晕时长"] = function() return 2 end
        },
        ["蜡烛人普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.2 end,
            ["自我伤害"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.02 end,
            ["附加effectId"] = function() return 281511 end
        },
        ["蜡烛人大招"] = {["伤害"] = function(____, source, target) return source:formula(Formula["展示面板_法术攻击"]) * 1.5 + target:getEffectQuantity(281511) * 10 end},
        ["守护神普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 2 end},
        ["守护神大招"] = {["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end},
        ["泥巴怪普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 3 end},
        ["泥巴怪大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
            ["附加effectId"] = function() return 281811 end
        },
        ["左埃及兄弟普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 end,
            ["附加叠加最大生命值"] = function() return -10 end
        },
        ["左埃及兄弟大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
            ["附加effectId"] = function() return 281931 end
        },
        ["右埃及兄弟普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end,
            ["附加物攻法攻提升"] = function() return 0.02 end
        },
        ["右埃及兄弟大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end,
            ["降低双抗"] = function() return -200 end,
            ["降防持续时间"] = function() return 5 end
        },
        ["老鼠怪普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end},
        ["老鼠怪大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.7 end,
            ["附加暴击率"] = function() return -0.1 end,
            ["暴击率影响持续时间"] = function() return 5 end,
            ["最后一击附加眩晕时间"] = function() return 1.5 end
        },
        ["德鲁一普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 end},
        ["德鲁一大招"] = {["伤害"] = function(____, source, count) return source:formula(Formula["展示面板_法术攻击"]) * 1.5 * (1.5 - math.min(
            0.5,
            math.min(5, count) * 0.1
        )) end},
        ["大树人普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["恶魔之树普通攻击"] = {["附加中毒层数"] = function(____, source) return math.floor(source:getLevel() / 2) end},
        ["洞穿眼魔普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end},
        ["洞穿眼魔大招"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end},
        ["暗域树人普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.2 end,
            ["额外伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.2 end,
            ["第3段偷取法攻百分比"] = function() return 0.4 end,
            ["第3段偷取法攻持续时间"] = function() return 4 end,
            ["第4段扇形半径"] = function() return 600 end,
            ["第5段扇形半径"] = function() return 1200 end,
            ["额外伤害5"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 4 end
        },
        ["暗域树人大招"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.7 end},
        ["宝箱怪普通攻击"] = {
            ["伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 end
        },
        ["炮车怪普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end}
    },
    ["佣兵技能"] = {
        ["小小清道夫普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["猿猴普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.8 end},
        ["红屁龙普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["烈火元素普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["烈火元素大招"] = {
            ["治疗"] = function(____, source) return 100 end,
            buffId = function() return 311212 end
        },
        ["蛮子普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["左手获得护盾"] = function() return 80 end,
            ["右手额外固定伤害"] = function() return 30 end
        },
        ["地翁普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["树精普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["对护盾伤害提升后的伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.8 end
        },
        ["火元素普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["石头人普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["蓝屁龙普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["蓝屁龙大招"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["水元素普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["水元素大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            buffId = function() return 311112 end,
            ["每个击中单位回蓝"] = function() return 5 end
        },
        ["阿努比射普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["对召唤物伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end
        },
        ["冰川石头人普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end},
        ["红色小法师普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["鸡裁判普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            buffId = function() return 316111 end
        },
        ["和风喵普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["和风喵大招"] = {["治疗"] = function(____, source) return 75 end},
        ["大炮怪物普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["超级士兵普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["治疗"] = function() return 30 end
        },
        ["平衡车炮手普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["平衡车炮手大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["降低法抗"] = function() return -10 end
        },
        ["礼帽兔普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["异形怪物普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["物防降低"] = function() return -20 end
        },
        ["蛮族将军普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["回血阈值"] = function() return 0.3 end,
            ["治疗"] = function() return 40 end
        },
        ["蓝发少女普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["伤害提升后的伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.35 end
        },
        ["猩猩普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["猩猩被动"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["自己buffId"] = function() return 317122 end,
            ["别人buffId"] = function() return 317123 end
        },
        ["蝴蝶女普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["猫女巫普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["猫女巫大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            buffId = function() return 317321 end
        },
        ["血火狂徒普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["恢复系数"] = function() return 0.2 end
        },
        ["不死精锐普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["爆炸伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.2 end,
            buffId = function() return 317511 end
        },
        ["古木树人普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["兔女巫普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["兔女巫大招"] = {
            ["治疗"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 20 end,
            buffId = function() return 317721 end
        },
        ["抬棺骷髅大招"] = {
            ["召唤123档佣兵和谐星骷髅概率梯度"] = function() return {0.4, 0.8, 0.9, 1} end,
            ["每发飞弹伤害"] = function(____, source) return 4 end,
            buffId = function() return 317821 end
        },
        ["谐星骷髅普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["警卫骷髅普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["弓箭骷髅普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["热舞武僧普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["青蛇妖普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["额外攻击概率"] = function() return 0.4 end,
            ["叠毒层数"] = function() return 10 end
        },
        ["乐子佛普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["魔女巫普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["魔女巫大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 2 end,
            buffId = function() return 318221 end
        },
        ["御陨术士普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["御陨术士大招"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 3 end,
            buffId = function() return 312621 end,
            ["buff层数"] = function() return 1 end,
            buffId2 = function() return 312622 end
        },
        ["天命战神普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["治疗"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.05 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
            ["目标buffId"] = function() return 312711 end,
            ["自己buffId"] = function() return 312712 end
        },
        ["毁灭先锋普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["特殊攻击伤害"] = function(____, source, target) return source:formula(Formula["展示面板_物理攻击"]) * 3 * (1 + math.min(
                1,
                target:formula(Formula["展示面板_物理防御"]) / 200
            )) end
        },
        ["往生佛陀普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["樱花妖普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            buffId = function() return 313011 end
        },
        ["樱花妖大招"] = {["治疗"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.15 end},
        ["埃及猫普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["埃及猫大招"] = {
            ["每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1 end,
            ["跳数"] = function() return 5 end
        },
        ["冥府守卫普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["特殊攻击每跳伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1 end,
            ["特殊攻击每跳恢复"] = function(____, value) return value * 0.3 end
        },
        ["卢金易普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["暴击附加buffId"] = function() return 313311 end,
            ["特殊攻击伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.5 end,
            ["特殊攻击附加buffId"] = function() return 313312 end
        },
        ["幽林神使普通攻击"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["玄网金卫普通攻击"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["回蓝"] = function() return 10 end
        },
        ["玄网金卫大招"] = {buffId = function() return 313521 end}
    },
    ["小怪技能"] = {
        ["呆逼蛮熊"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["额外伤害概率"] = function() return 0.25 end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.25 end
        },
        ["野猪"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["蜘蛛"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.7 end,
            ["附加中毒层数"] = function() return 2 end
        },
        ["绿蛤蟆"] = {
            ["物理伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end,
            ["法术伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.5 end
        },
        ["冰狼"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end},
        ["火狼"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["每层叠加法攻"] = function() return 1 end,
            ["最大层数"] = function() return 15 end
        },
        ["螳螂"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.2 end
        },
        ["蜘蛛2"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            buffId = function() return 240611 end
        },
        ["雪怪"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["眩晕概率"] = function() return 0.2 end,
            ["眩晕时长"] = function() return 1 end
        },
        ["绿蛤蟆2"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["附加中毒层数"] = function() return 6 end
        },
        ["蓝蛤蟆"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["螳螂2"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["额外伤害概率"] = function() return 0.25 end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end
        },
        ["火蝠"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["双抗降低"] = function() return -2 end
        },
        ["小娃娃"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.2 end},
        ["甲壳肥"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.8 end,
            ["附加真实伤害"] = function(____, source) return 20 end,
            buffId = function() return 240812 end
        },
        ["黄龙"] = {
            ["第一段伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["第二段真实伤害"] = function(____, source) return 300 end
        },
        ["绿龙"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.5 end},
        ["亡灵枪手"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end},
        ["史莱姆"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["呆瓜"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["亡灵弓手"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["捣蛋鬼"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["奥术龙"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end,
            ["扣除蓝量"] = function() return -1 end
        },
        ["亡灵剑士"] = {
            ["伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 1.25 end,
            ["伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 1.25 end
        },
        ["僵尸厨师"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["治疗"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.05 end
        },
        ["古代甲虫"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) end},
        ["摄魂怪"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["硬甲恐兽"] = {["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end},
        ["深海鲨手"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["额外伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.5 end
        },
        ["渴血狂魔"] = {
            ["伤害"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) end,
            ["治疗"] = function(____, source) return source:formula(Formula["展示面板_血量上限"]) * 0.01 end
        }
    },
    ["流派卡召唤物"] = {["替身魔像"] = {
        ["伤害1"] = function(____, source) return source:formula(Formula["展示面板_物理攻击"]) * 0.6 end,
        ["伤害2"] = function(____, source) return source:formula(Formula["展示面板_法术攻击"]) * 0.6 end
    }}
}
return ____exports
